{"jobs":[{"job":"Content Marketing Manager","company":"Magic Eden","location":"San Francisco","post_date":"35m","link":"https://web3.career/content-marketing-manager-magiceden/40221","key":"40221","details":"Magic Eden is the leading community centric cross chain marketplace. Our mission is to be the destination for discovery, self-expression, and ownership across digital cultures.\nMagic Eden has a build-first culture. We ship first, improve always. We are inclusive and open. We know the stakes and accept our flaws with a champion’s mindset. Working at Magic Eden is a chance to really dig in deep and grow. There is no fear of failure here. We embrace fear and show up for each other with empathy and care. We’ve mastered the art of working remotely as our team is spread across different time zones in Asia, Australia, Europe, and North and South America.\nReporting into the Head of Marketing, the Content Marketing Manager will be responsible for strategically developing and tracking performance of content across Magic Eden’s owned channels, including socials, editorial, and website. This individual should be a bold, visionary self-starter with both a creative and analytical mindset. They should possess deep experience or curiosity in web3 and have a passion for how content can play a role in onboarding a significant number of new users onto Magic Eden.\nThis is a U.S. based position, although for the right candidate we can accommodate remote work from time zones that are close to US working hours.\nResponsibilities\n\n\nLead a team of social and content associates and collaborate closely with them to help teach principles of ownership and autonomy\nDevelop socially viral content that is able to win the hearts and minds of the NFT ecosystem, whether that is Twitter Spaces, videos, podcasts, or other content series\nOwn content across all the pages on the Magic Eden domain (including the blog, games-related pages, developer-facing pages)\nWork with freelance writers to own editorial content for Magic Eden blog including curating pieces weekly that reflect the major market trends, notable creators, trader alpha, and product marketing news\nCreate educational content platform with ever-expanding library of content on Magic Eden domain from scratch to attract prospective creators and collectors\nOwn brand identity and translate seamlessly to all visual creative digital assets including videos and graphic assets\nCreate content performance dashboards to assess performance of content and social channels, using tools including Google analytics, SEMRush, etc. Have a clear point of view on how our content affects our major commercial KPIs; complete with post mortems on how campaigns can be more effective in the future\n\nQualifications\n\n4+ years of work experience with deep focus in brand marketing\nPreferred deep experience in NFTs and web3 and passionate about being a leader in the movement to help NFTs gain mass adoption\nExperience leading teams directly and cross-functionally\nStrong storytelling skills, and the ability to create clear and compelling narratives\nExcellent written, verbal, and professional communication skills\nStrong data analysis and problem-solving skills\nMix of marketing experience for B2B and B2C (mobile apps) strongly preferred\nKnowledge of the creator economy a huge plus\nFluency in content marketing analytics tools including Google analytics, SEMRush\n\nWhat you get:\n\nA fast-paced and collaborative environment\nCompetitive compensation and equity options\nFlexible PTO, 7 company holidays and 4 floating holidays\nComprehensive health, dental and vision plans\nWellness and work from home allowance\nRemote-first company\n401k plan (in the US)\n\nThe base salary for this position will vary based on geography and other factors. The base salary range for this role is $100,000 - $120,000. Additionally, this role is eligible to participate in Magic Eden’s equity plan. Final offer amount will be at the company’s sole discretion and determined by multiple factors, including years and depth of experience and expertise, location and other business considerations.\nMagic Eden is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\nMagic Eden is committed to providing reasonable accommodations during our recruitment process. If you need assistance or an accommodation, please let your Recruiter know. This employer participates in E-Verify\nMagic Eden is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\nMagic Eden is committed to providing reasonable accommodations during our recruitment process. If you need assistance or an accommodation, please let your Recruiter know. This employer participates in E-Verify\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["marketing","non-tech","nft"]},{"job":"Controller","company":"Fan Controlled Sports + Entertainment","location":"United States","post_date":"35m","link":"https://web3.career/controller-fancontrolledsports-entertainment/40220","key":"40220","details":"Fan Controlled Sports + Entertainment is looking to hire a Controller. The person in this role will be responsible for all aspects of financial accounting, monitoring, reporting, control, and compliance for the business. This is a leadership role for an experienced accounting professional who combines exceptional functional / technical skills with an ability to partner successfully with the business in a high growth, fast-track environment.\n\n\n\n\nResponsibilities\n\nManage and monitor all accounts, ledgers, and reporting systems ensuring compliance with appropriate GAAP standards and regulatory requirements as well as the requirements of third-party contracts/agreements\nPerform subsidiary and entity wide consolidations\nManage in-season player payroll processes to ensure timeliness, accuracy and compliance with local regulatory requirements\nMaintain internal control safeguards for the receipt of revenue, costs and both team and organizational budgets and actual expenditures\nIn conjunction with the CFO and Finance team, establish financial and operating benchmarks, budgets, program monitoring, and reporting standards on a bi-weekly, monthly, and annual basis\nImplement consistent accounting policies, practices, and procedures across all programs, upholding federal, state, and local legal standards by remaining knowledgeable about existing, new, and future legislation\nEnsure compliance with federal, state, and local requirements, including filing sales and use tax reports, annual reports and statements of information where required\nKnowledge of state sales tax and nexus is key\nDevelop and enforce internal controls to maximize protection of company assets, policies, procedures, and workflow\nOversee and support accounting team with dynamic leadership that creates an environment of trust and productivity\nProvide comprehensive financial updates to senior management by evaluating, analyzing, and reporting appropriate data points\nGuide financial decisions by applying company policies and procedures to current economic landscape\n\n\n\n\nExperience\n\n5+ years’ experience as a senior-level accounting or finance manager\n10+ years proven accounting experience\nProfessional accounting certification, CPA preferred\nAdvanced Excel skills required\nStrong working knowledge of QuickBooks Online and Dynamics Business Central, experience with Certify and Carta a plus\nWorking knowledge of finance law and regulatory standards (GAAP)\nWorking understanding of NFT’s and cryptocurrencies\nStrong understanding of economic and banking processes\nExperience with high volume of intercompany allocations across multiple entities\nExperience with consolidations\nExperience with working in multi-stakeholder environments\nSelf-starter and able to work effectively in remote work environment\nPreferred Experience includes:\nStrong working knowledge of detailed financial data analysis\nProven payroll experience, with a focus on streamlining accounting processes\nWorking knowledge of crypto accounting\nWorking knowledge of federal, state, and local tax compliance regulations and reporting\nCPA highly preferred\nHave worked in a startup environment or very small team before\n\n\n\n\nAbout Fan Controlled Sports & Entertainment (FCSE)\n\nFan Controlled Sports + Entertainment (FCSE) combines the best of traditional sports, video games and web3 to create an entirely new category of interactive sports. Fans own, build, and manage their teams, draft the players and call all the plays in real-time using FCSE’s patented digital technology.\n\nFCSE first launched Fan Controlled Football (FCF) in Spring 2021 and in just two seasons we've changed the game by putting fans at the center of the experience. In February 2023, FCSE will be launching Fan Controlled Hoops, bringing our model of a dynamic, disruptive, and engaging interactive sports experience to professional basketball.\n\nFCSE is backed by major corporate partners, venture capital firms, and celebrities, along with several well-known football and gaming fans from around the world of sports and entertainment.\n\n\n\n\n\nBenefits & Perks\n\nOpportunity for remote work pending the requirements of your role (working located in US time zones)\nOpen PTO and Sick Time policy\nMedical, dental, vision, and FSA/HSA benefits\nCompany paid short term disability, and supplemental offerings for life insurance, long term disability and the opportunity for 401k contribution\nCompetitive salary\n9-12 paid holidays per year\nOpportunity to hit the ground running and be a builder of an organization; FCSE is in high growth mode.\n\n\n\n\nOur Culture\n\nDo you think anew and think differently about challenges, often starting with a blank sheet of paper? Are humility and collaboration part of your DNA? Do you enjoy collaborating with people who have diverse backgrounds and >\n\nAdditional Qualifying Information\n\nNote: We are unable to provide visa sponsorship at this time. Applicants must be currently authorized to work in the United States without the need of employer sponsorship for a non-immigrant visa. We work in US time zones and expect team members to do the same.\n\n\n\n\nAt FCSE diversity, equity, and inclusion is at the foundation of everything we do in our business, organization, and culture. We encourage, facilitate, and promote diversity of both people and thought, and difference in support of our employees, stakeholders, and partners because it makes us better -- better as a company and better as a team. FCSE is honored to be an equal opportunity workplace.\n\nThis policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. The Fan Controlled Sports & Entertainment makes hiring decisions based solely on qualifications, merit, and business needs at the time.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["legal","nft"]},{"job":"Devops Engineer","company":"OKX","location":"Singapore","post_date":"1h","link":"https://web3.career/devops-engineer-okx/40217","key":"40217","details":"About OKX:\n\nFounded in 2017, OKX is one of the world’s leading cryptocurrency spot and derivatives exchanges. OKX innovatively adopted blockchain technology to reshape the financial ecosystem by offering some of the most diverse and sophisticated products, solutions, and trading tools on the market. Trusted by more than 20 million users in over 180 regions globally, OKX strives to provide an engaging platform that empowers everyone to explore the crypto world. In addition to its world-class Defi exchange, OKX serves its users with OKX Insights, a research arm at the cutting edge of the latest trends in the cryptocurrency industry. With its extensive range of crypto products and services and unwavering commitment to innovation, OKX’s vision is a world of financial access backed by the blockchain and the power of decentralised finance.\n\nResponsibilities\n\nResponsible for the design and deployment of OKX automation operation and maintenance system, CI/CD, CMDB and other modules;\nResponsible for the design and development of a one-stop operation and maintenance management platform solution of OKX;\nParticipated in the design of cloud solutions on the OKX business system and designed scalable technical solutions according to business requirements;\nResponsible for the reliable, stable and efficient operation of the online service and management system;\nPay attention to the trends of related products and technologies in the industry, and continue to explore multi-cloud management and hybrid deployment technologies;\n\nRequirements\n\nBachelor's degree or above, more than two years of working experience;\nProficient in Java development language and knowledge of computer networks, data structure, algorithms and operating system\nFamiliar with the design and development of Kubernetes, Docker applications, public cloud (AliCloud, AWS) product technology\nExperienced ability to Troubleshoot, can solve system problems and systematic analysis of the performance tuning;\nStrong awareness of ownership and team communication and collaboration ability;\nBilingual communication in English and mandarin to support regional operations.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["devops","dev","java"]},{"job":"Senior UX Designer – Mobile Trading App","company":"Bittrex","location":"Washington","post_date":"2h","link":"https://web3.career/senior-ux-designer-mobile-trading-app-bittrex/40216","key":"40216","details":"\n\nBittrex, a Seattle-based cryptocurrency exchange, is hiring a Senior UX Designer that can lead designs for our mobile trading app.Founded by three cybersecurity engineers in 2014, we build our products with security first, offering access to over 100 cryptocurrencies in the United States along with lightning-fast trade execution and dependable digital wallets. We believe in the potential of blockchain and its ability to provide game-changing solutions, and we’re looking for talented and passionate individuals to join our exceptional team.\n\nWe are looking for an outstanding Senior UX Designer with a track record for producing exceptional iOS and Android mobile apps. Do you have a passion for delving deep into problems and coming up with elegant design solutions? Do you have an inquisitive mind and love making things easier or more efficient for others to use? If so, we would love to hear from you.\n\nResponsibilities:\n\nPartner closely with product and research teams to deeply understand the needs and pain points of our customers through stakeholder and user interviews, and usability studies.\nDevelop customer journey maps, personas, user flows, and wireframes.\nRapidly create robust prototypes to explore and validate design solutions.\nProduce high fidelity UI designs and detailed specifications.\nEffectively communicate design choices and solutions with stakeholders as well as with engineers.\nConsistently championing customer needs and building empathy across functional teams.\nEstablish and maintain a consistent set of design systems and principles.\nMentor and coach junior designers.\n\nRequirements:\n\n5+ years of UX, UI, or product design experience.\n3+ years of iOS and Android app design experience.\nBachelor’s degree in UX design or related field.\nExpert in product design, user interaction design, visual design, storytelling, and prototyping.\nDeep understanding of the iOS and Material Design HIG.\nMust have an online portfolio demonstrating a solid understanding of user centered design, interaction design principles, and a high standard of creativity, craft, and quality, at a high velocity.\nMastery of industry standard tools such as Figma, Balsamiq, Proto.io, InVision.\nExcellent communication, presentation, and organizational skills.\nExperience working within and contributing to a structured design system.\nAbility to receive and give constructive feedback in a positive manner.\n\nBenefits at Bittrex:\n\nFully remote work\nFlex office space\nUnlimited PTO\n401(k) participating with employer match\nTop of the line health coverage\nHealth savings account (HSA)\nEducation and home office stipends\n\nAbout Bittrex:\n\n\nEstablished in 2014, Bittrex is a U.S. based cryptocurrency Exchange with a long-standing reputation for industry-leading security, world-class compliance, innovative products, and state-of-the-art trading and technology infrastructure.With lightning-fast trades, dependable digital wallets, and trusted security, our goal is to operate a world class cryptocurrency exchange with a focus on security and trust. We invite you along on our journey to advance the blockchain industry by fostering innovation, incubating new and emerging technologies, and driving transformative change.\n\n***\n\nBittrex is committed to a diverse and inclusive workplace. Bittrex is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\n\n**This is a fully remote, non-contract, direct hire position. Working remotely from a primary residence outside the United States is currently not permitted for this role.**\n\n#BI-Remote #LI-Remote #remotework\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["design","non-tech","mobile","senior"]},{"job":"Blockchain Security Engineer","company":"Nubank","location":"Sao Paulo","post_date":"3h","link":"https://web3.career/blockchain-security-engineer-nubank/40215","key":"40215","details":"About Nubank\n\nNubank was founded in 2013 to free people from a bureaucratic, slow and inefficient financial system. Since then, through innovative technology and outstanding customer service, the company has been redefining people's relationships with money across Latin America. With operations in Brazil, Mexico, and Colombia, Nubank is today one of the largest digital banking platforms and technology-leading companies in the world.\n\nToday, Nubank is a global company, with offices in São Paulo (Brazil), Mexico City (Mexico), Buenos Aires (Argentina), Bogotá (Colombia), Durham (United States), and Berlin (Germany). It was founded in 2013 in Sao Paulo, by Colombian David Vélez, and cofounded by Brazilian Cristina Junqueira and American Edward Wible. For more information, visit www.nubank.com.br.\n\nWe believe in:\n\nStrong and diverse teams;\nEnthusiasm for building and delivering new features and products;\nCapacity to keep learning new things while constantly improving what we are already good at;\nCollaborating efficiently to ship quality service/products.\n\nA bit more about this position:\n\nWe're creating a Blockchain security team. Nubank has started getting into the Crypto world and we're looking for a Senior Specialist to join our team and help secure future developments and initiatives.\n\nYou will fit well if you have:\n\nPrecious experience working with a blockchain related project (CEX, DEX or a specific cryptocurrency)\nCryptocurrencies engineering and implementation knowledge (how do they work, which consensus protocols they use, historical problems they faced).\nBlockchain infrastructure security knowledge (how to secure infrastructure running a blockchain project, permissions associated with each node, key management strategies, etc...).\nSmart contract programming knowledge in at least one language (as well as smart contract security code review knowledge)\nHistorical knowledge about security problems cryptocurrencies faced in general, biggest exploits that occurred, forking strategies.\nKnowledge about liquidity pools, creation and protecting against related attacks..\nGeneral knowledge about different crypto related technologies (minting, staking, lending, nft's, atomic swaps, layer 2 networks, etc...)\n\nBenefits:\n\nHealth, dental and life insurance\nMeal allowance\nTransportation assistance\n30 days of paid vacation\nEquity at Nubank\nParking partnership - discounted parking in our office\nFree bike parking with showers available\nNuCare - Our mental health and wellness assistance program\nNuLanguage - Our language learning program\nGympass partnership\nExtended maternity and paternity Leaves\nChild care allowance\n‘Espaço Feijão’- Private nursing and breastfeeding spaces in our buildings\nOnsite Health Center - Medical support for every Nubanker in our office\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["dev","security","blockchain","nft","node"]},{"job":"Blockchain Web3 Multimedia Production Intern","company":"Wolfram","location":"United States","post_date":"4h","link":"https://web3.career/blockchain-web3-multimedia-production-intern-wolfram/40214","key":"40214","details":"Wolfram, creator of Mathematica, Wolfram|Alpha and Wolfram Language, is looking for an efficient and detail-oriented Blockchain/Web3 Multimedia Production Intern. This intern will be responsible for helping with research for content, helping to produce content and performing limited project coordination for the Wolfram Research subsidiary Wolfram Blockchain Labs.\n\nThis position requires innate curiosity and the ability to research, schedule interviews, write about a variety of topics (blockchain services and people) and provide concise and timely results. The ideal candidate will be enthusiastic about blockchain technology and adept at collaborating with others. This is a part-time position with up to 29 hours per week.\n\nResponsibilities\n\n\nSupporting the team to proactively execute content production and research project plans for multiple projects\nResearching current trends in blockchain/Web3/cryptocurrencies and reporting on these to the team\nResearching and identifying key contacts in the Web3 world, reaching out to request and schedule interviews and providing briefs on their work to the interview team\nAssisting with writing and creating time stamp markers on content to help the team produce quality video, audio and multimedia products that are ready for final broadcasting\nAssisting with refining video and audio content to build a library of videos and episode segments\nSupporting the team’s marketing efforts to build a broad audience for the content\nUsing digital project management software (Jira) to manage tasks and deadlines and communicate with other team members\nCollaborating with cross-functional teams within the company\nEstablishing, documenting and improving internal processes\nMonitoring performance and project metrics and reporting them to team leads\nReporting on project statuses and escalating any risks or needs to senior stakeholders\n\nRequirements\n\nExcellent written and verbal communication skills\nHigh level of initiative and the ability to work independently to meet deadlines\nAbility to work independently and to manage time and tasks efficiently\nAptitude or interest in blockchain/Web3/cryptocurrencies\nAbility to handle confidential and sensitive information\nAbility to handle multiple projects and tasks simultaneously\nAbility to use (or willingness to learn) Wolfram Language at a basic level\n\nLocation: Champaign, Illinois, or remote\n\nWolfram is an equal opportunity employer and values diversity at its company. Women, people of color, members of the LGBTQ community, individuals with disabilities and veterans are strongly encouraged to apply.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["intern","entry","level","blockchain"]},{"job":"Senior Backend Engineer","company":"Ava Labs","location":"New York","post_date":"4h","link":"https://web3.career/senior-backend-engineer-avalabs/40213","key":"40213","details":"What you will do\n\nDesign and build distributed, scalable and highly performant backend systems to support a new application targeted at web2 developers\nPartner with product teams for new feature development and integration including [Avalanche Explorer](https://subnets.avax.network/defi-kingdoms), Core Wallets ([Core Ext](https://chrome.google.com/webstore/detail/core/agoakfejjabomempkjlepdflaleeobhb), [Web Wallet](https://wallet.avax.network/access)) and other blockchain applications\nClosely collaborate with the infrastructure team to build and deploy cloud applications\nWork with frontend developers to build an entirely new web application from the ground up\nLead the team and set best practices for building and maintaining large scale distributed systems\n\nWhat you will bring\n\nBS in Computer Science or equivalent experience\n5+ years of general backend development experience\n3+ years of experience building large scale enterprise systems\nExperience with Golang strongly preferred\nExperience with Typescript/Node.js a plus\nAWS Cloud Stack (DynamoDB, KMS, SQS, Lambda, ... ) preferred\nExperience with other cloud stacks a bonus\nCrypto experience preferred\n#LI-BA1\n#LI-Remote\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["backend","dev","senior","node","golang"]},{"job":"Institutional Business Development Associate","company":"Ava Labs","location":"New York","post_date":"4h","link":"https://web3.career/institutional-business-development-associate-avalabs/40212","key":"40212","details":"We are looking for a Business Development Associate that will straddle our Institutional and Defi verticals, as well as to drive persistent follow up and communication for long-term financial Institution partnerships. This role will be an integral part in bringing in new and exciting products to the Avalanche community.\n\nWHAT YOU WILL DO\nProvide general assistance to the business development team\nReviewing and analyzing Institutionally-focused DeFi projects\nAnalyzing all potential projects with a high level of scrutiny\nWriting, editing, and preparing communications on team leader's behalf\nGrow partnerships, develop novel product offerings, and sustain long term synergies\nCollaborate and align with internal product teams to ensure regulatory compliance\nLeverage the organization’s relationship with existing institutional accounts by developing and executing proactive, creative, and ongoing contact initiatives\nPrepare internal and partner's corporate documents\nCreate systems and processes to drive proactive outreach and relationship management\nEnsure that product and sales materials are always updated and targeted for applicable presentations, conferences, or opportunities\nDevelop and sustain a high level of professionalism among staff and clientele\nWHAT YOU WILL BRING\nBachelor's degree\nWall Street/Traditional Finance background\nKnowledge of Crypto/DeFi market\nDetail oriented\nGreat written/verbal communication\nSales/Business Development\nAnalysis Experience\nFront Office Knowledge\n\nSalary Range: $100,400 to $119,300 (**This is not a guarantee of compensation or salary, a final offer amount may vary based on factors including but not limited to experience and geographic location.)\n\n#LI-Remote #LI-TW1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Smart Contracts Fullstack engineer","company":"IOVLabs","location":"Remote","post_date":"4h","link":"https://web3.career/smart-contracts-full-stack-engineer-iovlabs/40211","key":"40211","details":"Smart Contracts Full-stack engineer\nEurope - Remote /\nRSK Apps & Services – Gateways /\n/ Remote\n\nApply for this job\nAbout IOV Labs\nOur purpose is to build a more decentralized world for a freer and fairer financial future.\nWe develop technology to re-engineer the way value is created and moved around the world.\n\n\nOur mission is bold. Our vision is big, and our purpose is deep.\nWe achieve our objectives as a team by using the IOVlabs values as our guiding principles.\n\n\nOur values reflect the fact that we’re a global, distributed team that embraces complex and revolutionary decentralized technologies, guided by a strong social purpose.\n\n\nIOV Labs is on a mission to provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy. IOV Labs promotes, develops, and supports the operation of the RSK Blockchain, a Turing-complete Bitcoin merge-mined smart contract platform - the most secure smart contract platform in the world. IOV Labs also develops the RSK Infrastructure Framework (RIF) to provide our partners with everything they need to build decentralized apps and new Open Finance services on the RSK Blockchain. RSK Users range from people securing their savings in Argentina, to workers sending home remittance payments from overseas. RSK is quickly becoming the emerging market blockchain.\n\n\nIf you’re keen to join the technological revolution at IOV Labs, keep reading! \n\n\nAbout the Role\nWe are looking for a smart contracts full-stack engineer. If you love challenges, solving complex tasks and generating impact on millions of people, keep reading!\nWhat You'll Be Doing\nBuilding new Web3 product from their inception\nContribute directly to decentralized technologies on the RSK Platform\nHelp FE Teams build reusable components and front-end libraries for future use\nRegularly monitor and improve app performance, diagnose and fix bugs\nIllustrate architectural ideas using storyboards, process flows, and sitemaps\nIdentify and troubleshoot API problems (e.g. performance, rate limiting, etc)\nWhat You Bring to the Table\n1-3 years of experience developing original smart contracts with Solidity\n1-3 years of experience developing with NodeJS\n1-3 years of experience with Hardhat, Truffle, Brownie or a comparable framework\n5+ years of general software development experience (knows and can apply agile)\nAbility to prioritize and organize operationally complex work, with great attention to detail; are accountable by default\nSelf-driven, autonomous, personality with a desire to develop protocols that will have an impact\nYou are comfortable with API integrations\nYou have contributed to open source projects\nYou use automated testing tools, browser-based debugging, and performance testing tools daily, and can implement CI/CD\nAdvanced English language proficiency\n\n\nBonus Points/Nice to have skills:\nExperience with modern Solidity stack (hardhat, truffle, various plugins, package managers, linters, code coverage etc.)\nExperience debugging and simulation of contract interaction with local nodes (e.g. hardhat and ganache,\nYou have worked on the projects that have been audited\nContributed to a blockchain-related, open source project\n Experience working in the cross-chain bridging or interoperability space\nFamiliarity with DeFi\nFamiliarity with tokenomics\nKnowledge of the EVM and gas optimization\nExperience developing with Golang\nWhat You'll Get Back!\nCompetitive salary and bonus\nLaptop and other working tools you might need\n100% remote working (contractor) from anywhere in the world\nPossibility to work at your nearest WeWork space\nFlexible working hours. You’re free to work however you work best\nPaid holidays and personal leave days\nOpportunity to work with state of art technology in a challenging and unique project\nInternationally diverse and dynamic team with a clear vision and strategy\nTraining programs to learn everything about the crypto world\nWeekly scientific moments by our Research & Innovation team to learn about technology, challenges and solutions in the blockchain world\nLanguage courses: English, Spanish or Chinese\nEmployee assistance program offering legal, financial, family, psychological and wellness counseling for you and your family\nOur Mission, Vision, & Purpose\nOur purpose is to... build a more decentralized world, for a freer and fairer future\nOur vision is… a safe and equitable global financial system that enables everyone to participate and prosper\nWe’re on a mission to… provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy\nWe’re excited to see what you’re made of!\n\n\nIOV Labs embraces diversity and is proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["dev","full","stack","smart","contract","remote","solidity"]},{"job":"Marketing Lead Specialist Web3","company":"Cointelegraph Consulting","location":"Amsterdam","post_date":"4h","link":"https://web3.career/marketing-lead-specialist-web3-cointelegraph-consulting/40210","key":"40210","details":"Cointelegraph is looking for a talented and goal-oriented Marketing Lead Specialist with extensive expertise in Web3 marketing and creative projects.\n\nResponsibilities:\n\nIdentify clients’ and partners’ marketing needs and recommend new growth strategies;\nDevelop marketing packages for Cointelegraph clients and partners using the Cointelegraph ecosystem advertising inventory and other products;\nPrepare well-structured ideas and concepts for marketing creative special projects;\nCoordinate with different teams (editorial, video production, social media etc) to create special ad projects;\nLead the execution of marketing strategies and campaigns as a trusted advisor and coordinator;\nResearch industry-related topics for best practices in Web3 marketing.\n\nRequirements:\n\nProven work experience as a creator, project manager, or similar role in Web3 marketing is a must;\nGood understanding of blockchains and cryptocurrencies. Keeping up with the latest trends in the space (DeFi, GameFi, NFT etc);\nNatural curiosity to new marketing tools and ability to adopt and use them fast;\nCommitment to continued growth and insight into growth hacking;\nA strong portfolio of marketing projects;\nNative/fluent English speaker with excellent communication skills.\n\nWhat we offer:\n\nCompetitive salary;\nFully remote;\nWorking with the market leader in crypto media.\n\nIf you are interested, please send the following:\n\nCV/Resume;\nCover letter introducing yourself and explaining why you are the right person for the job;\nLinks of any professional brands whose social media accounts you have managed.\n\nCointelegraph Consulting focuses on Financial Services, Consulting, and Blockchain / Cryptocurrency. Their company has offices in Hong Kong, London, and Tel Aviv-Yafo. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://cointelegraph.com/consulting or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["lead","marketing","non-tech","nft"]},{"job":"Blockchain Back End Developer Fully remote","company":"Cartesi","location":"Remote","post_date":"4h","link":"https://web3.career/blockchain-back-end-developer-fully-remote-cartesi/40209","key":"40209","details":"Hello, Back End Developer.\n\nWant to create a better world with The Blockchain OS?\n\nWe’ve taken 30 years of software development and given it a new home: The Blockchain OS. To the makers and mavericks, the dreamers and the pioneers, we say welcome.\n\n*Who we are *\n\nThe Blockchain OS is a decentralized layer-2 infrastructure that supports Linux and mainstream software components. For the first time, developers can code scalable smart contracts with rich software tools, libraries, and the services they’re used to, bridging the gap between mainstream software and blockchain.\n\nCartesi is enabling millions of new startups and their developers to use The Blockchain OS and bring Linux applications on board. With a groundbreaking virtual machine, optimistic rollups, and side-chains, Cartesi paves the way for developers of all kinds, to build the next generation of blockchain apps.\n\nWhy we are here\n\nBlockchain technology is all about returning control to the people and creating a more transparent society. It’s about value and trust, replacing old with new, separating the corrupt from the transparent, and dispersing the challenges of centralized systems. It places control back into the hands of the many.\n\nAn OS is needed to create this new world. Our digital revolution would not be possible without operating systems. Software that has been developed for decades on platforms like Linux underpins all of the applications and services we use every day.\n\nNow, a new Web of value, also known as Web 3, is being built on the Blockchain. Operating systems are unfortunately lost in the shift from the old web to the new value web. As a result, it's difficult for programmers and designers to work together to create a digital environment that is genuinely decentralized and inclusive.\n\nBlockchains must have a good operating system in order to reach their full potential and create a new world.\n\n“Cartesi bridges the gap between mainstream software and blockchain, welcoming millions of developers to the blockchain.”\n\nWhy Cartesi Matters\n\nWhat is our team like?\n\nLocated all over the world, the Cartesi remote team is full of life and energy. Our core contributors span over 19 countries, and 14 nationalities. We are a diverse selection of makers, mavericks, and people of greatness. What binds us together is that we all want to create a better world. Together. And with inclusivity at the heart of everything we say and do, we’ll keep pushing ourselves for the better.\n\nAbout the role\n\nWorking with Cartesi means teaming up with a totally remote team. It means you need to work across many time zones. Though a 9-5 mentality is not what we’re looking for, we do support you in having a healthy work-life balance.\n\nIn the role of Back End Developer we are looking for someone who will be responsible for:\n\nDesign and develop Rust microservices in a reliable and scalable architecture.\nSelf-assign issues to work on and review PRs on Github from fellow coworkers.\nCollaborate with other development teams inside Cartesi, gathering requirements and proposing solutions for their problems.\nUnderstand other systems that interact with your own, including how Cartesi works on the blockchain.\n\nHere’s what a normal week at Cartesi could look like:\n\nSay hello to your colleagues on Slack or check in with a short coffee greeting\nCheck your tasks on Slack, Github and plan your workday\nMeet team members to sync about the current tasks and the next steps\nLearn about the latest technology in web3\nParticipate in or start a FunFriday on Slack\nHave a monthly check-in with the entire team in a video call (cams on!)\nHave high-end discussions with your colleagues about a solution\nParticipate in online team events\nMeet your colleagues who live close by during a live dinner or meet them at one of our live events\n\nThe Desired Profile:\n\nWe would love to hear from you if you have the following:\n\n3+ years of relevant experience with software development.\nDegree in Computer Science, Software Engineering, or a related field.\nSolid understanding of microservices architecture.\nBe familiar with deployment using Docker.\nExperience with statically-typed languages.\nExperience with Event Streaming.\nExperience with REST and GraphQL APIs.\nExperience with Git (e.g. we do rebase and use commit —fix-up to keep the history clean and concise).\nGood English communication skills (written and spoken).\nSelf-motivated to work in a 100% remote office environment.\n\nPlus points if you have the following:\n\nExperience with Rust.\nExperience with Redis Streams or Kafka.\nExperience with PostgreSQL.\nExperience with AWS.\nKnowledge of blockchain and Solidity technology.\n\nThe Benefits:\n\nWhat fun and exciting perks will you get while working with Cartesi?\n\nPotential to be a big part of the project as it develops and have the chance to own your work and contribute to Cartesi’s vision and ideas.\nFlexible work hours and fully remote location. For us, talent is based on skills and attitude, not on where you are based.\nFlexible Paid Time-Off. We encourage those working with us to recharge their batteries when needed.\nHardware, home office, learning and certification, health insurance, physical and mental wellness subsidies.\nThe chance to experience a start-up environment and be a part of a supportive, friendly, and enthusiastic team with a modern and inclusive culture. We love to have fun and really care about what we are building!\n\nThe Hiring Process\n\nInterested? We would love to hear from you!\n\nPlease send your application below to be considered:\n\nhttps://cartesi.bamboohr.com/jobs/view.php?id=46\n\nThis is our hiring process:\n\nShortlisting of candidates.\nChosen candidates will be invited for a short interview with HR.\nTechnical call with our Engineering Team.\nOptional: Another technical call for more clarifications.\nFinal offer if you are our most successful applicant!\n\nWe are planning to hire for this role as soon as possible.\n\nOur Diversity and Inclusion Commitment\n\nWe at Cartesi are deeply committed to equal employment opportunities, especially in the power of diverse and inclusive teams. Because we celebrate diversity, we actively search and hire the best talents around the world regardless of their gender, race, age, religion, sexual orientation, or place of origin.\n\nWe invite everyone to send their application even if you don’t check 100% of the requirements presented. If this role is not for you, please feel free to share this opportunity with someone else who might be interested. We highly appreciate it!\n\nCartesi focuses on Linux, Cryptocurrency, Blockchains, and Blockchain / Cryptocurrency. Their company has offices in Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at http://cartesi.io or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["remote","backend","dev","blockchain","solidity"]},{"job":"Chief Marketing Officer","company":"ArcadeLand","location":"United States","post_date":"5h","link":"https://web3.career/chief-marketing-officer-arcadeland/40208","key":"40208","details":"Chief Marketing Officer\n\n\n\n\nArcadeLand is building the Ultimate Gaming Metaverse.\n\n\n\n\nWe’re bringing all the best titles from Web2 and Web3 together in one truly interoperable, safe, and accessible platform to propel the future of gaming.\n\n\n\n\nThis is a rare opportunity that is both “ground floor” yet firmly established with a year of development. We are currently an operationally lean startup in seed phase preparing for our first major campaigns and private/public fundraising rounds.\n\n\n\n\nWe have a talented core and advisory team, strong network of 80+ signed partners, and now seek to expand our leadership team ahead of our upcoming milestones, website relaunch, and marketing campaigns.\n\n\n\n\nFor what makes us special, check out our litepaper section on Unique Features. You can also find more about our awesome team and company in the About Us section.\n\n\n\n\nRole:\n\n\n\n\nWe’re seeking a Chief Marketing Officer with a passion for the industry.\n\n\n\n\nA seasoned veteran and leader who is no stranger to the ‘dirty work’ involved of quickly swapping hats to keep lean teams moving on schedule. Someone who is a great communicator in all formats, infectiously positive, and creative.\n\n\n\n\nSomeone ambitious who is ready to make a name for themselves in Web3 by growing a leading Metaverse platform from the beginning with the goal of changing the world and positively impacting the lives of billions.\n\n\n\n\nResponsibilities:\n\n\n\nStrategic, HR, administrative, and highest level functions of marketing arm\nWork closely with other leadership and advisory team\nAble to improve on and execute a comprehensive marketing plan within budget to meet goals\nAble to complete anyone’s tasks in the department to an acceptable basic level.\nConducting market research and staying abreast of competitor positioning.\nContributing to new business development initiatives.\nParticipate in weekly company continuous improvement initiatives\nAble to handle confidential information\n\n\n\nRequirements:\n\n\n\n7+ combined years relevant professional experience in gaming and blockchain industries\nProficient in marketing best practices Web2 + Web3\nExcellent analytical and leadership skills.\nCreative and entrepreneurial spirit.\nExceptional knowledge of marketing techniques and platforms.\nBachelor’s degree in business, marketing, communications, or related field.\nA Master's degree in marketing or a related field or an MBA may be highly desirable.\n\n\n\nCompensation:\n\n\n\n\nThis is initially a part-time, probationary position with limited scope prior to fundraising (ETA 2-3 months) with compensation in vested team token and company equity only.\n\n\n\n\nPost-fundraising, the permanent, full-time compensation package includes:\n\n\n\nEquity/Token compensation, vested, pre- and post-fundraising\nCompetitive Salary (commensurate with experience)\nPerformance incentives and bonuses\nAnnual raises\nPaid vacation and sick days\nMonthly office equipment and upskill subscription stipend\nAccess to private events\n\n\n\nIf you’re ready to join us on this exciting mission to shape the future of Web3 gaming, apply today!\n\n\n\n\nEEO Statement:\n\n\n\n\nArcadeLand is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.\n\n\n\n\nThis policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. ArcadeLand makes hiring decisions based solely on qualifications, merit, and business needs at the time.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["executive","marketing","non-tech"]},{"job":"Blockchain Marketing","company":"FOLLOW","location":"New York","post_date":"5h","link":"https://web3.career/blockchain-marketing-follow/40207","key":"40207","details":"FOLLOW is a social media DeFi\n\n\n\n\nWhat we require:\n\nTo connect us with investors\nGrow the community\nGain exposure\nHelp build relationships and partnerships\n\n\n\nDesigners\n\n\n\n\nwhat we are looking for is someone that is skilled in creating marketing material and unique crypto art to showcase our brand.\n\n\n\n\nWhat to expect & compensation\n\nThere will be 2 stages the bootstrap stage and post ICO stage:\n\n\n\n\nBootstrap stage: Being involved in the bootstrap stage, you are entitled to earn founder shares, all team members who help build the company during bootstrap stages will be delegated a minimum of $20,000 USD worth of tokens (depending on role and commitment that value will grow) commissions will be added as a % of whatever investment you bring in as well.\n\n\n\n\nPost ICO\n\nAfter securing funds you have the option to stay with us for a full time contract to earn a bi weekly salary base, you also have the option to have a % of your shares released and move on with another project. The rest of the share ownership will be released after 6 months along with the rest of the team as it is secured for public security.\n\n\n\n\nIf this is something you'd like to be part of please let me know!\n\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["marketing","non-tech","blockchain"]},{"job":"Payments Strategy Manager Cash App","company":"Cash App","location":"New York","post_date":"5h","link":"https://web3.career/payments-strategy-manager-cash-app-cashapp/40206","key":"40206","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app, bringing a better way to send, spend, invest, borrow and save to our millions of monthly active users. With a mission to redefine the world's relationship with money by making it more relatable, instantly available and universally accessible, at Cash App you'll have the opportunity to make a real-world impact with your career.\n\nToday, Cash App has thousands of employees around the world with a culture geared toward creativity, collaboration and impact. We’ve been a distributed team since day one, and continue to value working across time zones and continents both remotely and in our Cash App offices.\n\nOur offices are great, but many of our roles can be done remotely from the countries where Block operates. We tailor our experience to champion our employees’ creativity and productivity wherever they are.\n\nCheck out our locations, benefits and more at cash.app/careers.\n\nJob Description\n\nThe Cash App Network Operations Team is responsible for building and managing a scalable payments ecosystem for a fast growing mobile payment app with multiple external and internal partners. Reporting to the Payment Optimization Lead, you’ll be responsible for driving the operational excellence and continuous improvement for all existing and future payment methods to move funds into and out of the Cash App ecosystem. You will be working collaboratively with our finance, data science, and engineering partners to innovate, problem solve, and report out compelling narratives and opportunities utilizing our data. You’ll lead data-driven conversations and bring important learnings to other teams internally at Cash App, as well as our external acquiring and network partners to drive strategic decision making and support the Network Operations team. You will be an evangelist for our performance KPIs, with the goal of ensuring that our payments ecosystem is measurable, traceable, and optimized, while exploring new innovative solutions that position Cash App for future success and growth.\n\nYou Will\n\n\nBe the expert in all aspects of payments performance. Develop and execute actionable insights to drive positive impact to the business.\nAnalyze, develop, and deploy sophisticated payment performance optimization strategies across Cash App’s products and services.\nPartnering with analytics and data science, identify opportunities and risks from our payments data to provide clear solutions and a respected feedback loop.\nDesign and monitor KPIs and reporting that capture deep insights on payment processing, including both industry standard reporting as well as Cash-specific metrics.\nBe a subject matter expert in the payments space, helping Cash App keep tabs on regulatory and network changes that impact our business.\nDrive external partners to resolve identified gaps, examine opportunities, and make recommendations to balance cost and payment performance.\nPartner and collaborate internally across multiple stakeholders to scope, influence, and drive implementation of new payment ideas and opportunities.\nUse data and expertise to build compelling narratives that communicate ideas and opportunities to gain buy in and build alignment, with both internal and external partners.\nBe a proactive executor and have a bias to action, working autonomously and with our engineering partners to jump into the details and problem solve.\n\nYou Have\n\nQualifications\n\n8+ years of operations experience within payments and/or fintech.\nStrong understanding of the end-to-end payments ecosystem, including payment methods, card networks, acquiring and processing, and the regulatory environment.\nExperience working cross-functionally with Product, Compliance, Legal, Risk, and Engineering to identify, evaluate, and size opportunities in order to effectively prioritize work.\nExperience driving continuous improvement projects, where you’ve applied deep knowledge to uncover and execute both short and long term optimizations.\nExposure to and experience working with multiple external partners in the payments supply chain.\nStrong business analytic skills, including the ability to use data to drive and influence business requirements\nExcellent business acumen, communication skills, and self starting attitude.\nFamiliarity with analytics platforms (Tableau, Looker, Mode), expert in a spreadsheet (Google Docs, Excel), SQL skills strongly preferred.\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $184,100 - USD $225,000\n\nZone B: USD $174,900 - USD $213,700\n\nZone C: USD $165,700 - USD $202,500\n\nZone D: USD $156,400 - USD $191,200\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":[""]},{"job":"SeniorStaff Software Engineer KYC","company":"Binance","location":"Romania","post_date":"5h","link":"https://web3.career/senior-staff-software-engineer-kyc-binance/40203","key":"40203","details":"Senior(Staff) Software Engineer - KYC\nRomania, Iași /\nEngineering – Backend /\nFull-time: Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nJoining this team you will work on one of our stellar products - KYC with the mission to enable and qualify more individuals globally to start using Binance trading. At Binance we put users first, practice best know Software Development Practices and value both freedom and collaboration at work.\nResponsibilities\nDesign, build, and maintain efficient, reusable, and reliable Java code\nReview, test, and verify code for adherence to quality and security standards\nEnsure, the best possible performance, quality, and responsiveness of the applications\nIdentify bottlenecks and bugs, and devise solutions to these problems\nHelp maintain code quality and organization\nIdentify, log and resolve compliance issues\nCollaborating with other departments on particular projects and special compliance projects as necessary\nRequirements\n5+ years of experience with full lifecycle of project development for Java Applications\nStrong skills in Core Java, server-side Java technologies, and Spring frameworks\nPerformance tuning experience on JVM, SQL, RPC, etc\nExtensive experience in software design, architecture, development integration\nSolid knowledge of event processing models, multi-threading, enterprise integration pattern, Web Service and REST\nExcellent communication skills, ability to present complex information in a clear and concise manner\nCreative problem solving, simplified solutions for complex problems\nAbility to supervise and mentor junior developers on the team\nBonus for degrees in: Computer Science, Computer Engineering, or Software Engineering\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["kyc","dev","senior","java"]},{"job":"Marketing Lead Web3","company":"Cointelegraph Consulting","location":"Lisbon","post_date":"5h","link":"https://web3.career/marketing-lead-web3-cointelegraph-consulting/40202","key":"40202","details":"Cointelegraph is looking for a talented and goal-oriented Marketing Manager with extensive expertise in Web3 marketing and creative projects.\n\nResponsibilities:\n\nIdentify clients’ and partners’ marketing needs and recommend new growth strategies;\nDevelop marketing packages for Cointelegraph clients and partners using the Cointelegraph ecosystem advertising inventory and other products;\nPrepare well-structured ideas and concepts for marketing creative special projects;\nCoordinate with different teams (editorial, video production, social media etc) to create special ad projects;\nLead the execution of marketing strategies and campaigns as a trusted advisor and coordinator;\nResearch industry-related topics for best practices in Web3 marketing.\n\nRequirements:\n\nProven work experience as a creator, project manager, or similar role in Web3 marketing is a must;\nGood understanding of blockchains and cryptocurrencies. Keeping up with the latest trends in the space (DeFi, GameFi, NFT etc);\nNatural curiosity to new marketing tools and ability to adopt and use them fast;\nCommitment to continued growth and insight into growth hacking;\nA strong portfolio of marketing projects;\nNative/fluent English speaker with excellent communication skills.\n\nWhat we offer:\n\nCompetitive salary;\nFully remote;\nWorking with the market leader in crypto media.\n\nCointelegraph Consulting focuses on Financial Services, Consulting, and Blockchain / Cryptocurrency. Their company has offices in Hong Kong, London, and Tel Aviv-Yafo. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://cointelegraph.com/consulting or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["lead","marketing","non-tech","nft"]},{"job":"Senior BackEnd Engineer Kotlin Wallet Authentication","company":"Blockchain.com","location":"London","post_date":"6h","link":"https://web3.career/senior-back-end-engineer-kotlin-wallet-authentication-blockchain/40201","key":"40201","details":"Blockchain.com is the world's leading software platform for digital assets. Offering the largest production blockchain platform in the world, we share the passion to code, create, and ultimately build an open, accessible and fair financial future, one piece of software at a time.\n\nWe are looking for Kotlin developers (with some Java experience) who will help us consolidate and improve account management experiences. At Blockchain.com we have a unique security model that allows our users to store their cryptographic keys on our servers in a trustless manner (i.e. we don’t have any way to gain access to these keys). You will be working with cutting edge technologies and a unique security model on a variety of projects.\n\nThese include projects such as:\n\nContinue our work on account consolidation (SSO) to unify user accounts across our Exchange and Wallet products.\nInvestigate and specify shared key ownership using new cryptographic techniques such as multi-party computation (MPC) to further secure our non-custodial “hot wallet” services.\nMaintaining Login/Authentication functionality\nImproving our account recovery mechanismsMaintaining\n\nAs a Senior Back-End Engineer you should lead by example - driving the technical discussions, influencing the approach and making a positive impact on the team's development by advocating the best engineering practices.\n\nWHAT YOU WILL DO\n\nBuild solid, reliable software to handle multiple networks and support our ever growing family of products and user base,\nBe a part of a dedicated engineering team committed to applying the highest standards and shipping secure and performant systems,\nWork in the core of Blockchain.com’s solution, interacting directly with multiple blockchains,\nWork extensively with open source technologies (Docker, Kafka, MySQL),\nEnsure security is at the forefront of everything you do,\nWork within interdisciplinary teams to continually deliver the highest quality products to our users,\nOptimise existing systems for scalability, extensibility and performance whilst building out reusable, modular code for use across Blockchain’s products.\n\nWHAT YOU WILL NEED\n\nThe foremost quality for this position or any position at Blockchain.com is integrity,\nExperience with at least Kotlin or NodeJS and willing to learn these languages,\nExperience working with Blockchain technologies (Eth and Bitcoin)\nYou are highly motivated, self-driven, passionate about crypto currencies,\nYou know how blockchain systems work, preferably, you worked closely with at least one,\nYou find your way around when confronted to a novel problem not many people faced before,\nYou possess an innate curiosity, you know multiple programming languages, you are a strong advocate for the best engineering practices and thrive on learning new technologies,\nYou take a pragmatic approach to developing clean solutions to complex problems,\nYou pride yourself on consistent high levels of test coverage, strong technical documentation and effective monitoring,\nYou take full responsibility for all the projects you work in,\n\nCOMPENSATION & PERKS\n\nCompetitive full-time salary based on experience and meaningful equity in an industry-leading company\nThe opportunity to be a key player and build your career at a rapidly expanding, global technology company in an exciting, emerging industry.\nUnlimited vacation policy; work hard and take time when you need it.\nPerformance-based bonuses paid in cash\nApple equipment provided by the company\nAwesome office locations and remote working options.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["backend","dev","senior","java"]},{"job":"DevOps Engineer","company":"Notabene","location":"Berlin","post_date":"6h","link":"https://web3.career/devops-engineer-notabene/40200","key":"40200","details":"DevOps Engineer\nBerlin /\nTech /\nRemote\n/ Remote\n\nApply for this job\nNotabene is on a mission to make crypto a part of the everyday economy. Leading crypto organizations use our tools to reduce transaction risk and make crypto transfers safe. Working across three continents in eight countries, the Notabene team serves our fantastic community of 30+ customers, including financial institutions, fintechs, exchanges, and more.\n\n\nWe’re proud to have the support of leading investors, including Y Combinator, Jump Capital, Castle Island, Green Visor Capital, and more.\n\n\nWe’re at an exhilarating moment in our journey, as regulation technologies (reg-techs) are fast becoming recognized as a vital enabler of the crypto ecosystem. Notabene is growing fast—and we’re looking for people like you to help shape the future rails of the crypto industry!\n\n\nThis position is a unique opportunity to impact some of the most innovative companies today. You will operate in a fast-paced environment—regulations are evolving, and market demand is sky-high for new financial products.\n\n\nAs a DevOps engineer at Notabene you’ll be the backbone that supports our software engineers and have the opportunity to take ownership of the infrastructure that impacts how crypto transactions are performed around the world today.\n\n\nDevOps at Notabene involves building upon our CI pipelines, our AWS infrastructure and our security to ensure that our stack performs well, is secure and that our product engineering teams can iterate and deliver new features quickly.\nWhat you'll be doing\nTaking care of our GitLab CI pipelines to ensure that builds and deployments follow best-practices\nTaking ownership of our Terraform IaaC modules for deploying to and managing our infrastructure hosted in AWS\nSupporting the management of our data warehouse\nBeing responsible for supporting our Notabene team with tech support and internal compliance\nSupporting the product engineering teams with new services and features during planning and implementation\nMaintaining the highest level of data security on behalf of our users.\nDriving forward DevOps best-practices and sharing knowledge with the rest of the company\nWhat you'll bring\n3+ years working in a DevOps related field\nPractical experience working with AWS, CI Pipelines, Docker\nExperience with IaaC (e.g. Terraform, Ansible, Chef) is a big plus\nStrong English communication skills\nPractical experience working in a fully-remote team\nCuriosity and passion to constantly learn new things\nOwnership and Accountability. We have a flexible working culture, and expect team members to effectively manage their own time and resources\nIf you strongly believe this role is for you, please apply.  Notabene considers a broad array of candidates, including those without blockchain experience. Whether you’re returning to work after a gap in employment, or taking the next step in your career path, we will be glad to have you on our radar.\n\n\nNotabene is proud to be an equal employment workplace and an affirmative action employer. By valuing inclusion and diversity of all forms, we strictly prohibit and do not discriminate based on race, color, religion, national origin, gender, gender identity, gender expression, age, ancestry, citizenship, sexual orientation, status as a protected veteran, or any other legally protected characteristic.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["devops","dev"]},{"job":"Crypto Writer","company":"OKEX","location":"Hong Kong","post_date":"7h","link":"https://web3.career/crypto-writer-okexofficial/40198","key":"40198","details":"About Us\n\nAt OKX, we believe our future is reshaped with technology. Founded in 2017, OKX is one of the world’s leading cryptocurrency spot and derivatives exchanges. OKX innovatively adopted blockchain technology to reshape the financial ecosystem by offering some of the most diverse and sophisticated products, solutions, and trading tools on the market. Trusted by more than 20 million users in over 180 regions globally, OKX strives to provide an engaging platform that empowers every individual to explore the world of crypto. In addition to its world-class DeFi exchange, OKX serves its users with OKX Insights, a research arm that is at the cutting edge of the latest trends in the cryptocurrency industry. With its extensive range of crypto products and services, and unwavering commitment to innovation, OKX vision is a world of financial access backed by blockchain and the power of decentralized finance. We invest in our people as much as we invest in technology. We are united by our engaging culture, here we win as a team, embrace changes, and do the right thing. We are committed to creating a friendly, rewarding and diverse environment for OKers. It doesn’t matter where you come from, here everyone feels valued, respected and has the same opportunities to develop and thrive - we want to bring out the best in you.\n\nWhat we offer:\n\nA chance to work at a world leading blockchain company\nTeam with experts from Alipay/Tencent/Facebook/JP Morgan /Nomura Securities/Credit Suisse\nJoin a growing exchange with USD 10 billion level daily trading volume, serving more than 10 million customers globally\nVery competitive remuneration package\nWhat the day to day looks like:\n\nUser-centric copies for web, mobile apps and crypto-related products\n\nOwnership over product design experience, by using copy and content\n\nIdentify opportunities to optimise content, by using research and data\n\nDrives clarity and consistency in tone, terminology, and support a systematic approach for all in-product copy.\n\nWork closely with UI/UX designers, UX researcher, product managers, engineers to improve the product\n\nIdeal candidate must have:\n\nAbility to write in professional English\n\nAbility to consider user experience and journey when writing\n\nExperience in content development and strategy, high-tech industry preferred\n\nExperience in either UI copywriting, technical writing, product content copywriting or UX/product design\n\nExperience contributing to product, feature, and/or service strategy as well as roadmap development and execution\n\nProven ability to adhere to specific conversational \"tones\" and to write about otherwise-serious topics in a fun, creative, and engaging way\n\nHighly detail-oriented - you would have noticed the extra fullstop in this JD\n\nHighly organised, with ability to juggle multiple tasks\n\nGood communication skills and stakeholder management\n\nNice to haves\n\nExperience in product content design and marketing copywriting\n\nExperience within crypto and blockchain industry\n\nNative English and Mandarin language proficiency\n\nOKEX focuses on Finance Technology, Cryptocurrency, Bitcoin Exchange, and Blockchain / Cryptocurrency. Their company has offices in Hong Kong and Malta. They have a large team that's between 501-1000 employees.\n\nYou can view their website at http://www.okex.com or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["crypto"]},{"job":"Lead of Community Manager Web3","company":"NFTGo","location":"Los Angeles","post_date":"7h","link":"https://web3.career/lead-of-community-manager-web3-nftgo/40197","key":"40197","details":"Responsibilities\n\nModerate NFTGo’s Discord channel\nCurate replies to conversations within the broader NFT community with precision and speed on an ad-hoc basis\nMonitor social listening for keywords and respond on an ad-hoc basis while escalating support requests and other inquiries to the appropriate teams\nWork with stakeholders in the Marketing team as well as other teams to ideate and execute on promotional strategies involving social media accounts and community channels\nHold community campaigns and trivia in episode and invite influencers or KOLs\nBe active in other NFT-related Discord channels and crypto communities, and help NFTGo obtain more exposure from other DAO and NFT related projects Required Skills and Experience\nQualified candidates possess at least a Bachelor’s Degree\nFluent in English, additional language capabilities a plus\nProven writing/research or data analysis experience\nDemonstrate strong and effective verbal, written, and interpersonal communication skills in a small team setting\nSkilled in multiple data analysis tools and programming languages\nExcellent time management and follow-up skills\nConsistently demonstrates quality and effectiveness in work documentation and organization\nRequires 2+ years of experience running a Web3 community and having purchased NFT\nPlease send your opensea link\n\nNFTGo focuses on Blockchains, Blockchain / Cryptocurrency, Web3, and NFT. Their company has offices in Los Angeles. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://nftgo.io/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["community","manager","non-tech","lead","nft"]},{"job":"Business Development and Partnerships Manager","company":"Decent DAO","location":"Remote","post_date":"7h","link":"https://web3.career/business-development-and-partnerships-manager-decent-dao/40196","key":"40196","details":"Who we are\nDecent is accelerating the decentralized future and restoring power to individuals. In-studio to on-chain, we’ve taken our mission out in the open, inviting builders, founders, and degens alike to share knowledge, define new opportunities, and establish a true meritocracy where prosperity is available to all. Want in on the action? Keep reading. And let’s show the world how Web3 could be and should be done.\n\n\nWho are you?\nThe Business Development and Partnerships Manager will report directly to the Marketing Workstream Leader and work closely with the Brand team to build strong and meaningful relationships with customers in the DeFi ecosystem. We are looking for a partnerships leader who can help to implement and refine our strategy, drive integrations, and establish commercial and promotional partnerships. You have experience working with protocols and understand what it takes to win the right beta partners for feedback, traction and growth.\n\n\nResponsibilities\n\n\nWork with the marketing team to develop programs for ads, campaigns, and other promotional partnerships\nFind opportunities for national/international expansion and partnerships, as well as strategic partnerships for the protocol team\nWork with protocol and marketing teams on developing and fostering strategic partnerships from online and in-person events and forums\nFoster partner relationships and provide relevant feedback to the protocol team\nLeverage existing network to identify relevant strategic partners for Decent brand and protocol teams\nLead partners through the initial steps of the pipeline and create the best partner onboarding experience\nConnect with decision-makers and identify ways to enhance the customer’s business\nSource, outreach, and close partnerships with businesses of all sizes throughout all phases of the product life cycle\nIdentify and co-create solutions for customer pain points.\nHelp customers succeed through white-glove integration support\nRequirements\n\n\nBe decent\n5-8 years of experience in partnerships and/or business development\nYou have a solid crypto network (protocols, liquidity providers etc.)\nDeep knowledge of the Web3 ecosystem, including cryptocurrency, DeFi, DAOs, and NFTs, with a strong emphasis on the Ethereum network\n*An engineering background is a bonus but not required\nYou have experience creating go-to-market strategies for early-stage products and startups\nYou are passionate about growth marketing and are obsessed with figuring out how to continuously grow brands\nYou have experience developing programs to build, nurture and grow relationships with business and technical leaders\nYou have excellent product and commercial instincts that will help inform our roadmap of products and programs\nYou are outcome-oriented, listen with humility, and check your ego at the door.\nYou are self-directed, grounded in personal integrity, and view challenges as opportunities.\nExcellent communication skills: Written, verbal, and listening\nDesire to engage with the community to share ideas and gather feedback\nExperience working in a startup environment\nEnglish proficiency\nAbout Us\nSince 2017, our efforts to dismantle centralized power structures in finance have helped launch over 30 groundbreaking DeFi products. We've fine-tuned the art of building and scaling successful products at the crossroads of financial technology and digital rights.\n\n\nToday, our open-source collective connects contributors across the crypto spectrum with the cutting-edge tools and technologies they need to build thriving, self-sufficient communities. Working out in the open, we rally our community to create a DeFi experience that’s free, fair, and accessible for all.\n\n\nDecent is an ecosystem of proven software builders, early adopters of cryptocurrency, and the protocols we create to advance our core mission: leveraging human intelligence in the most efficient way to accelerate decentralization. Join our global distributed talent and intelligent capital network and reap the benefits:\n\n\nWork in a rapidly expanding global rocket ship.\nUnlock a unique chance to contribute to Web3.\nJoin a team that cares about its user, products, and working conditions.\nWork flexible hours.\nEnjoy full-time, paid vacations.\nBe fully remote.\nHow to Apply\n\n\nFill out this form here to tell us about you, showcase your relevant projects and experience, and provide a brief overview of your relevant experience and interest in the position:\n\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSe1WyQBkVUbL9xdp18twztm2TYhAcrFxwgGNSy9-r7Kw__oTQ/viewform\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["sales","non-tech","crypto","ethereum","remote"]},{"job":"Blockchain Developer","company":"lemon.io","location":"Remote","post_date":"8h","link":"https://web3.career/blockchain-developer-lemon-io/40195","key":"40195","details":" \nGet a remote job that you will love with better compensation and career growth. \n\n\nWe’re Lemon.io — a marketplace where we match you with hand-picked startups from the US and Europe. \n\n\nWhy work with us: \n\n\nWe’ll find you a team that respects you. No time-trackers or any micromanagement stuff\nOur engineers earn $5k - $10k / month. We’ve already paid out over $10M.\nChoose your schedule. We have both full- and part-time projects.\nNo project managers in the middle — only direct communications with clients, most of whom have a technical background\nOur customer success team provides life support to help you resolve anything.\nYou don’t have to look for clients and or negotiate anymore: just do what you do best and leave us the rest.\n\nRequirements:\n \n3 + years of programming experience in any of the following: Solana, Web3.js, Ethereum+ ethers.js, DEFI, NFT\n5+ years of experience using any of the following: Python, Rust, Node.js, Solidity\nExperience with system architecture is a strong advantage\nKnowledge of cryptography and blockchain protocol\nKnowledge of blockchain management and data protection\nExperience in Bitcoin Core code bases and blockchain with a focus on privacy-oriented solutions\nGood command of English, both written and spoken, as you’ll be communicating with clients directly\nStrong organizational skills — ability to work full-time remotely with no supervision\nResponsibility — we want to trust you\nSoft skills — we don’t ask you to find a topic for a small talk, but being just polite is OK\n\nApply today, and our team will get back to you within 2 business days!\n \n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["dev","blockchain","node","python","solana"]},{"job":"Community Operations ManagerWeb3","company":"NFTGo","location":"Los Angeles","post_date":"8h","link":"https://web3.career/community-operations-manager-web3-nftgo/40194","key":"40194","details":"Responsibilities\n\nModerate NFTGo’s Discord channel\nCurate replies to conversations within the broader NFT community with precision and speed on an ad-hoc basis\nMonitor social listening for keywords and respond on an ad-hoc basis while escalating support requests and other inquiries to the appropriate teams\nWork with stakeholders in the Marketing team as well as other teams to ideate and execute on promotional strategies involving social media accounts and community channels\nHold community campaigns and trivia in episode and invite influencers or KOLs\nBe active in other NFT-related Discord channels and crypto communities, and help NFTGo obtain more exposure from other DAO and NFT related projects Required Skills and Experience\nQualified candidates possess at least a Bachelor’s Degree\nFluent in English, additional language capabilities a plus\nProven writing/research or data analysis experience\nDemonstrate strong and effective verbal, written, and interpersonal communication skills in a small team setting\nSkilled in multiple data analysis tools and programming languages\nExcellent time management and follow-up skills\nConsistently demonstrates quality and effectiveness in work documentation and organization\nRequires 2+ years of experience running a Web3 community and having purchased NFT\nPlease send your opensea link\n\nNFTGo focuses on Blockchains, Blockchain / Cryptocurrency, Web3, and NFT. Their company has offices in Los Angeles. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://nftgo.io/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["community","manager","non-tech","operations","nft"]},{"job":"Global Brand Partnerships Senior Manager","company":"Binance","location":"Remote","post_date":"9h","link":"https://web3.career/global-brand-partnerships-senior-manager-binance/40191","key":"40191","details":"Global Brand Partnerships Senior Manager\nGlobal /\nMarketing – Marketing /\nFull-time Onsite or Remote\n/ Hybrid\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a Senior Manager to join our Global Brand Partnerships team here at Binance. The Senior Manager will be responsible for identifying, evaluating, negotiating, managing and activating partnerships to meet business goals and objectives.\nThe ideal candidate will bring industry expertise and experience to inform partnership strategy, cross-functional team decisions and project management. The Senior Manager will be charged with managing overall brand partnerships, including partnership strategy, activation, fulfillment and measurement.\nThe ideal candidate has experience working with global entertainment, music, sports, art, fashion, gaming brands, athletes, social influencers and celebrities.\nThis is a remote role and can be based in any global location.\nResponsibilities:\nIdentify and evaluate partners who will share our vision \nNegotiate brand partnerships to meet business goals and objectives\nSet, build and execute partnership strategy and activation plans \nCollaborate with cross-functional and regional teams (brand marketing, comms, insights, design, content, data, product, social media, legal) to set and align on annual plan (e.g., product-market fit, setting goals, campaign performance, budget, channels)\nUse a data-driven model to set up goals, evaluate short and long term campaign performances\nControl complex global budgets and drive ROI \nShare thought leadership and market/product intelligence \nGuide key regional/local branding teams to positively impact our overall marketing operational excellence\nOwn and lead complex projects and challenges; be proactive, resourceful and action-oriented\nRequirements:\n8+ years of experience in brand marketing and brand partnerships, including sports, music and/or entertainment marketing \nExcellent project management, strategic planning relationship building and storytelling abilities\nExperience managing partners, internal teams and agencies across global projects \nStrong grasp of brand culture/vision and partnerships relevance \nCreative and data driven mindset \nConcise writer and speaker\nA background in Crypto or an understanding of Web 3.0 Products (NFTs, Fan Tokens) would be a plus \nThrive in a fast-paced environment \nHigh level of intellectual curiosity\nFluent English\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["sales","non-tech","marketing","senior","remote"]},{"job":"Trading Operations Crypto HFT","company":"XTX Markets","location":"London","post_date":"10h","link":"https://web3.career/trading-operations-crypto-hft-xtx-markets/40189","key":"40189","details":"The Firm\n\n\nXTX Markets is a leading algorithmic trading company partnering with counterparties, exchanges and e-trading venues globally to provide liquidity in the Equity, FX, Fixed Income and Commodity markets. We provide consistent liquidity, helping market participants throughout the world obtain the best prices in the various assets classes we cover, regardless of changing market conditions.\n\n\nAt XTX Markets technology is our business and we are a diverse organisation which attracts outstanding talent from across all industry backgrounds. We are focused on teamwork and our people collaborate on all aspects of the business, working openly and with respect for each other, our clients and the market. Our culture is non-hierarchical and one where everyone is valued. We strive for excellence in everything we do.\n\n\nThe Role\n\n\nThe “Trading Desk” oversees real-time trading across all strategies, liaising with risk managers, senior management, researchers, software developers, systems engineers, external counterparties and customers in order to keep the business running 24/7. They closely monitor real world events and their impact on markets and if necessary, undertake the appropriate action to ensure the best outcome for XTX, our customers, and counterparties.\n\n\nWe are seeking a candidate to join the team to work on Friday, Saturday, Sunday, and Monday each week. We envisage that you will work from the office on Friday and Monday, with Saturday and Sunday working from home.\n\n\nThe team has a presence in London, Singapore, New York, and Paris. We are hiring for this role in both London and Singapore, with duties shared between two individuals with this Friday to Monday working pattern. We require a 40 hour “working week” arranged as follows: Friday (8 hours), Saturday & Sunday (12 hours), Monday (8 hours).\n\n\nResponsibilities\n\n\n\nSupervise trading strategies and provide first level support to ensure smooth running of the business with the main remit being crypto from Friday to Monday (including Saturday and Sunday).\nRisk management of the global portfolio across multiple asset classes throughout the day.\nUse trading metrics and data analysis methods in the decision-making process to improve existing strategies.\nConduct preliminary research into new strategy ideas.\nCollaborate with quant research team to provide real-time feedback on model optimization.\nAssist with project work relating to expansion into new markets.\nTeam up with developers to improve automated tools for monitoring trading and alerting of internal and external anomalies.\nLiaise with brokers/exchanges, trading operations and back office on trade/position reconciliation issues, risk limits and margin requirements.\nEssential Attributes\n\n\nKnowledge of, and interest in, crypto and related industries.\nProficiency in Python (we use Pandas regularly).\nExcellent quantitative and analytical skills.\nDesirable Attributes\n\n\nRelevant experience in a top-tier crypto firm that is trading $billions of notional value each day is strongly preferred.\nGraduate from a top university in a quantitative discipline such as Mathematics, Statistics, Computer Science.\nExcellent written and verbal communication skills.\nYou operate with integrity and to a high ethical standard.\nYou are highly motivated; current, and former colleagues consider you exceptionally hard working and conscientious.\nYou have demonstrable analysis skills and can reason objectively to solve problems.\nInnovative. You continually think about how improvements in technology and processes can achieve better results. You are conscious of the long-term cost of short-term decisions but demonstrate good judgment on when to be pragmatic.\nTeam player. You enjoy working in a dynamic team and are comfortable with being challenged to improve your work.\nDisciplined self-starter with a high degree of motivation and rigour. Able to work autonomously and independently during weekend shifts.\nBenefits\n\n\nOnsite gym, sauna, and fitness classes at no charge\nExtensive medical benefits including an on-site doctor and therapist at no charge\nBreakfast and lunch provided\nVarious supports for caregivers, including emergency dependent care\nBeautiful Kings Cross office: https://vimeo.com/257888726\n25 days paid holiday per year + statutory holiday and paid sick days\n \n\n\nPLEASE NOTE THAT EMPLOYEES OF XTX MAY NOT ENGAGE IN DAY-TRADING INCLUDING, BUT NOT LIMITED TO CRYPTO. YOU MAY BUY AND HOLD CRYPTO (AND OTHER ASSETS) BUT YOU MUST HOLD EACH ASSET FOR AT LEAST 30 DAYS AFTER PURCHASE, REGARDLESS OF PRICE FLUCTUATION.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["operations","crypto","finance","golang","trader"]},{"job":"Trading Operations Crypto HFT","company":"XTX Markets (Singapore)","location":"Singapore","post_date":"10h","link":"https://web3.career/trading-operations-crypto-hft-xtx-markets-singapore/40188","key":"40188","details":"The Firm\n\n\nXTX Markets is a leading algorithmic trading company partnering with counterparties, exchanges and e-trading venues globally to provide liquidity in the Equity, FX, Fixed Income, Commodity, and Crypto markets. We provide consistent liquidity, helping market participants throughout the world obtain the best prices in the various assets classes we cover, regardless of changing market conditions.\n\n\nAt XTX Markets technology is our business and we are a diverse organisation which attracts outstanding talent from across all industry backgrounds. We are focused on teamwork and our people collaborate on all aspects of the business, working openly and with respect for each other, our clients and the market. Our culture is non-hierarchical and one where everyone is valued. We strive for excellence in everything we do.\n\n\n \n\n\nThe Role\n\n\n\nXTX is expanding its trading operations team to accommodate a 24/7 model to support crypto trading, which operates around the clock. We are seeking a candidate to join the team to work on Friday, Saturday, Sunday, and Monday each week. We envisage that you will work from the office on Friday and Monday, with Saturday and Sunday working from home.\n\n\nWhile the primary focus of the role will be trade support, we envisage you will also contribute to teamwide projects. Our team ethos is to develop robust and scalable solutions to improve the efficiency of the team and its processes, so the role will also involve automation to a large extent. With the guidance of the team, candidates will improve and develop new processes using a range of technical skills such as Golang and SQL.\n\n\nNotably, while cryptocurrencies will be the primary focus of this role, your role will cover various other asset classes and as operations run as a global team.\n\n\nXTX are looking for technically-minded candidates with enthusiasm, initiative and the ability to work autonomously. The role is an opportunity to contribute to a small team with new ideas and make a real and positive impact to the team itself, as well as the firm.\n\n\nThe team has presence in London, Singapore, New York, and Paris. This role is being hired in both London and Singapore, with duties shared between individuals with this Friday to Monday working pattern. We require a 40 hour “working week” arranged as follows: Friday (8 hours), Saturday & Sunday (12 hours), Monday (8 hours).\n\n\nThis is an opportunity to focus on crypto, but also learn other asset classes in a diversified, stable, growing HFT. \n\n\nResponsibilities\n\n\nTrade Support: to be shared between Singapore and London during the weekend and the rest of the team for Friday and Monday.\nManaging cash (margin) across multiple crypto exchanges and brokers\nLive risk monitoring and escalation.\nProduction of various reports (including P&L, risk, cash)\nAd-hoc trade executions.\nAd-hoc data analysis.\nSupport business development in onboarding of new exchanges or counterparties\nBuild and maintain automated processes.\nWork with the technology team to develop new tools and applications.\nOpportunities to gain exposure to various assets classes across the entire trade life cycle.\n \n\n\nEssential Attributes\n\n\nRelevant experience in a top-tier crypto firm that is trading $billions of notional value each day is strongly preferred.\nKeen interest in the cryptocurrency markets\nSome programming experience (Python, Go) related to automation.\nA minimum of a 2:1 (or equivalent) in Mathematics, Engineering or Computer Science or related subjects.\nKeen to learn new technical skills.\nStrong analytical and problem-solving skills.\nDisciplined self-starter with a high degree of motivation and rigour. Able to work autonomously and independently during weekend shifts.\nExperience with other asset classes advantageous.\nA demonstrated aptitude and interest in process improvement.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["operations","crypto","finance","golang","trader"]},{"job":"Learning and Development Intern","company":"Ledger","location":"Paris","post_date":"10h","link":"https://web3.career/learning-and-development-intern-ledger/40187","key":"40187","details":"Learning and Development Intern\nParis, France /\nCentral - People – People /\nInternship / Stage\n/ Hybrid\n\nApply for this job\nWe're making the world of digital assets accessible and secure for everyone. Join the mission.  Founded in 2014, Ledger is the global platform for digital assets and Web3. Over 25% of the world’s crypto assets are secured through our Ledger Nanos. Headquartered in Paris and Vierzon, with offices in the UK, US, Switzerland and Singapore, Ledger has a team of almost 1000 professionals developing a variety of products and services to enable individuals and companies to securely buy, store, swap, grow and manage crypto assets – including the Ledger hardware wallets line with more than 5 millions units already sold in 180 countries.  At Ledger, we embody the values that make us unique: Pragmatism, Audacity, Commitment, Trust and Transparency. Have a look at our Origins video here. \n\n\nTo support our HR team and L&D organization in their day to day challenges we are looking for a Learning & development Intern, motivated to engage in rolling out the newly defined Ledger’s learning strategy and ensuring consistency of the latter at global and local level.\nYour Mission :\nWill consist of supporting our People Development Director in construction and deployment of Ledger’s L&D policy. By that, we are referring to building foundations and identifying external training organizations compatible with Ledger’s needs in the long run. You will be highly involved in building the Ledger’s Managerial excellence program destined to top management and therefore in charge of : collecting the needs, participating in designing the framework Ledger’s management culture, arbitrating on the solutions to be put in place, managing expectations and the relationship with the target population at Ledger. Finally - you will be as well involved in the Onboarding program - digitalization and logistics wise. Here you will be contributing to making Ledger’s Onboarding program more interactive, interesting and digitally performant. \n\n\nYour main responsibilities will be :  \n\nSupporting the end to end process of training and certification demands\nPreparing and running logistics (executing, identifying the right external provider for external training & certification, preparing calendar, sending invitation, checking attendance, sending evaluation, addressing improvement points). \nKeeping the Learning & development KPIs updated (number of employees trained, total training hours, investment, evaluation, etc). \nBeing the one of the Onboarding referents for day to day onboarding topics digitalisation and logistics wise.\nChecking the end to end activities related to the new joiners and to promoting continuous improvement among Ledger’s population.\nSupporting the promotion of LinkedIn Learning and Babbel across the organization.\nPreparing communication that promoting the L&D topics and engaging employees.\nWhat we’re looking for :\nHaving already done your first internship in Learning and Development, and you feel comfortable in pursuing this path.\nCollege Education - Master degree in Human Resources (preferably) with demonstrated passion for Learning & Development\nPassionate about Human resources and people development, you are eager to work within an international and diverse learning community and support its growth.\nRigorous, organized and with a sense of priority, you are able to manage multiple projects in a fast-paced, deadline and result-driven environment.\nYou have an outgoing personality with strong communication skills and are able to connect with the different stakeholders of the people team in order to get your project done in a timely manner. \nDesign thinking and problem-solving skills would be very welcome.\nFluent in French and English : Mandatory.\nDigital and tech savviness, and experience with G-suite and/or PowerPoint, Excel (Office).\nCuriosity about the crypto / blockchain industry would be a plus\nWhat’s in it for You ?\nPartial remote work possible\nLunch vouchers with Swile\n50% reimbursement of your monthly transport subscription\n1 day off for every full month worked\n1000€ gross / month\nWe are an equal opportunity employer for all without any distinction of gender, ethnicity, religion, sexual orientation, social status, disability or age.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["intern","entry","level"]},{"job":"Senior Software Engineer Full Stack","company":"HEIR","location":"","post_date":"10h","link":"https://web3.career/senior-software-engineer-full-stack-heir/40186","key":"40186","details":"Work on the new era of digital culture.\n\nWe strive to recognize and reward culture creators with the latest web3 philosophies around ownership.\n\nHeir Inc. was born out of the desire to uplift and empower the next generation of athletes (and creators) with innovative technology and tools to deepen engagement and monetization with their audiences. HEIR presents a new opportunity for athletes (and creators) to engage with their most loyal supporters, define new revenue streams and digital enterprises, and position their brands for the future, into the Web 3.0 universe.\n\nHeir Inc.’s mission is to provide the next evolution of digital culture to the world. We aim to redefine the perspective and functionality of digital culture while creating benefits for original culture creators and those who consume it early.\n\nOur founding team brings experience from the White House, Robinhood, Nike, and Jordan Brand and has worked with athletes and entertainers including Steph Curry, Michael Jordan, Beyonce, Travis Scott, and The Weeknd.\n\nHEIR is backed by Thrive Capital (investors in Instagram, Stripe, Slack, Robinhood, Github) and pro athletes and has raised $10M in seed funding.\n\nAbout the role\n\nWe are excited to bring a talented, experienced, and driven Senior Backend Software Engineer to our Engineering team. As an early team member, you will play a leading role in developing and building backend services, infrastructure, and data that drive our product for consumers. In addition, you will gain an unparalleled opportunity to understand athletes and help develop groundbreaking web3 technology.\n\nYour day-to day responsibilities:\nDesign, implement, and maintain operations for our most critical and scalable services\nWork across teams to understand system requirements; collaborate on trade-offs and engineering solutions\nBuild and maintain system architecture and implement scalable, reliable, and cost-effective solutions\nDiscover opportunities to drive increased product and engineering efficiency\nParticipate in incident investigations and resolutions\nCollaborate with our frontend team to build supporting backend infrastructure, including our web3/blockchain integrations\nAbout You\nBS/BA in computer science or equivalent experience\n5+ years of software engineering experience in backend/distributed systems\nProven track record of building and operating highly available systems at significant scale\nProven success creating and implementing new processes and tools to drive engineering efficiency\nExperience and strong intuition for building custom internal SaaS applications and APIs\nExperience with AWS, GCP, or Azure cloud infrastructure\nStrong communication and collaboration skills\nBonus Points\nPassion or experience for web3 or crypto technologies\nExperience with complex backend systems serving a large user base\nExperience working in a fast paced start-up environment\nPersonal projects or achievements (e.g. programming olympiads, hackathons, participation in well-known open source projects, top-ranked apps, etc.)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["dev","full","stack","senior"]},{"job":"Senior DevOps Engineer Rollups","company":"Consensys","location":"Remote","post_date":"10h","link":"https://web3.career/senior-devops-engineer-rollups-consensys/40185","key":"40185","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout Protocol Engineering\n\nThe Protocols team is at the forefront of innovation and the foundation of ConsenSys. We drive and support the Ethereum ecosystem, enable companies around the world to successfully deploy and manage blockchains at scale, and power other products at ConsenSys (MetaMask, Infura, CodeFi). We are believers in contributing to the Ethereum community with our time (EIP-1559, The Merge), expertise, and products (Hyperledger Besu, Teku -the Ethereum 2.0 beacon chain client-, and ConsenSys Rollups). ConsenSys R&D is part of the Protocols Team where we have the opportunity for long-term thinking in the products we bring to market. Similar to our products, our team is also decentralized around the world. The Protocols team's expansive experience in building and researching Ethereum protocols provides a unique experience to new joiners to make a stamp on the Ethereum ecosystem from day one.\n\nWhat you’ll do \n\nLead the creation of a world-class infrastructure and tools for our core engineering products. Help develop and operate the ConsenSys Rollups zkEVM network.\n\nDeploy and help maintaining one of the first zkEVM network in the market\nSupporting the delivery of consistent DevSecOps best practices across the organization\nImprove and update our deployment pipelines\nHelp build infrastructure and tools that make all our developers go faster\n\nWould be great if you brought this to the role \n\n5+ years experience in Systems Engineering/DevOps role on Linux/Unix Systems\nAbility to self-prioritize issues based on customer impact. Experience with troubleshooting issues in production systems, analyze system and application logs to understand the root of the problem\nSolid level understanding of Kubernetes, including running a production grade system.\nDeep knowledge of at least one cloud provider, preferably AWS. Must be able to architect and use cloud native services for distributed systems\nFamiliar with software component development, Container deployments and best practice in Security, Compliance, High Availability, Resilience.\nCollaborative, communicative and confident in their abilities to work well with all team members at all seniority and skill levels\nAbility to debug, optimize infrastructure, and automate routine tasks\nExperience setting up, automating, and maintaining CI and release management processes (GitHub actions, CircleCI, etc.)\nExperience in Systems Engineering, such as Linux I/O tuning, performance, memory management and troubleshooting\nExperience building and maintaining complex geographically distributed systems in a production environment including processes, monitoring, alerting and best practices\nInfrastructure templates (Terraform, FluxCD, etc.) and automation\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nIt is a requirement of employment in this position that applicants will be required to submit to background checks including but not limited to employment, education and criminal record checks. Further details will be provided to applicants that successfully meet the criteria for the position as determined by the company in its sole discretion. By submitting an application for employment, you are acknowledging and consenting to this requirement.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n \n\n#LI-JL1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["devops","dev","senior","remote","ethereum"]},{"job":"Events Associate","company":"Consensys","location":"Remote","post_date":"10h","link":"https://web3.career/events-associate-consensys/40184","key":"40184","details":"Location: Must be UK based.\n\nOur mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout the Events team\n\nWe have a team of 2 events managers and 1 head of events. Each event manager is responsible for execution of product(s) specific events. \n\nWhat you’ll do\n\n\nWorking in the events team, to support the head of events and events managers with the following:\nManage event vendor contract, logistics, and payment process\nKeeping events budget sheet updated per quarter\nInvoicing and contracts admin ensuring located in the correct files \nSwag logistics support for each event\nSupplier and vendor liaison\nMaintain clear lines of communication and collaboration with internal and external stakeholders\nEvent meeting note taking\nOnsite event support\nAbility to travel Internationally. Travel will be required 40-50% of the time.\n\nWould be great if you brought this to the role\n\n1-2 Years experience day to day events admin and onsite support\nSupplier and vendor liaison\nTracking and managing creative deliverables\nSwag sourcing, production and logistics\nInvoicing and contracting admin\nUpdating budget tracker for events\nExperience in using Airtable, G Suite, Slack\nStrong communication skills\nAbility to handle multiple projects simultaneously under stringent timeframes and changing priorities/conditions\nAbility to both work independently and collaborate with others\nHighly organized\n\nEducation\n\nBachelor's degree or equivalent in work experience preferred\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["remote","ethereum"]},{"job":"Senior Strategy Manager Risk Operations","company":"Cash App","location":"Atlanta","post_date":"11h","link":"https://web3.career/senior-strategy-manager-risk-operations-cashapp/40183","key":"40183","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app, bringing a better way to send, spend, invest, borrow and save to our millions of monthly active users. With a mission to redefine the world's relationship with money by making it more relatable, instantly available and universally accessible, at Cash App you'll have the opportunity to make a real-world impact with your career.\n\nToday, Cash App has thousands of employees around the world with a culture geared toward creativity, collaboration and impact. We’ve been a distributed team since day one, and continue to value working across time zones and continents both remotely and in our Cash App offices.\n\nOur offices are great, but many of our roles can be done remotely from the countries where Block operates. We tailor our experience to champion our employees’ creativity and productivity wherever they are.\n\nCheck out our locations, benefits and more at cash.app/careers.\n\nJob Description\n\nWe are seeking a highly motivated, experienced, and deeply resourceful individual to lead and execute Cash Customer Operations’ (CCO’s) Risk Operations planning and strategy functions. This individual will be part of a team that works cross-functionally within CCO, and across Cash to create, align and refine strategy, and drive performance and goals. This role is focused on effective, timely, and compliant operations of our strategy and framework within Risk Operations to deliver critical business projects.\n\nIn this role, you will serve as a guide, air traffic controller, innovation source, budget master, and the ultimate operational strategist, driving excellence, consistency, and communication among the Risk Operations leadership team, and ensuring alignment and shared understanding across CCO. This role will work deeply with the Sr. Leaders of Risk Operations to develop and drive a deep understanding of key strategies, keeping the teams and supporting functions aligned, and maximizing CCO’s focus and execution capabilities. Inside the Cash team, you’ll work with the Sr. Strategy Lead, Finance, Product, Engineering, Biz Ops, and other partners to represent Risk Operations and its priorities to support our customers as a key piece of building Cash App’s reputation as a financial institution they can trust.\n\nYou Will\n\n\nGuide strategy execution by the business in a scalable and compliant way\nUtilize deep operational and support industry knowledge to implement and improve on people, process and technology while serving as a strong cross-functional leader for our global team\nFacilitate the goal setting and execution of critical projects within Risk Operations, smartly balancing the levers around quality, cost, impact, risk and compliance and outcomes to maximize investments and talent\nIn partnership with Data and Process improvement teams to gather and synthesize relevant data, suggesting improvements in the processes and workflows to help scale the business to stay ahead of our needs\nRepresent Risk Operations as needed in critical conversations with business partners across Cash to help synthesize priorities and context to drive informed high-decision quality\nPartner with Operational Excellence in the implementation of risk management practices within Risk Operations including driving risk assessments, remediating identified issues, facilitating policy reviews, and managing regulatory change.\n\nYou Will Be Accountable For\n\nManaging operational frameworks around how Risk Operations prioritize strategic initiatives, set goals, form and align on priorities, in partnership with the Sr. Leadership teams.\nCoordinating communication and execution of work amongst the department leadership team to ensure alignment, visibility and context are available and incorporated\nSteering and refining the engines that drive how we manage change, new business priorities, balance running the business with fueling innovation, and hold each other accountable in Risk Operations to focusing on the priorities with the strongest impact and value\nParticipate with the Sr. Strategy Lead and CCO Leaders in formulating and creating alignment around the CCO investment strategy, which includes budgets, resource balancing among priorities\nMore specifically, oversee and drive accountability over annual and quarterly planning, including budgets, headcount, and organizational design.\nBuilding and representing the team’s culture and priorities as part of the overall ecosystem CCO is building across internal and external sites\nLeading, coordinating or supporting efforts around major impactful high-visibility projects and ensure opportunities are carried forward to practical and sustainable solutions\nMaintain relationships with cross-functional partners to help support Risk Operations programs and goals.\n\nYou Have\n\nQualifications\n\n7+ years of operations/support industry experience with a focus on planning and process frameworks and developing and executing strategy at scale\n3 years experience and a proven track record in coordinating senior leaders with varied initiatives, priorities, and functions into a smooth, aligned performant team\nPast experience working in a rapidly scaling organization and going from a US-based or single-channel model to a global, distributed, matrixed model and evolving processes in tandem with growth and shifting business needs\nThe ability to effectively influence and communicate cross-functionally and excellent written and verbal communication skills\nCreative problem-solving abilities and expertise in balancing and articulating trade-offs\nA passion for consumer financial services and ensuring an outstanding customer experience\nExperience with or prior knowledge of risk management and regulatory interactions within the financial services industry preferred\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $167,300 - USD $204,500\n\nZone B: USD $155,600 - USD $190,200\n\nZone C: USD $147,200 - USD $180,000\n\nZone D: USD $138,900 - USD $169,700\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["operations","senior"]},{"job":"Sales Development Representative Dutch Speaking","company":"Chainalysis","location":"Amsterdam","post_date":"11h","link":"https://web3.career/sales-development-representative-dutch-speaking-chainalysis/40181","key":"40181","details":"Our Sales Development Representatives are expert storytellers and problem-solvers and we’re obsessed with expanding cryptocurrency markets and helping customers track and prevent fraud and abuse. At the cutting edge of the cryptocurrency industry, our team understands the latest market developments and business models that are building the future of finance. Our goal is to help cryptocurrency and crypto related businesses understand the value of implementing our solutions.\n\nSales Development Reps have graduated from the training grounds demand generation roles and know the fundamentals of outbounding and qualifying like the back of their hand. You’re confident in your ability to engage prospects, identify pain points, and then turn them into paying customers. We measure success by your quota attainment, new logo acquisition, and ability to manage and convert deals in a high-volume environment.\n\nIn one year you’ll know you were successful if…\n\nYou’re an expert on our product suite and connecting prospects with the solutions that meet their needs and exceed their expectations\nYou’re up to date on regulatory initiatives and changes related to cryptocurrency and the specific implications for your prospects\nYou can effectively use and leverage the entire sales tech stack including Salesforce, Going.io, SalesLoft, Linkedin Sales Navigator, etc. and you have exceptional data hygiene\nYou understand and work toward activity metrics that yield a predictable and accurate pipeline\nYou’re consistently exceeding quarterly sales and bookings targets\n\nA background like this helps:\n\nYou’ve been in a Sales Development or Business Development role previously at a high-growth company\nYou’re passionate about cryptocurrency and its future\nYou’ve worked with a similar tech stack including Salesforce, LinkedIn Sales Navigator, SalesLoft, etc\nYou are a fluent communicator in English and Dutch\n\n#LI-EG1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"NFT Advisor","company":"LETTONNE","location":"United States","post_date":"12h","link":"https://web3.career/nft-advisor-lettonne/40180","key":"40180","details":"LETTONNE:\n\n\n\n\nWe are a phygital fashion brand that servesas a bridge that connectsthe real world and the metaverse.Our mission is to create a community that chooses clothes as means to communicate its point of view, bringing up relevant problems and contributing to their solutions, with no harm to the planet in addition to providing education about the metaverse and its opportunities.\n\nPROJECT:\n\n\n\n\nNFT Collection to support Ukrainian refugees\n\nABOUT THE ROLE\n\n\n\n\nWe’re looking for a strong growth lead to join our team at LETTONNE. As part of the founding growth team, you’ll play a pivotal role across all verticals, helping to facilitate growth and adoption of the brand to ensure that roadmap objectives are achieved.\n\n\n\n\nYou’ll get to shape how our users discover and engage with our platform and as we continue to grow and implement new features and products, you’ll be mission-critical to making sure LETTONNE is the trusted, go-to Digital Fashion of choice for web3 future.\n\n\n\n\nAs a fast-growing startup in an ever-changing industry, we’re looking for someone who is an independent but collaborative worker that can adapt quickly to changing priorities, wear multiple hats, and proactively assist with solutions.\n\n\n\n\nWHAT YOU’LL DO\n\n\n\n\nCreating of successful NFT strategy that will provide:\n\nHelp to grow brand's community\nGenerate Interest in our Brand\nEstablish more trusting relationships\nIncome result\nNFT launch developing\nCommunicate with design, marketing team to achieve the best result\n\n\n\n\nWhat we’re looking for\n\n\n\nSelf-starter attitude and the ability to execute new ideas with autonomy\nAn individual that embraces ambitious monthly and quarterly targets\nExperience on the similar role from 3 years\nSimilar successful projects\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["nft"]},{"job":"Rust Engineer","company":"WalletConnect","location":"Remote","post_date":"12h","link":"https://web3.career/rust-engineer-walletconnect/40179","key":"40179","details":"WalletConnect is the web3 communications protocol. Since our founding in 2018, we have empowered endless connections between wallets and apps, linking the web3 ecosystem together and fueling brand-new user experiences. We began with a single API and are now pushing the boundaries of wallet technology to build up a suite of APIs, all with our signature agnosticism (any wallet, any app, any chain). In March 2022, we raised our $11M Series A from USV, 1kx, Coinbase and other leading investors, and are looking to grow.\n\n\nTo learn more about our plans to create a multi-API messaging network for web3, take a look at our presentation at EthCC.\n\n\n\n\nThe Role:\n\nWe’re looking for a Software Engineer to join our Cloud team which is responsible for the entire backend at WalletConnect. As a member of the Cloud team you will deliver new software in Rust and TypeScript and deploy it to AWS, CloudFlare, and others. You will instrument and operate the software using Prometheus, Grafana, and Opsgenie. You, in tandem with your teammates, will be in charge of maintaining the system. You will write proposals for new features, apps, and bug fixes and present those proposals to your team mates, across teams, or the entire company depending on the scope.\n\n\n\n\nResponsibilities:\n\n\n\n\nConceptualize new features and share your ideas concisely in written form and collect peer feedback\nWrite new and improve existing software in Rust, Typescript, and Go\nBuild and deploy infrastructure using Terraform/AWS/Grafana/Opsgenie/Prometheus\nPlan and implement metrics/monitors and operate the Cloud team’s services\n\n\nMust have:\n\n\nExperience in Rust is a must, TypeScript/Python experience is a plus\nStrong AWS (or other cloud provider) experience and Terraform/CDK/equivalent is a plus\nExperience in monitoring: Grafana, Prometheus, Loki, Datadog, or other\nSQL skills (PostgreSQL preferred)\nSolid Linux and networking skills\nDemonstrated experience with managing production services\n\n\nWhat WalletConnect offers:\n\n\nFully remote position\nCompetitive salary\nRemote work allowance\nCompany equity\nToken offering\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["dev","rust","remote"]},{"job":"Sr. Engineering Manager Blockchain Gaming","company":"NaturalMotion / Zynga","location":"European Union","post_date":"14h","link":"https://web3.career/sr-engineering-manager-blockchain-gaming-zynga/40177","key":"40177","details":"Zynga is looking for a Sr. Engineering Manager to lead engineering for our Zynga Blockchain team.\n\nOur mission within Zynga Blockchain (ZBC) is to empower players to invest, own and earn through fun, high-quality, and enduring blockchain games they can trust. If you want to help shape the future of gaming with a world-class team, we look forward to hearing from you.\n\nAs Sr. Engineering Manager, you will work closely with the Product Management, Design, Art, and Production teams to craft the technical vision and team for multiple games, ensuring demands are met on time and to schedule without sacrificing quality, and are delivered in support of design and product requirements. This is a fantastic opportunity to enhance your career working for a top company in the mobile sector. Are you ready to be a key contributor to Zynga’s Growth? Come and join us!\n\nResponsibilities:\nLead the Blockchain engineering organization as a center of excellence\nDirect architecture for front-end, back-end, and web3 technology stacks\nGuide Senior Leadership with a technical perspective as we develop studio strategy and tactics\nPartner with executives, product management, and game production teams to develop roadmaps for multiple games\nIdentify and implement process improvements for the team: evolve, optimize, and define processes that can benefit projects in a proactive manner\nManage career progression and implement development plans that keep engineers on the team motivated and engaged\nTrack performance, both individual and team, including monitoring team health\nDemonstrate transparency and active communication within the team, across other Zynga teams, and with management\nResponsible for engineering onboarding, to ensure our engineering team runs effectively\nDesired Experience and Skills:\nBS in Computer Science, or related technical discipline (or equivalent)\nExperience on web3 projects with a focus on web-based browser games\n6+ years of related Software Development experience\n3+ years of team-lead or management experience, including hiring, building key projects, and career management\nFamiliarity with software development practices, including Agile, Test Driven Development, and Software (Games) as a Service\nWorking knowledge of mobile app/game landscape, architectures, trends, and emerging technologies and platforms\nExperience with Git\nExperience in HTML5, Solidity, Rust, Javascript, or similar programming languages and platforms\nProficient in C#, C/C++\nExperience with Amazon Web Services (EC2, ELBs, ALBs, ElastiCache, DynamoDB, Aurora)\nFamiliarity with Compliance / Regulatory requirements\nEnthusiastic colleague with strong collaboration and communication skills\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOmZkYjY6YTU0Yjo2YWE5OjkxOGUM\n\n⬇\nApply Now","tags":["executive","game","dev","senior","blockchain","solidity"]}]}