{"jobs":[{"job":"Developer Relations Lead m f d","company":"Safe","location":"Berlin","post_date":"3d","link":"https://web3.career/developer-relations-lead-m-f-d-safe-global/40077","key":"40077","details":"Location: Berlin/Lisbon or relocation\n\n👨‍💻 About the Role:\n\nAs a Developer Relations Lead at Safe, you will be responsible for improving Safe’s public good and open-source commitment to the Web3 community. You will lead this new function, building code examples and documentation for the community to use and contribute to, you will also facilitate technical workshops and talks at conferences/hackathons.\n\nWe want you to bring your technical expertise, enthusiasm and creativity to the table and represent Safe to our fast growing developer community. You will also influence our product strategy, so developers get what they need!\n\n\nOur Tech Stack: Solidity, EVM knowledge, React.js, Typescript, Python\n\nCheck our github:\n\nSafe Contracts\nTransaction service\nSafe Apps SDK\nSafe Core SDK\n🗂 What you will be doing:\nEducation - Own and contribute to the developer Gitbook. Liaise with Safe stakeholders to transition documentation into a golden standard. Write blogs and (video) tutorials.\nLead - Own the end-to-end developer strategy for Safe and create structures / processes that will scale developer growth.\nHack - Represent Safe at in-person/remote hackathons, create bounties, facilitate workshops and support hackers.\nCollaborate - Establish sustainable working relationships with community projects. Help them solve integration problems and issues. Contribute thought leadership and inspire others to educate / build, using channels such as Twitter, Forums, conferences / hackathons etc.\nSupport - Answer queries on Stack Exchange, triage issues/bugs from developers. Push and support on technically aligned EIPs.\nContribute - Synthesise and communicate feedback, issues and requirements to the SDKs, Web, and Mobile teams.\n🎒 What you will bring:\nStrong public speaking capability, with proven experience\nThought leadership experience in Web3\nProven experience with Typescript/React\nBasic knowledge of Solidity\nPractical experience with Ethereum and EVM\nBasic knowledge in Python\n\nNice to have skills:\n\nYou have written smart contracts using Solidity\nKnowledge of recent Ethereum core developments (EIPs, beacon chain, account abstraction)\n🎁 Team and Benefits:\n\nLearn more about us and what benefits we offer here: https://gnosis-safe.io/careers\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["developer","relations","dev","lead","react","solidity"]},{"job":"Product Designer","company":"Dialect","location":"Remote","post_date":"3d","link":"https://web3.career/product-designer-dialect/40075","key":"40075","details":"Website: https://dialect.to Twitter: https://twitter.com/saydialect\n\nAbout Dialect\n\nAt Dialect we're on a mission to build more delightful, open messaging on the internet. We believe that web3 can deliver on this promise, and give users exciting new ways to communicate with each other.\n\nWe build open-source developer tooling and are obsessed with shipping pixel-perfect user experiences iteratively on fast timelines. We are powering messaging and notifications for many of the most-loved dapps on the Solana blockchain and adding support for Aptos and other chains rapidly. If building in the open and shipping great products on fast timelines is your thing, we'd love to hear from you.\n\nAbout the team\n\nWe're a team of cloud and hard-tech veterans, hailing from the web2 messaging giants Sendgrid & Twilio, global internet-scale brands like Siemens, and moonshots like Arrival and Rigetti Quantum Computing.\n\nWe blend this mix of domain expertise, scale, and first-principles hard-tech into our work every day. This range of perspectives is our competitive edge, and we are constantly in search of more. Tell us what yours is and apply.\n\nAbout the role\n\nWe're looking for a highly creative individual who takes initiative, has an ownership mindset, is obsessed with pixel-perfect design, and loves working alongside teammates from all kinds of different backgrounds. Prior web3 experience optional. Passion for web3 and how it will change the internet required.\n\nIn this role you will:\n\nWork on product design across all of Dialect’s offerings, from its flagship mobile app through its drop-in web and mobile developer tooling.\nDevelop and maintain a single, consistent design language across our entire brand and product line, and work collaboratively with the team to maintain it.\nDevelop detailed UI/UX flows, both collecting feedback both internally and externally.\nDevelop pixel-perfect experiences that we then ship toward rapidly and iteratively.\nQA what we ship to ensure it is consistent with your designs.\n\nYou might be a great fit for this role if:\n\nYou have 4+ years of experience in product design.\nYou have extensive experience with best-in-class design software like Figma.\nYou are obsessive about pixel-perfect product design.\nYou know how to ship fast and iteratively. You understand that perfect is a horizon approached by shipping.\nYou can drive product decisions forward across the whole organization.\nYou have excellent written and verbal communication skills.\n\nBonus points if you: Have experience managing a team, or serving in more general product roles. You are already deep in some web3 communities and understand the ethos.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","solana","ycombinator"]},{"job":"Smart Contracts Security Engineer","company":"Glocomms","location":"United States","post_date":"3d","link":"https://web3.career/smart-contracts-security-engineer-glocomms/40074","key":"40074","details":"Smart Contracts Security Engineer – USA, Remote\n\n\n\n\nGlocomms are partnered with a Crypto Blockchain firm in the search for a Smart Contract Security Engineer to join the engineering team on a full-time remote basis. The role is focused on executing internal audits and testing of applications whilst onboarding additional firms to audit Clarity smart contract. The firms’ mission is to grow the crypto economy and turning BTC from a passive to a productive asset and making it a main settlement layer for Web3. This will also be the first security hire in the firm giving you the opportunity to build out the security program from the ground up.\n\n\n\n\nSome key responsibilities:\n\n\n\nConduct code audits\nAdd value to DeFi and protocol security for the Stacks ecosystem\nOnboard security auditing third parties to audit Clarity\n\n\n\nIdeal Experience:\n\n\n\nSoftware dev background with exposure to crafting smart contracts and auditing\nApplication Security Engineering background or relevant consulting experience\nIn depth knowledge of Solidity\nStrong understanding of DeFi protocols\nMonitoring and test automation experience\n\n\n\nThis is an exciting opportunity to join a growing Crypto Blockchain firm as the first security hire within the Engineering Team giving you the opportunity to build the security function from the ground up and working to take cryptocurrency to the next level. If you are qualified and interested in this opportunity, please apply and Akash Solankee from the Glocomms Cyber Security Recruitment Team will reach out to you directly.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","smart","contract","solidity"]},{"job":"Senior Full Stack Engineer React Next.js + Node","company":"Mortar","location":"Los Angeles","post_date":"3d","link":"https://web3.career/senior-full-stack-engineer-react-next-js-node-mortar/40073","key":"40073","details":"We are looking for a lead full stack engineer to join our startup and work alongside our CTO as the core React+Node/Next.js developer. Both hybrid work and full-remote positions are open for this role.\n\nMortar is a layer one blockchain built to facilitate title ownership and transference, which lets you quickly, securely, and seamlessly transfer property. We are building application layers for real estate institutions to manage their high value assets and source liquidty.\n\nYou will\n\n\nBuild the frontend components and interfaces for Mortar dApps which interact with Mortar smart contracts and Mrtr blockchain\nWork side-by-side with our CTO and blockchain engineer to execute our product roadmap and build high functioning products like crypto wallets, marketplaces and robust APIs\nOwn problems from end to end and uphold high standards for performant code with high uptime\nProblem solve new features and work alongside the core Mortar team to build an awesome product!\n\nMust-haves\n\nExpert in Next and React, and other frontend languages\nProficient CSS and other styling languages\nFirebase / Mongo\nCan build APIs with ease\nNice-to-haves\nSolidity experience\nEye for design**\nMongo / SQL\nGraphQL\nExperience building dApps like wallets and web3 marketplaces\n\nBusiness/Soft-Skills\n\nCreative problem solving\nTakes initiative\nStrong communication skills\nFluent in English\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["javascript","dev","full","stack","nextjs","node"]},{"job":"Software Engineer Crypto and APIs","company":"Scion Staffing","location":"United States","post_date":"3d","link":"https://web3.career/software-engineer-crypto-and-apis-scionstaffing/40072","key":"40072","details":"Scion Technical has been engaged to conduct an immediate search for an experienced Senior Platform Developer-APIs/Crypto for our client, a wonderful and growing Cybersecurity company based in Denver! In this role, you’ll utilize our platform architecture, mobile and Web3 skills to design and develop solutions that allow clients to securely control, in real time, their cryptocurrency assets! This is a full time, direct hire, 100% remote role.\n\nPerks:\n\nOpportunity to be part of a growing cybersecurity team!\nWork from anywhere in the United States!\nExcellent benefits/PTO/Holidays/Sick Time\nCompensation range is $135k-150k, depending on experience\n\nWhat you will be doing:\n\nUsing API frameworks, Azure cloud services and .NET libraries; you’ll design and build quality, efficient, reliable technical solutions\nWorking with operational teams, translate business requirements into feature rich, functional, high performance, scalable, and deployable software solutions\nCollaborate with cross functional technical teams to continually improve cryptocurrency security solutions\n\nWhat you will need:\n\nDemonstrated experience with .NET, Rest API development, C#, ASP.NET, Azure AD\nExpertise developing API frameworks (event processing models, enterprise integration pattern, web services, REST and web sockets, multi-threading)\n5-7+ years’ experience with large transaction volume, enterprise commercial data\nDesign, OOP, and troubleshooting experience\nWeb3 or decentralized technologies (smart contracts, solidity applications, web3.js protocols) is preferred\n\n\n\nInterested?\n\nContact Scion Technical today for more information by submitting your resume directly through this posting. We look forward to reviewing your background and discussing this exciting opportunity further!\n\n\n\n\nAbout our firm:\n\nScion Technical is a national award-winning technical & IT staffing firm! Since 2006, we have had the pleasure of successfully placing thousands of talented candidates with amazing opportunities. Through our innovative team building and recruiting solutions, we bridge the gap in executive leadership searches, direct hire technical recruiting, interim leadership placement and temporary professional staffing. Our track record and recruitment process has made us one of the top recruitment firms in the nation.\n\n\n\n\nWe are proud to be part of the Forbes lists of the Best Recruitment Firms and the Best Executive Search Firm in America. Additionally, Scion has been recognized as a ClearlyRated Best of Staffing firm as well as a top recruitment firm by The Business Times! More information about us can also be found at www.sciontechnical.com.\n\n\n\n\nScion Technical, a division of Scion Staffing, Inc. is an equal opportunity employer and service provider and does not discriminate on the basis of race, religion, gender, gender identity, national origin, citizenship status, sexual orientation, disability, political affiliation or belief, or any other protected class. We are committed to the principles of Equal Opportunity Employment and are dedicated to making employment decisions based on merit and value, for ourselves, our client companies, and for the candidates we represent. We are committed to the principles of Equal Opportunity Employment and are dedicated to making employment decisions based on merit and value, for ourselves, our client companies, and for the candidates we represent. For opportunities located in a region that have enacted fair chance, arrest or conviction-based employment ordinances, Scion Technical proactively follows the enacted guidance and considers for employment all qualified applications with arrest and conviction records. We believe in following best practices and considering all qualified applicants that apply with us.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["ai","dev","crypto","web3js","solidity"]},{"job":"Java Developer with Solidity","company":"Princeton IT Services, Inc","location":"United States","post_date":"3d","link":"https://web3.career/java-developer-with-solidity-princetonitservices-inc/40071","key":"40071","details":"Hello,\n\nCome join us and make a positive impact!\n\nWe are looking for highly skilled programmers with experience building web applications in Java. Java Developers are responsible for analyzing user requirements and business objectives, determining application features and functionality, and recommending changes to existing Java-based applications, among other duties. Aperson who thinks outside the box and designs/architects a software system rather than merely produce code from available\n\nPosition: Java Developer with Solidity\n\nLocation: Remote\n\nJob Length: Long term\n\nPosition Type: W2/C2C\n\nRequirements\n\n\nAdvanced knowledge of application, data, and infrastructure architecture disciplines\nUnderstanding of architecture and design across all systems\nWorking proficiency in developmental toolsets\nAbility to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals\n1-2 years of the current understanding of software design and Solidity\n3-4 years of current hands-on development and programming experience on the Java with Solidity\nGood experience on data streaming(ex. Kafka). data messaging and event-driven systems.\nHands-on experience with Smart Contracts, blockchain is a plus\n\nSkills: Java, Solidity. Smart Contracts, blockchain\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","java","solidity"]},{"job":"Protocol Engineer","company":"Palm NFT Studio","location":"New York","post_date":"3d","link":"https://web3.career/protocol-engineer-palmnftstudio/40070","key":"40070","details":"Lead Protocol Engineer\n\nFull-Time, Remote, Time Zones Preferred: EST - CET\n\nMission\n\nIn partnership with major IP, brands, and artists, our goal is to build a more open, inclusive, creative, and sustainable economy on web3.\n\nBenefits\n\nRemote First: You'll be part of a globally distributed team!\n\nEquity: We want everyone to have an equity stake in the success of Palm NFT Studio.\n\nFlexible work schedule: Working remotely with a globally distributed team allows you to work asynchronously and create a flexible work schedule.\n\nCompetitive Benefits: We have a competitive benefits package that includes Health, Dental, Vision and Life Insurance.\n\nUnlimited vacation/holidays: We value work life balance and encourage employees to take time to reset and recharge. We also encourage you to have no meetings on Fridays.\n\nAbout The Palm Network\n\nThe Palm network is a new NFT ecosystem for culture and creativity, built efficiently with Ethereum. The Palm network features low gas costs, fast transaction finality, and is over 99.9% more energy efficient than Proof of Work systems.\n\nThe Palm network is designed from the ground up to be as flexible as artists are creative. Today, the Palm community is making NFTs easier and more efficient to use with an Ethereum sidechain, and has a roadmap to transition to an Ethereum Layer 2.\n\nAbout Palm NFT Studio\n\nPalm NFT Studio is a collective of technology, entertainment, cryptoart and art industry leaders. The studio provides bespoke creative services for artists and rights holders looking to establish NFT marketplaces and next-generation work on the Palm network.\n\nPalm NFT Studio is led by co-founder and CEO Dan Heyman, former General Manager of protocols at ConsenSys. Initial projects launching on Palm include Damien Hirst's The Currency with Heni and Candy Digital's digital collectible program with Major League Baseball. Palm NFT Studio was brought together by ConsenSys founder and Ethereum co-founder Joseph Lubin; film producer and owner of Heyday Films, David Heyman; and founder of world class art house HENI Group, Joe Hage.\n\nWorking together with creators and rights holders, Palm NFT Studio is developing the Palm ecosystem on Ethereum to be both scalable and sustainable.\n\nAbout The Role\n\nThe Lead Protocol Engineer is responsible for research and development related to the Palm network's architecture, infrastructure, and protocol integrations. This position will play an integral role in supporting Palm NFT Studio by contributing to the development of the Palm network which serves as a foundation for the Studio's work. This is a senior engineering role that will entail leadership as well as individual contribution. You will report directly to the Chief Executive Officer and work cross-functionally in virtual teams with colleagues from internal Product, Engineering, Legal, Compliance and Strategy & Operations teams, as well as external partners within the Palm network ecosystem.\n\nResponsibilities\n\n\nResearch and contribute to decisions about protocol architecture and features.\nImplement, test, and audit protocol upgrades and additions.\nResearch and advocate for protocol upgrades and features to support the Studio's work.\nWork effectively with a high degree of autonomy while collaborating with other teams.\nKeep up to date with new blockchain technologies that can drive meaningful product results for Palm NFT Studio users.\nAnalyze transaction and usage statistics to identify and prioritize areas for improvement.\nDesign, implement and deploy secure solidity smart contracts.\nBuild high quality data pipelines to combine and deliver real time on and off chain data.\nScope, design and implement performant and secure APIs.\nLead smart contracts security audits.\n\n\nRequired Skills\n\n5+ years of production-level software engineering experience, including experience in a growth-stage company or startup environment.\n2+ years of production-level Solidity and/or blockchain engineering experience.\nExperience writing high-quality, well-tested Solidity.\nExperience with multiple backend programming languages such as TypeScript, Java, Golang, or Rust.\nExcellent written and verbal communication skills.\nExperience delegating and executing critical decisions.\nKnowledge of blockchain technology Ethereum in particular.\nStrong understanding and passion for decentralization.\nMust be detail-oriented with high organizational skills.\nPassion for software architecture and design.\nAn ability to adapt quickly to rapidly evolving tech stacks and collaborate across a variety of teams.\nStrong organizational and problem-solving skills, with a proven ability to handle multiple priorities and workstreams.\n\n\nBonus Points\n\nExperience working with Web3 or Crypto companies.\nFamiliarity with Ethereum code bases (knowledge of Besu is a plus).\nExperience with open-source projects.\nBachelor's Degree in Engineering.\nKnowledge of, and passion for NFTs.\nHaving worked in a startup as well as in a big corporate environment.\nHaving worked in a remote environment.\n\n\nHow to apply\n\nDoes this position sound like a good fit? Please apply!\n\nIf you have any issues submitting your application, please reach out to us at careers@palm.io.\n\nPalm NFT Studio is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our organization is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","ethereum","nft","java"]},{"job":"Blockchain Engineer Remote","company":"Sturdy Exchange","location":"Los Angeles","post_date":"3d","link":"https://web3.career/blockchain-engineer-remote-sturdyexchange/40069","key":"40069","details":"We are looking for a blockchain engineer comfortable writing smart contracts in Solidity and/or preferably Cadence(FLOW) and integrating them into frontend applications using technologies like web3.js/Flow FCL. This individual must be able to cooperate across workstreams and own their work from start-to-finish.\n\nExperience Requirements\n\n\n2 years experience building DApps on a major smart contract-based blockchain such as Ethereum or Flow\nGood understanding of the blockchain ecosystem including knowledge of virtual machines, smart contracts, blockchain architecture etc.\n5 years working with modern frontend web applications using frameworks like React, Vue or Ember and a variety of modern languages like Javascript, Typescript, C#, Java or Kotlin\nFamiliarity with API integrations and third-party services, and understanding the potential pitfalls\n\nWhat You’ll Be Doing\n\nWorking on Cadence (Flow) smart contracts\nCreating unique NFT experiences with music and brands\nLeading or co-leading development of a curated NFT platform\nAugmenting the platform's offering for NFTs including better integration between digital certificates and artwork NFTs and IRL events\nCollaborating with product, design and commercial colleagues in a cross-functional product team\nBuilding generative art projects\n\nBonus Skills To Have\n\nBuilding NFT and/or finance-based smart contracts\nBackend technologies including Next.js, Java and Spring Boot\nDifferent testing approaches such as unit, end to end, UI testing\nIPFS / NFT storage experience\nSecurity and cryptography experience\nA degree in computer science or a related field\n\nAbout Us\n\nArtists, musicians, gamers, nerds, moms, dads, engineers, designers, marketers, support. We created Sturdy Exchange to help people connect with artists and NFTs in meaningful real life ways. It's been amazing to help shape this emerging technology space for the better. Diversity and inclusiveness are a critical part of how we get to what's next. We believe that with diversity comes a better product, better decisions, and a better work environment. As we continue to grow, our values keep us dedicated to building a company that is representative of the world we live and play in.\n\nSturdy Exchange is an equal opportunity employer committed to promoting an inclusive work environment free of discrimination and harassment. We value diversity, inclusion, and aim to provide a sense of belonging for everyone.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","dev","blockchain","web3js","react"]},{"job":"Field Marketer","company":"Magic","location":"San Francisco","post_date":"3d","link":"https://web3.career/field-marketer-magic/40064","key":"40064","details":"About\n\nMagic helps developers make product adoption frictionless, secure, and non-custodial while giving end-users more control of their online identity. We’re experiencing high growth as more companies adopt passwordless authentication and seek ways to abstract their Web3 projects to drive adoption.\n\nWe are backed by top investors such as Tiger Global, Lightspeed Ventures, SV Angel, Social Capital, Northzone, Placeholder, Naval Ravikant, Alexis Ohanian, and Balaji Srinivasan.\n\nTo date, Magic has enabled over 100,000 developers and enterprises to onboard over 10 million users to their apps — and we continue to grow rapidly. We are trusted by leading NFT marketplaces such as ImmutableX, Niftys, & OpenSea, and major enterprise Web2 companies.\n\nIf you are excited to help onboard the next billion users to a useful, accessible, and safe Web3, let’s chat!\n\nThe Role\n\nMagic is hiring its first Field Marketer! Come shape our field marketing strategy to create experiences that engage and educate executives and developers at the world’s leading brands on how to be successful with Magic. We’re looking for an experienced, creative, results-oriented field marketer to join our growing Marketing team. This will be different than your current/last field marketing role.\n\nResponsibilities\n\n\nFind new ways to engage people at events, both by sponsoring events and hosting our own meetups, dinners, roadshows, happy hours, or whatever we find most effective.\nWork in close partnership with the Sales, Marketing, and Customer Success to bring great prospects and trusted customers together with our teams.\nBuild and execute focused field events, including third party events, webinars, roadshows, roundtables, and workshops\nBuild and execute mid- and lower-funnel regional marketing programs to accelerate leads and opportunities through the funnel, and generate pipeline and revenue in partnership with the sales organization\nPartner closely with Sales to enable efficient prospecting and lead follow up through programmatic approaches\nRefine and document the workings of our field marketing programs and events alongside the team, helping us scale our program across the globe\n\n\nYou Have\n\nA desire to experiment. New tactics and bold strategies are exciting. We might do things no one has tried before. We embrace the frontier.\nExperience with typical SaaS field marketing. You’ve been in the field before and can lay a strong foundation - for yourself and others.\nStrong organizational skills. You’ll be writing proposals, managing budgets and expenses, wrangling people (internal and external), securing venues and supplies, running retrospective meetings, calculating pipeline generated and ROI, and more.\n\n\nPreferred Qualifications\n\nExperience with virtual events and webinars.\nInterest or experience in Web3, crypto, & NFTs - particularly in how major brands can use them to provide unique access and value to their customers.\n\n\nBenefits\n\nFully remote team and flexible working hours\nCompetitive salary and stock options\nUnlimited paid time off\nPlatinum-level Health, Vision, and Dental insurance – Magic covers 99%\n401(k) program\nTop of the line equipment\n$300 monthly budget for home office needs and professional development\nAnnual team meetups\n\n\nAt Magic, we believe building a team full of diverse perspectives and experiences is vital to success. We strongly encourage anyone who has been historically under-represented in tech to apply for this role. Magic does not discriminate on the basis of gender, sexual orientation, race, religion, citizenship status, age or physical ability. Empathy, authenticity, and inclusivity are at the core of all we do.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","nft"]},{"job":"Principal Blockchain Engineer","company":"Bitt","location":"United States","post_date":"3d","link":"https://web3.career/principal-blockchain-engineer-bitt/40063","key":"40063","details":"Principal Blockchain Engineer\n\n\n\n\nAbout Bitt\n\n\n\n\nFounded in 2014, Bitt is a small (series B), multinational Fintech company which builds, supports and maintains blockchain-based digital currency solutions for Central Banks and other Financial Institutions. Our Mission is to promote financial empowerment, social inclusion and economic growth for nearly two billion unbanked people around the world. Our first client, the Eastern Caribbean Central Bank which oversees the money supply for eight nations, went live in March 2021; a world-first achievement. Learn more at www.bitt.com/DCash-pilot-program.\n\n\n\n\nWith a workforce dispersed across several territories across the World, Bitt prides itself on cultivating a highly productive remote work environment and diverse work culture. Our Leadership team are examples of the Bitt's ethos working at its best. Bitt has CBDC deployments in 12 countries across three continents and have the largest CBDC live deployment in the world outside of China.\n\n\n\n\nJob Summary\n\n\n\n\nBitt is seeking a Principal Blockchain Engineer to assist in the evolution of a privacy-preserving identity solution and our digital currency platform built on multiple market leading blockchain networks.\n\n\n\n\nJob Requirements\n\n\n\n10+ years of professional software development.\nExtensive experience with Blockchain protocols and smart contract languages such as Solidity or GO or Java; Deep experience in using these technologies to design and create products, platforms, and networks of scale\nExperience with blockchains both permissionless and permissioned esp. Hyperledger Fabric, Stellar, R3 Corda, Ethereum\nExperience working with verifiable credentials and decentralized identifiers technologies like KERI, SSID, DIDs etc.\nProficient in cryptography principles and cryptography implementation focused on public-key cryptography, and zero-knowledge proofs.\nDeep experience in at least one of these programming languages such as Scala, Go, or Rust, or Java, using GCP, Kubernetes, Docker\nProficient in at least 3 of the following SQL/NoSQL, Cassandra, PostgreSQL, MySQL, Elasticsearch, and GraphQL.\nComfortable working with distributed and remote teams.\nStrong interpersonal skills with the ability to communicate effectively with different audiences and teams\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","executive","blockchain","solidity","ethereum"]},{"job":"Senior Frontend Developer Binance Earn","company":"Binance","location":"Asia","post_date":"3d","link":"https://web3.career/senior-front-end-developer-binance-earn-binance/40062","key":"40062","details":"Senior Front-end Developer (Binance Earn)\nAsia /\nEngineering – Frontend /\nFull-time Onsite or Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities:\nImplement new user-facing features in products that have a huge amount of PV every day\nWrite client-side code to create super-fast, easy-to-use and web-based applications which include websites for both desktop and mobile browsers as well as hybrid in-app pages\nOptimize web applications to maximize speed and scale\nBuild libraries and frameworks that support complex web applications, speed up development efficiency and improve code quality\nContribute creativity and insight to solve both technical and business challenges\nResearch and promote new technologies and best practices within the team\nRequirements:\n3+ years experience developing production software\nAdvanced knowledge of TypeScript and React.js\nExperience with modern web technologies such as Webpack, Next.js, Redux, >\nProven track record of delivering well-tested, high-quality, maintainable projects\nGreat cross-team communication skills\nSelf-managed, proactive work >\nAbility to perform at a high level in a fast paced environment\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","senior","react","nextjs"]},{"job":"Volunteer crypto coding intern unpaid","company":"Sovereign Prime","location":"United States","post_date":"3d","link":"https://web3.career/volunteer-crypto-coding-intern-unpaid-sovereign-prime/40060","key":"40060","details":"Sovereign Prime is currently using off the shelf frameworks and libraries to build a Web3 peer to peer decentralized, censorship resistant, messaging and group messaging solution with its own native token-based universal, basic income.\n\nTo learn more and join this project, visit sovereignprime.com, review all of our team calls, in order to get up to speed, and then join our community, which is currently posted in Skype.\n\nSovereign Prime focuses on Social Media, CRM, Enterprise Resource Planning, and Productivity Software. Their company has offices in Shanghai. They have a small team that's between 1-10 employees.\n\nYou can view their website at http://sovereignprime.com\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["intern","entry","level","crypto"]},{"job":"Associate Creative Director Copy Web3","company":"MetaMask","location":"United States","post_date":"3d","link":"https://web3.career/associate-creative-director-copy-web3-metamask/40059","key":"40059","details":"at ConsenSys\n\nRemote (Must be US based), Full Time\n\nOur mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on.\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society.\n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.\n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nThere are perks to building the digital economy of tomorrow:\n\nRemote first: You’ll be joining a team based all over the world. Providing the unique opportunity to work with people from across 6 continents.\nEquity: We believe in ownership and want everyone to have a stake in our future success, that’s why you’ll receive equity when you join us.\nFlexible working arrangements: With our global workforce we have fine-tuned asynchronous working which means we have a lot of flexibility in the structure of when we work and how we work together.\nCompetitive benefits: We have a comprehensive and competitive benefits package to make sure we’re looking after you and what matters most.\nContinuous learning and opportunities: We provide ongoing growth and development through on-the-job learning, and the ConsenSys Advance Program which includes full access to Coursera, bespoke and technical learning programs and ConsenSys Academy, our world-class blockchain and Ethereum program.\nUnlimited vacation/holidays: We value downtime to recharge and reset, ensuring everyone at ConsenSys has work/life balance. In addition, company-wide we participate in “zero productivity” days to take a break from work, shut down, and sit back and relax.\nRecognized in the blockchain and Web3 ecosystem: Working at ConsenSys is a tremendous reference for your career. You’ll join a network of entrepreneurs and technologists that extends across the global crypto ecosystem.\n\nAbout our Creative Marketing team\n\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading the gospel of WAGMI and pushing for the adoption of web3 technology. We’re ambitious, using our unique point of view to create work that infiltrates crypto culture and changes mindsets.\n\nWhat you’ll do\n\nReporting to the Head of Creative, you will be responsible for concepting and overseeing the writing and execution of ConsenSys’s marketing initiatives across its suite of products. Working closely with your Art Director partner and counterparts in the marketing team and product design community within ConsenSys, you’ll raise the bar for the creative quality of our marketing efforts. And to do so, you'll bring with you a wealth of writing experience and be curious, creative and intuitive with a deep commitment to creating work that resonates with the highly-nuanced crypto community.\n\nHow You’ll Do It\n\nConceptualizing, crafting, writing for and directing full-funnel marketing campaigns to create engaging moments for our users\nCollaborating with the creative, design, product and marketing teams to deliver experiences that achieve brand and messaging goals\nHelping to establish and implement brand tone and voice across our products\nWorking on new forms of interaction through the use of NFTs and web3 technology\nThinking strategically and empathetically about user outcomes\n\nWe’re looking for someone with\n\n10+ years relevant experience, preferably at an advertising agency or creative shop\nExpertise and/or formal education in creative writing and its process of ideation, creation and production\nExperience working across various media placements, including video, digital, physical and social platforms\nA strong portfolio demonstrating their passion for the creative craft through effective marketing campaigns\n\nThe ideal candidate\n\nThrives within a cross-discipline team in a remote-first environment\nUnderstands both video, digital, physical and social media in all of their many forms\nHas some experience with creative tools like Adobe Creative Suite and Figma\nHas brought to market full-funnel campaigns that drove measurable results\nIs passionate about creative work and sweats the details\nIs driven by curiosity and pursuing new ways to engage\nIs a lifelong learner, always honing their craft, and eager to participate beyond their role\nIs eager to participate beyond their role with a can-do attitude\nGets excited about web-based and technology experiences\nWorks well in a fast-paced, agile environment\nIs a motivated self-starter who communicates clearly and effectively\nHas knowledge and experience in the blockchain/web3 space\n\nIt’s a bonus to have\n\nAn understanding of the Blockchain and Ethereum ecosystem with an interest and curiosity to learn what you don’t already know\nExperience in website and app design\nExperience with remote work tools like Slack, Google suite and JIRA\nKnowledge of full-funnel marketing strategies\nInternational experience or experience working with global teams\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found here.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $113,000 - 175,000.\n\n#LI-KB1\n\nMetaMask focuses on Cryptocurrency, Blockchain / Cryptocurrency, and Web3. Their company has offices in San Francisco, London, Brooklyn, and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://metamask.io or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","ethereum"]},{"job":"Affiliate Sales Manager","company":"Afterpay","location":"New York","post_date":"3d","link":"https://web3.career/affiliate-sales-manager-afterpay/40058","key":"40058","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nWe are much more than our job descriptions, but as Afterpay Ads, Affiliate Sales, here’s where you will begin…\n\n\nWork closely with the Afterpay Ads Sales leadership team to assess the current business, develop a deep understanding of the Afterpay Ads product, our advertising partners and competitive landscape\nClose advertising deals with key retail partners that align with Afterpay Ads strategies & business targets\nPartner with cross-functional teams to structure and execute strategic initiatives\nTrack, measure and proactively communicate report to senior management on the portfolio of accounts, focusing on goal attainment and course corrections\nAnalyze, measure and communicate campaign performance to advertising partners\nEnsure that advertising partners receive the highest level of sales and operational customer service\nBuild internal processes to streamline workflows\nDrive success toward KPIs, and exceed revenue targets\n\nQualifications\n\nLike us, you’ll be deeply committed to delivering positive outcomes for our customers and team, and passionate about shaping the future of Afterpay.\n\n4+ years experience in advertising, partnerships and revenue driving teams\nDemonstrated track record of meeting & exceeding KPIs and sales targets\nExcellent communicator with strong interpersonal skills and ability to build relationships within various vertical/industries via email and phone\nExcellent organizational & time management skills\nThrives in fast-paced organizations while producing quality results\nExcels in cross functional collaboration\nUnderstands analytical and quantitative levers used by our merchants\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future. Please Note: This role is eligible for commission, on top of the base salary.\n\nZone A: USD $74,500 - USD $91,100\n\nZone B: USD $69,300 - USD $84,700\n\nZone C: USD $65,600 - USD $80,200\n\nZone D: USD $63,400 - USD $77,500\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","sales"]},{"job":"DevOps Engineer","company":"0x Labs","location":"San Francisco","post_date":"3d","link":"https://web3.career/devops-engineer-0x/40055","key":"40055","details":"COMPANY\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We’re a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we’ve made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe’re a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We’ll consider your application regardless of where you call home.\n\n\n\nYOUR ROLE AS AN INFRASTRUCTURE / DEVOPS ENGINEER AT 0X\n\nYou'll help ensure our suite of products remains as performant and reliable as possible, automate a variety of critical engineering tasks, and ensure a world-class, streamlined internal developer experience. You'll take a data-driven approach to optimization; your inclination should be to profile and benchmark existing systems, honing in on the highest impact improvements that should be undertaken. You care deeply about the reliability of your solutions and the productivity gains created for the rest of the engineering team.\n\nThis role is deeply important to the success of 0x as a whole, and it comes with a high degree of ownership. You'll have broad freedom to take any appropriate steps toward improving our infrastructure. We build on a quickly evolving modern stack, and we welcome well-reasoned, forward-thinking technology and architectural suggestions.\n\n\nRESPONSIBILITIES\n\nHelp ensure uptime and reliability across 0x’s suite of products and services\nTake ownership over our monitoring stack (Prometheus and Grafana)\nAutomate a variety of engineering-related tasks and processes\nManage and upgrade our Kubernetes infrastructure without downtime\nAssist in developing a robust real-time data streaming platform to be used for a variety of tasks related to data science, product development, and streamlining internal developer experience\nImprove internal build systems and manage/optimize CI/CD\n\n\n\nREQUIREMENTS\n\nWill accept a Bachelor's degree or foreign academic equivalent in Computer Engineering or related field and\nThree (3) years of experience in job offered or a related occupation\nPassion for the benefits of decentralization and the 0x mission\nExhibit our core values: do the right thing, consistently ship, and focus on long-term impact\n\n\n\nAlso requires education or experience in:\n\nTypeScript\nBig data streaming and aggregating in real time with large-scale database deployments such as Elasticsearch and Postgres\nKubernetes infrastructure automation (Infrastructure as Code)\nCloud infrastructure maintenance and scaling\nContinuous integration (CI) and continuous delivery (CD) with Kubernetes\nModern DevOps practices (e.g. GitOps, CI pipelines or CD pipelines)\nKubernetes, Linux, and networking – profile and benchmark different systems from application to infrastructure components\nPeer-to-peer networking technologies (e.g. Ethereum)\n\n\n\nPAY RANGE\n\n$125,000to $175,000\n\nLOCATION OF EMPLOYMENT\n\n300 Beale Street, Suite A, San Francisco, CA 94105; and Denver, CO., *TELECOMMUTING PERMITTED\n\n\n\nBENEFITS\n\nCompetitive salary and equity with occasional cryptocurrency-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA for U.S.-based employees\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nFlexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office conveniently located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco’s Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["devops","dev","ethereum","nft"]},{"job":"Blockchain Backend Developer","company":"Trikon Ecosystem","location":"India","post_date":"3d","link":"https://web3.career/blockchain-backend-developer-trikon-ecosystem/40054","key":"40054","details":"As a Back-end Developer, you will design and develop backend applications i.e. the database server, server-side applications as well as back-end system architecture. You will be working on the web as well as mobile applications. You should have expertise in REST API development and database management.\n\nTo succeed in this job role, you should possess excellent communication skills. You should also have the ability to keep a close eye on details. You should be able to manage multiple projects simultaneously.\n\nResponsibilities\n\nDesign, create and deploy secure, scalable, and sustainable backend services.\nParticipate in code and design reviews to maintain our high development standards\nConduct performance tuning and optimization\nDeveloping back-end website applications.\nCreating servers and databases for functionality.\nEnsuring responsiveness of Website.\nEstablish logging, monitoring, analytics, and telemetry frameworks for the team.\nWorking alongside graphic designers for web design features.\nSeeing through a project from conception to finished product.\nDesigning and developing APIs.\nMeeting both technical and consumer needs.\nStaying abreast of developments in web applications. Identify opportunities to improve existing practices.\n\n*Requirements *\n\nBachelor's degree in computer science or related technical field.\nMinimum 2+ years of experience as a Back-end Engineer\nExperience with NodeJS, DSA, And API building.\nSelf-driven with the ability to deliver results within deadlines.\nTeam player\nPassionate and up-to-date on the rapidly changing world of blockchain technology\nStrong organizational and project management skills.\nAttention to detail.\nGood communication skills\nGood time management abilities.\nStrong decision-making skills\nExperience with blockchain technology (Good to have).\n\nTrikon Ecosystem focuses on Online Gaming, Blockchain / Cryptocurrency, and Web3. Their company has offices in India. They have a small team that's between 11-50 employees. To date, Trikon Ecosystem has raised $1.5M of funding; their latest round was closed on July 2022 at a valuation of $4.5M.\n\nYou can view their website at https://trikon.io or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","blockchain"]},{"job":"Customer Success Advocate","company":"Square","location":"AZ Scottsdale US","post_date":"3d","link":"https://web3.career/customer-success-advocate-square/40053","key":"40053","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on the candidate's work location and may be may be modified in the future.\n\nZone A: USD $26.73\n\nZone B: USD $24.04\n\nZone C: USD $21.59\n\nZone D: USD $20.00\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["customer","support"]},{"job":"Smart Contract Developer","company":"Swarm","location":"Remote","post_date":"3d","link":"https://web3.career/smart-contract-developer-swarm-13/40051","key":"40051","details":"Swarm is a system of peer-to-peer networked nodes for a decentralised storage and communication service.\nSwarm could shape the future towards a self-sovereign global society and permissionless open markets. On Swarm, applications run autonomously yet securely in a planetary-scale deployment and execution environment.\n\nThe Swarm Foundation core dev team is looking for a smart contract developer / Solidity engineer. The ideal candidate would be familiar with EVM, Solidity and blockchain development.\n\nYour role\n\nDevelopment and maintenance of Swarm’s smart contract suite for the incentives and ENS design,\nDevelopment and maintenance of various smart contracts for Swarm layer 2 solution\nCoordinating API design with other stakeholders within and outside the organization\nBringing code up to spec, documenting code\nDelivering well-tested code with special attention to smart contract security\nCoordinate release and deployment of smart contract updates\nConducting thorough code reviews to your peers\n\nYour profile\n\nYou have advanced knowledge of Solidity\nYou have authored smart contract code in production use on Ethereum mainnet VM\nYou like to work remotely\nYou are available during working hours around the CET time zone\nYou manage your own time effectively and respect time constraints\nYou are a self-starter type and like to take the initiative\nYou can express yourself fluently in English, both verbally and in writing\n\nWe appreciate\n\nA passionate open-source contributor\nKeen interest in tokenomics\nFamiliarity with broader Web3 concepts and ecosystem as well as blockchains\nFamiliarity with Web3/Ethereum JS libraries.\nFamiliarity with Golang, Python, Javascript (Node.js, Typescript, React)\nUnderstanding of basic cryptographic concepts\nIt’s an advantage if you have worked in a different time zone\n\nSwarm offers\n\nAn open, flat and transparent work environment\n100% remote friendly\nFlexible working hours\nWe care about our swarm: Incentives through BZZ, Swarm’s token\n\nTo apply, please send your CV and GitHub repo to talent@ethswarm.org.\n\nSwarm focuses on Software and Community Development. Their company has offices in Europe. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://swarm.ethereum.org/index.html\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","remote","react","solidity"]},{"job":"QA Permance Engineer with Web3 background","company":"Chainstack","location":"Remote","post_date":"3d","link":"https://web3.career/qa-performance-engineer-with-web3-background-chainstack/40050","key":"40050","details":"At Chainstack we are building the most reliable Web3 infrastructure for the next generation of web applications—open, trustless, and robust.\n\n\n\n\nThousands of innovators in DeFi, NFT, gaming, analytics, and other verticals are empowered by scalable distributed Chainstack APIs. We process billions of requests on a daily basis and provide unified user-friendly access for developers to all prominent Web3 protocols—from Ethereum and Polygon to Solana.\n\n\n\n\nWe are currently looking for a QA Performance Engineer with Web3 background.\n\n\n\n\nOur main stack:\n·        Python,\n·        Pytest\n\n\n\n\nWe also use:\nPostgres, Git, CircleCI, Allure, Playwright\n\n\n\n\nWhat you will do:\n·        Automate and maintain Blockchain protocols Performance tests\n·        Improve our infrastructure quality by detecting and troubleshooting performance problems\n·        Take part in the resources usage optimization\n·        Perform manual testing of new features\n·        Design test cases and test plans\n\n\n\n\nJob Requirements:\n·        Extensive experience with Python\n·        3+ years of performance testing experience, good technical background\n·        Knowledge of performance testing frameworks and tools\n·        Experience working with blockchain/web3 protocols is a plus\n·        Experience using test methodologies, writing test plans, creating test cases\n·        Experience with continuous integration and delivery tools, such as CircleCI\n·        The skill and drive to discover and debug problems in the software\n·        Good spoken and written English\n\n\n\n\nWe offer\n\n· Working with an international team of world-class professionals on an exciting and challenging project\n\n· Learning & Development opportunities – mentoring, lectures, participation at industry conferences and events\n\n· Flexible working locations and hours\n\n· Friendly team and a friendly environment over the World\n\n· Additional benefits – stock options, salary in USD, educational needs, corporate parties and team buildings, referral bonuses and many more others\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","quality","assurance","remote","solana","ethereum"]},{"job":"Software Developer Intern","company":"Pillow","location":"Bangalore","post_date":"3d","link":"https://web3.career/software-developer-intern-pillow/40049","key":"40049","details":"Software Developer Intern\nBangalore, Karnataka /\nTechnology – Engineering /\nIntern\n/ On-site\n\nApply for this job\nPillow exists to accelerate economic opportunities for everyone. We believe that digital assets and tokenisation of economies using the power of blockchain will accelerate this outcome. Digital assets make access to economic services borderless, cheap, and transparent.\n\n\nOur mission is to become the default home for digital assets across emerging markets. This mission has enabled us to solve real financial challenges in markets such as India and Nigeria for thousands of people.\n\n\nPillow is backed and trusted by reputed investors including Accel, Elevation Capital, Quona, Jump Capital and others, who have collectively invested over $21mn across our Seed and Series A rounds, additionally bringing expertise in fintech, crypto, and consumer product building.\n\n\nPillow’s stellar team members operate on a high degree of freedom and ownership. We believe in setting a fair, transparent, performance-driven culture that incentivises you to be your best.\nWhat do we expect?\nYou will be a part of product development team, developing modules for data driven applications\nYou will deliver production quality code adhering to best practices\nYou should assist in production troubleshooting\nYou should research and implement cutting-edge technologies relevant to Pillow’s business problems\nYou adhere to company, privacy and information security policies and procedures\nYou complete all the awareness training assigned on time\nYou’ll be a good fit if:\nYou can do minimum 6 months Internship\nVery good in Advanced data structures and algorithms\nStrong problem-solving ability\nGood programming skills in any one of - Java, Scala, GoLang, Python, Javascript\nGood SQL querying skills. Above Basic level\nDegree in Computer Science or IT with strong academic credentials\nStrong understanding of transactional and high scale systems\nWhat you’ll get:\nAn opportunity to work on something that really matters\nA fast-paced environment to learn and grow\nHigh autonomy; freedom to take risks, to experiment and to fail\nAmazing colleagues to work with\nAt Pillow, we’re looking for highly adaptable individuals with passion and ownership of their roles. We recommend you try your hand and apply for this position even if your experience doesn’t match the entirety of the description. Your skills will stand out and set you apart from the rest if you’ve had your share of twists and turns that challenge the norms. Join us!\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","intern","entry","level","javascript","scala"]},{"job":"Software Engineer Crypto Security","company":"Reddit","location":"San Francisco","post_date":"3d","link":"https://web3.career/software-engineer-crypto-security-reddit/40047","key":"40047","details":"Please note: Reddit is continuing to grow our teams with the best talent. This role is completely remote and hybrid friendly.\n\nThe RedditX team is among the most innovative, forward-looking teams at Reddit. We are a fast-moving and entrepreneurial organization within Reddit, dedicated to building new monetizable experiences that users and communities love. With our track record of rapid execution and experimentation, we have been doubling revenue steadily year-over-year. Today, the X org is responsible for established products like Avatar, Premium, Awards, Talk, Powerups, and more.\n\nWe are looking for someone with 2+ years working experience in a security role on Ethereum projects as well as some experience developing scalable backends (e.g. Python/Go/Java) that integrate with them.\n\nQualifications:\n\nFluency in Solidity.\nExperience with Solidity & Ethereum security and smart contract auditing.\nExperience with smart contract development tools, patterns, and practices.\n5+ years of experience building clean, maintainable, and well-tested code.\nGreat engineering skills and strong CS fundamentals.\nExcellent collaborative and communication skills.\nAble to work effectively under schedule pressure to fix defects, review code, design, write, test new code, and diagnose production issues.\n\nBenefits:\n\nRemote and Hybrid friendly\nAnnual Personal & Professional development funds\nComprehensive Health benefits\nWorkspace benefits for your home office\n401k Matching\nFamily Planning Support\nFlexible Vacation (please use them!) & Monthly Global Wellness Days\n4+ months paid Parental Leave\nPaid Volunteer time off\n\n#LI-Remote #LI-TH1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","crypto","solidity","ethereum"]},{"job":"Sales Development Representative Public Sector","company":"Chainalysis","location":"Washington","post_date":"3d","link":"https://web3.career/sales-development-representative-public-sector-chainalysis/40046","key":"40046","details":"The global financial ecosystem is changing. Revolutionary blockchain technology has unlocked the potential for people around the world to have more equal access to wealth and information. This transformation has begun with the mass global adoption of cryptocurrencies but like all new financial systems, it needs greater trust to realize its full potential and remain safe from bad actors. That’s where we come in. The Chainalysis blockchain data platform enables businesses, governments, and banksto solve the world’s most high-profile criminal cases, paving the way for an economy built on blockchains.\n\nChainalysis is seeking motivated individuals who are passionate about our mission, building trust on blockchains. The most meaningful characteristic of our Sales Development team is that we love talking about Chainalysis. Our job is to help understand customers’ pain points and determine whether or not our solution will help them overcome the challenges they’re facing.\n\nOur SDRs or Sales Development Reps are great at asking the right questions, being analytical, opportunity-driven, and obtaining the ability to build relationships. You will collaborate and work closely with our Marketing and Sales team with the focus on identifying targeted prospects and customers through a variety of online research. We measure our success by the number of introductions we make to the Account Executive team and the overall revenue that started with our outreach. This individual will be a key indicator in supporting our US Public Sector markets.\n\nIn one year you’ll know you were successful if...\n\nYou constructed personalized outreaches to define a strategic target of key accounts\nYou held ownership of having an initial sales outreach to a Chainalysis customer\nYou’ve introduced fully qualified prospects to the Account Executive team that turned into valuable customers\nYou’ve obtained the ability to have a well-informed conversation with a variety of customers about Chainalysis, our solutions, and how they’re working within the cryptocurrency industry\nYou are an expert in navigating Salesforce, SalesLoft, and Linkedin Sales Navigator\nYou’ve mastered objection handling and overcame customer obstacles in the past year\n\nA background like this helps:\n\nPrevious experience in outbound sales, cold calling, prospecting research, complex sales pitches, fundraising, and/or recruiting\nSaaS / Software technology experience and proven success in a business development function\nDemonstrated strong interpersonal skills and distinguished verbal and written communication ability\nEagerness to work in a fast pace environment with the capability to handle pressure in a results-driven role\nAn overachiever in whatever makes you tick - sports, drama, music, underwater basket-weaving, etc.\nCuriosity and interest in an ingenious technology such as blockchain analytics\n\nThe base salary range for this role is $52,000 to $64,000 on a national basis and may be higher or lower depending on the location of the role. Base salary is just one part of our total rewards package which additionally includes equity, performance bonus or commissions for eligible roles, and competitive benefits. Individual pay decisions are based on a number of factors, including qualifications for the role, relevant work experience, skillset, internal equity, and other factors, consistent with applicable law.\n\n#LI-PG #LI-Remote\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Relationship Manager","company":"Ledgible Crypto Tax &amp; Accounting","location":"United States","post_date":"3d","link":"https://web3.career/relationship-manager-ledgiblecryptotax-amp-accounting/40045","key":"40045","details":"Ledgible is The Leading CryptoAsset Tax and Accounting Platform\n\nLedgible is a VC-backed rapidly growing global company working at the intersection of crypto and fintech. Join our team of top-notch engineers and crypto enthusiasts as we build the novel tax, accounting, and finance tools that will pave the way for crypto's continued rise.\n\nLedgible provides tax reporting and portfolio tracking for crypto assets. The Ledgible platform is the proven crypto asset solution for professionals with leading accounting firms and major crypto companies globally. Ledgible Tax Pro and Ledgible Accounting used by hundreds of firms to make tax reporting easy for professionals and clients alike. For more information, visit Ledgible.io.\n\nJob Description\n\nWe’re looking for a relationship manager at Ledgible, meaning you’ll manage projects and relationships throughout the sales cycle. For high and mid value clients, you’ll connect with them, run meetings, understand their (potential) use case for our product and help the assigned sales team keep the relationship alive through constant communication. You’ll also manage relationships and projects for existing clients (and sub-clients) including ensuring we understand exactly what the client needs/wants, then ensuring those requirements are shared appropriately internally. Once the custom development work is complete, you’ll ensure the client is satisfied. Understanding how banking, accounting, data connectivity and/or financial institutions work is a plus. Understanding cryptocurrency is a plus. Good communication, focus on detail and quick-thinking is required. Being able to juggle multiple projects and activities is a must. EST or CST preferred.\n\nThis is a key hire for us with high expectations; within the first 90 days, you will be expected to:\n\nAttendsales calls and customer discovery calls and take detailed notes\nCommunicate with prospects (sometimes repeatedly) about discussing Ledgible\nCoordinate activities internally and externally regarding meetings, proposals, calls, etc\nLearn about the relationships between our clients and prospects and the different Ledgible and non-Ledgible products they use\nTake over existing projects at various stages in the sales cycle\n\nQualities for success\n\nYou must be coachable and ready to learn the digital asset space in a fast-paced startup environment. Some of what we will deliver hasn’t been delivered by anyone before, so curiosity and a bias for action is required.\nTaking ownership / responsibility is critical for a project or task. We want to get results, quickly..\nWe are looking for someone who can take on a new task, quickly give it a try, but be willing to take feedback if/when necessary. Sometimes there’s ambiguity in a task. Being able to thrive in that ambiguity and take the initiative to move forward is required.\nDetails are important. We want someone who can focus on details.\nPersonable. We talk with a lot of different people. Being personable and approachable is important both internally and externally.\nDesire to improve and get better.\nWe want someone who can ask good questions and understand relationships between companies and products (PD stopped here)\n\nA few other general traits and nice-to-have skills that might make you a good fit:\n\nYou have worked in or have knowledge and interest in Crypto\nYou have some experience or understanding of the banking and financial world\nYou have some experience or understanding of tax and accounting\nYou are self-motivated, and care about the success of the people you work with\nYou have experience managing several projects and complex relationships\nWe are a tech company so being technology literate is important\nComfortable working in a startup environment\nTechnical experience and a light understanding of software development is a plus, but not required\n\nWhat's exciting about this role?\n\nThere’s a lot of new things happening in the crypto world every day\nYou’ll work with incredibly intelligent people who want to see you succeed\nYou’ll be pushed to learn and grow significantly in a short period of time\nYour contributions will be an integral part of the company’s success\n\n\n\nBenefits and Pay\n\n$80k-$100k\nHealth Benefits and FSA\nVision and Dental Insurance\nShort and Long Term Disability Insurance\nLife Insurance\n401K Plan\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech"]},{"job":"Social Community Manager","company":"Spaceport Technologies","location":"Boston","post_date":"3d","link":"https://web3.career/social-community-manager-spaceporttechnologies/40044","key":"40044","details":"Spaceport is a stealth startup building infrastructural fabric for metaverse worlds. We’re freshly capitalized and venture backed by some of the best crypto-native VCs, respected celebrities and largest studios in the world.\n\nWe’re developing technologies that will expand what is possible on the blockchain, set new precedents in how digital content interacts with the real world and lead the march towards a decentralized metaverse future.\n\nOur rockstar team’s experience ranges from launching billion dollar gaming franchises like Bioshock and Saint’s Row to projects with many of the largest US celebrities.\n\nIf you are seeking a role at a well-funded company operating at the bleeding edge of technology, if you want to collaborate with the brightest minds and celebrities from around the world and if you want to build decentralized software that will be used by billions of people —you should apply for this job.\n\nWhat to expect\n\nYou will work directly with the leadership team on a daily basis. You will have the opportunity to wear many hats, and to take full ownership of developing a dynamic digital community within the company.\n\nJob Responsibilities\n\n\nManage our online presence - website, social media, and digital outlets\nGenerate, edit, publish and share daily content (original text, images, video, or HTML) that builds meaningful connections and encourages community members to take action\nWork closely with the marketing team to drive growth and assist in the implementation of social campaigns that align with upcoming product launches and other company initiatives\nRespond to timely discussions and questions on social media and design shareable, creative campaigns for regular tweets and posts.\nCommunicate and respond to community requests and questions\nTrack community sentiment and provide actionable reports and recommendations\nEnforce strict community rules, identify and remove bots\n\n\nRequirements\n\nProven working experience in community management\nAbility to grow and develop digital communities\nProven experience leading and growing communities on Discord, Twitter, Reddit, etc\nDemonstrable analytics tools knowledge and understanding of community growth KPIs and metrics\n\n\nTypes of people we’re looking for\n\nBuilders - people who love building something new and seeing their work used, whether as a passion side project, in a startup, or within a larger corporation.\nSpeedwalkers - people who get things done, who move with unusual urgency, who take pride in continual improvement and integrating feedback\nOwners - people who take responsibility for their decisions, document their processes and treat their work with a deep sense of pride\nTroublemakers - people who enjoy not just getting their hands dirty, but dream about what can be improved, new products that could be built, and new lines of business that we can disrupt\n\n\nBenefits\n\nCompetitive pay and benefits\nRegular team off-sites and retreats\nRemote-first work environment, with optional in-person offices\nWork-from-home improvement stipend\nCoworking membership stipend\nProfessional learning and development stipend\n\n\nPlease reach out even if your experience doesn’t align with the job description precisely. We are looking for talented people to fill roles that may not already be posted and we can always explore options after starting the conversation. Reach out to us today!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech"]},{"job":"Community Engagement Associate","company":"Candy Digital","location":"New York","post_date":"3d","link":"https://web3.career/community-engagement-associate-candydigital/40043","key":"40043","details":"Candy’s mission is to deepen our connection to experiences that bring us joy. As fans. As collectors. As people creating lives, we’re passionate about living. We understand that connection because we’ve chased it since we were kids. We are unapologetic fans and serious collectors who see limitless possibilities in the digital revolution that’s disrupting – more like exploding – the way we engage and experience our favorite sports, music, art, and cultural icons.\n\nWe know the passion of being a die-hard fan and the need for the experience beyond the bleachers. We’re building a fully immersive storefront where fans can not only buy, sell, and trade their digital assets but also experience a fully immersive marketplace that gives our users enablement beyond imagination with their digital assets.\n\nFandom. Reimagined.\n\nOur Investors\n\n\nMichael Rubin- Founder & CEO of Fanatics & Philadelphia 76ers co-owner\nMike Novogratz - CEO of Galaxy Digital, Pioneer Investor\nGary Vaynerchuk- CEO of VaynerMedia, Social Media Entrepreneur.\n\nSO YOU WANT TO JOIN CANDY?\n\nWe are looking for a Community Engagement Associate to join our Fan Experienc team! We help fuel Candy’s success by building our brand and launching our company and core products into the market. As a team,we focus on engaging our consumers in strategic, innovative methods with a background in thinking outside the box. This team is the life of and voice of our customer in our online channels focused on engagement, collaboration, and fuel for our growing community.\n\nWe are searching for creative minds that are excited to take on challenges in the immediate while providing vision to the future. We want builders, innovators, and those that can not only think outside the box but collaborate outside the box.\n\nAS OUR MOST VALUABLE PLAYER, YOU WILL...\n\nManage the brand’s presence on Discord and own the day-to-day operation of the channel to help build the community centered on Candy and its products\nBuild out the server channels and fuel the conversation with fans by sharing the latest drops, news, and launches to drive hype for Candy\nRepresent the brand on Discord via channel conversation, audio, video, or walkthroughs and have comfort testing out various content approaches\nGenerate critical learnings from the Discord community to share out to the larger org and help impact future decision making through customer mindset evaluation\nExplore growing social platforms for new opportunities to connect with consumers via a test and learn content strategy\nCoordinate activities across multiple internal teams and external Partners and Vendors\nEnsure all efforts are based on solid hypothesis design and are structured to deliver against clear, measurable success metrics, utilizing a test-and-learn approach\nProvide insight and recommendations to the larger organization, including clear and compelling presentations that effectively communicate complex issues to Leadership and other internal/external stakeholders\n\nWHO ARE YOU?\n\nYou have an extensive working knowledge of Discord best practices\nYou have deep expertise in Marketing, Communications, Journalism, or a related field\nYou are knowledgeable of professional sports in a working capacity or as a fan\nYou have the ability to collect, analyze, and use social data to inform decision making\nYou are willing to work occasional nights and weekends to give the brand presence during marquee events throughout the year\nBonus: You have a working knowledge of Adobe Photoshop and video editing tools/software\nYou have an appetite for problem-solving and a love for fast-paced, ever-changing environments\nYou have big ideas that get results!\nYou have a love of sports, collectibles, blockchain & crypto, and/or collectibles!\n\nYou’ll Love Working here because...\n\nOur People . You will be working with the top players who are the most talented, fun, supportive, and innovative leaders and teams. Aka, people you can be proud to work with!\nOur Mission. We believe that we are building something great and that the best things we create will make the world a better place. Our goal is to deepen our connection through experiences to fans and collectors globally.\nPerks. Our team-based culture provides the foundation for people to do their best work and constantly learn and grow. We offer a full slate of benefits, including competitive salaries, stock options, health coverage, and unlimited vacation. Given that we’re an early-stage startup, our benefits package continues to evolve as we do. Your ideas and suggestions matter to us!\n\nOur Core Values.\n\nTrust. We safeguard the goal. We believe we will only succeed if we earn trust – trust of our people, trust of our customers, trust of our partners. We will strive to achieve and keep faith at all times.\nInnovation. We dream big. We’re endlessly curious and constantly searching for the best, the better, and the never-before imagined.\nExcellence. We take big swings. We have high expectations of ourselves in everything we do.\nGrit. We push past the finish line until the last second. Giving up is not an option. We will always find a way.\nInclusion. We are a team player, and we are in it together. We believe that diverse thinking comes from different thinkers, and we need all perspectives to come together and win.\nAuthenticity. We are the real deal and always authentic in what we create, our dealings with others, and in who we are as human beings.\nAccountability. We carry the ball. We hold ourselves to the highest moral and ethical standards. We will be fair and honest and take responsibility for our actions.\n\nTotal Compensation Range (Base + Equity): 50k-75k per year\n\nOur compensation package currently breaks down into a base salary and an equity component for all employees. The candidate’s seniority and the evaluations made of that candidate during the interview process determine compensation.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech"]},{"job":"Crypto Consultant","company":"Sonic Wallet","location":"United States","post_date":"3d","link":"https://web3.career/crypto-consultant-sonicwallet/40041","key":"40041","details":"Sonic Wallet provides advisor-led crypto financial services. We are looking for people in California, who have good knowledge of Crypto products.\n\n\n\n\nIn this position you will be responsible for providing insights to clients. To do so, you will first meet with our clients to uncover their financial needs and challenges. Then, you will use your strong analytical skills to perform quantitative and observational data analyses. From these analyses, you will form and present your recommendations to our clients.\n\nResponsibilities\n\nPrepare and execute client investment recommendations\nInterface with clients to discover their financial goals\nPerform quantitative and observational data analyses\nCreate and present client recommendations\n\n\n\nQualifications\n\nStrong analytical, communication and quantitative skills\nDemonstrated proficiency in MS Excel\nStrong presentation and communication skills\nGood knowledge of Crypto Industry\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["consulting","crypto"]},{"job":"Associate Vice President","company":"Ditto PR","location":"United States","post_date":"3d","link":"https://web3.career/associate-vice-president-dittopr/40040","key":"40040","details":"Clients, Industries and Work\n\n\n\n\nDitto works with cutting-edge clients in the fastest growing industries. From taking stealth startups to unicorns, to launching the latest NFT and Web3 experiences, to helping fintech find their footing, to guiding consumer brands on connecting with their audiences, Ditto leads communications and digital services for some of the most exciting projects and smartest Founders and CEOs both in the U.S and globally.\n\nWe are a results-focused team, which requires us to be experts in our clients’ industries and bring creative leadership on big plans and smart ideas that deliver impactful outputs.\n\n\n\n\nAt Ditto, we work hard, fast and smart. We cover social strategy, content development, influencer management, messaging, media training, media relations, events and conferences, crisis support, and more. While we collaborate to talk through issues and come up with new ideas, plans and strategies, employees at Ditto also maintain a high-level of personal responsibility. This means each team member at Ditto understands their role and responsibilities, expectations on accounts and how to accomplish the work expected of them.\n\n\n\n\n\nAbout The Job\n\n\n\n\nAt Ditto, we start with a very simple philosophy on accounts: As the senior lead on the account, you should be doing the senior lead work. You are responsible for the success of accounts and a positive work experience for your teams. You deliver strategic and tactical results, see the bigger picture, and form strong client relationships. You spend time meeting, motivating and helping others.\n\n\n\n\nYou are selflessly motivational, patient, always available to provide feedback but also set boundaries to ensure roles are maintained.\n\n\n\n\n\nWhat You Will Do\n\n\n\n\n- Client Relations: You are the client’s go-to communications professional\n\nUnderstand the client’s needs, expectations and business and provide on-going strategic communications counsel\nLead client facing meetings with authority and confidence\nAnswer client questions in real-time\nEarn the trust and confidence of the client\n\n- Account Success: You are a hands-on leader and daily senior presence\n\nCommunicate clearly, maintain account organization, define roles and responsibilities to ensure account health\nMotivate and lead by example\nDeliver results, understanding what success looks like\nBalance the week-to-week with overarching long term vision\nThink creatively, contribute ideas regularly, and identify new opportunities\nManage 3-5 account teams and collaborate with peers and junior team to keep the account moving forward\nEnsure successful 30,60,90 day client onboarding\n\n- Work: You execute timely and high quality outputs on an ongoing basis\n\nProvide communications counsel to client\nDevelop strategy memos and presentations\nCraft messaging and conduct media training\nWrite or edit op-eds, content, press releases, pitches\nGenerate Tier One client features in media\nContribute to account growth and business development\n\n\n\nWho You Are\n\n\n\nPR: Can demonstrate success in messaging, media training, media relations, writing, events, social media\nIndustries: Experience in edtech, fintech, crypto, consumer and B2B preferred.\nWork Ethic And Intensity: Proven mastery of a mid-level role: ongoing media relations, smart, organized, client facing, leader. Has shown the ability to work in a fast-paced environment.\nAccounts: Successfully led accounts and can clearly articulate “success” on these accounts and personal ownership of outputs\nStrategic Thinking: Delivered smart strategy to clients in a way that led to an output and can provide examples of short term and long term strategic thinking on accounts\nLeadership: Has demonstrated the ability to lead / hold people accountable, meet deadlines, and manage conflict resolution\nNew Business: Has successfully brought in new business at their last agency and/or has participated in pitching, proposal, and contract writing\nClients: Has been directly responsible for managing a client / managed a client through a problem and can give examples of client relations\n\n\n\n\nWhat We Offer\n\n\n\n🤩 Being part of a fast-paced and high-output communications agency\n🤓 Rewarding, challenging, and high-empathy team culture\n❤️🩹 Monthly rewards to spend on health and wellness\n💻 This role can be remote, hybrid, or in-office with a diverse and decentralized team\n💵 Performance bonuses (can be monthly, quarterly, new business, MVP, and more)\n📈 Health insurance covering medical, dental, vision, disability, and FSA\n🎒 Continuing education\n💪 401(k) Plan with 5% match\n🧳 Unlimited PTO\n🚼 12 weeks fully paid maternity/8 weeks fully paid paternity leave\n\n\n\n\n\nDiversity & Equality\n\n\n\n\nDitto PR is committed to the principles of equal employment. We are committed to complying with all federal, state, and local laws providing equal employment opportunities, and all other employment laws and regulations. It is our intent to maintain a work environment that is free of harassment, discrimination, or retaliation because of age (40 and older), race, color, national origin, ancestry, religion, sex (including sexual orientation and gender identity), pregnancy (including childbirth, lactation, and related medical conditions), physical or mental disability, genetic information (including testing and characteristics), veteran status, uniformed servicemember status, or any other status protected by federal, state, or local laws. Ditto PR is dedicated to the fulfillment of this policy in regard to all aspects of employment, including but not limited to recruiting, hiring, placement, transfer, training, promotion, rates of pay, and other compensation, termination, and all other terms, conditions, and privileges of employment.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["nft"]},{"job":"fullstack web3 JavaScript developer","company":"decent.land","location":"Remote","post_date":"3d","link":"https://web3.career/full-stack-web3-javascript-developer-decent-land/40039","key":"40039","details":"About decent.land\n\ndecent.land is a seed stage project building in the multichain social and identity space on Arweave, NEAR and EVM. We are backed by Arweave, LD Capital, Longhash, and more.\n\nOur tech stack mostly consists of JavaScript (Node / Next, React.js) and TailwindCSS. Frontends interface with Solidity, Arweave SmartWeave Contracts / exm.dev, and the NEAR JavaScript SDK.\n\nAbout you\n\nAt decent.land, you will be at work full-time building UIs and JS backends for our protocols that interact with the Arweave / NEAR blockchains. Ideally, we’re looking for a developer who’s comfortable with React, TypeScript, TailwindCSS, and who’s also willing to pick up new libraries and skills along the way. Knowing how blockchains work is a big plus.\n\nSince we’re a distributed team spanning several timezones, it’s crucial to be able to communicate updates and blockers regularly.\n\nThe position is remote, but we need at least a few hours of overlap with European timezones to be able to work effectively.\n\nPayment will be distributed monthly in crypto.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","javascript","blockchain","front","end"]},{"job":"Graphic Designer Americas Binance Accelerator Programme","company":"Binance","location":"Canada","post_date":"3d","link":"https://web3.career/graphic-designer-americas-binance-accelerator-programme-binance/40038","key":"40038","details":"Graphic Designer (Americas) - Binance Accelerator Programme\nCanada /\nMarketing – Marketing /\nIntern\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a Graphic Designer to help develop and define the Binance identity. You will be part of a highly talented team, working to elevate the brand through creative excellence.\n\n\nThis position can be fully remote or can work in one of our offices in the Americas.\nResponsibilities:\nAs part of the Design team, develop and produce artwork and advertising, which reflect the identity of Binance globally; across different products and local markets\nCollaborate closely with the internal design team to ensure brand coherency and consistency across all creative output\nProactively identify emerging design trends, and contribute to robust internal creative conversations\nIdeation of Brand-led campaigns\nRequirements:\nFluency in English is required\nGraphic Design or Design-related field major preferred\nBasic knowledge of layouts, typography, line composition, colour, and other graphic design fundamentals\nClear communication skills - ability to express complex ideas clearly and succinctly, while collaborating closely with teams outside of the Creative group\nExperience with Adobe Photoshop and Illustrator is a must, knowledge of Figma is a plus\nKnowledge and interest in the world of Binance and cryptocurrency is a plus\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech"]},{"job":"Frontend Developer Web3","company":"Brahma.fi","location":"Remote","post_date":"3d","link":"https://web3.career/frontend-developer-web3-brahma-fi/40037","key":"40037","details":"Brahma aims to simplify the interaction users have with DeFi in a self-custodial manner. Brahma also uses off-chain services to make DeFi automation smart, for example for informing risk management processes as well as for order execution and maximizing every DeFi interaction.\n\nWe are looking for a talented Frontend Developer to join our team to work on an engaging new product focused on automation in DeFi.\n\nResponsibilities\n\nArchitecting & building functional and engaging product experiences\nDevelopment and curation of frontend interfaces (webapps primarily)\nIntegration of smart contracts with React interface written in typescript\nCollaboration with product and engineering team on the product roadmap\nWork with designers, product owners and more to bring products to life\n\nQualifications\n\nDeep experience in Typescript, Next.js and React\nExperience in engineering, building and testing high stakes web applications\nExperience in frontend bundling (Webpack) and prototyping\nProficient in GIT and knowledge of pull request based workflows\nStrong communication skills and responsiveness\nKeen interest in Crypto and DeFi\nFluent in written and spoken English\nGreat attention to details\n\nBonus Qualifications\n\nKnowledge of web3 and Ethereum development tools and libraries, such as web3.js and ethers.js.\nFamiliarity with Figma\nHaving build Personal/work projects from the grounds up and having tested them live with users\nExperience with cloud architecture (AWS)\n\nThe number of years of experience does not matter as long as you have built complex projects from scratch, a burning desire to learn more, constantly improve yourself and solving tricky problems on a daily basis. We're a small team so you can assure yourself that whatever you contribute - in terms of engineering, or otherwise - is always heard and discussed.\n\nBenefits\n\nCompetitive salary and token performance-based bonuses\nA fully remote, collaborative and decentralized environment, where your initiatives and ideas count and are rewarded\nLearning from a flat and cross-functional team, you can learn anything around the web3 space as well as hardcore development and quant ecosystem with us\nTransparent governance and progressing together to a DAO-like structure\nA unique open research environment, where everybody contributes and sees the full spectrum of our work, from inception to production and trading\n\nThis role is remote, please share your Github profile and details of previous projects worked on (both commercial and personal).\n\nBrahma.fi focuses on Cryptocurrency, Fin Tech, and Blockchain / Cryptocurrency. Their company has offices in Europe and Asia. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://brahma.fi or find them on Twitter and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","remote","web3js","react"]},{"job":"Cryptocurrency Podcaster","company":"Cointinuum | BRX","location":"United States","post_date":"3d","link":"https://web3.career/cryptocurrency-podcaster-cointinuum-brx/40029","key":"40029","details":"Full Job Description\n\nPLEASE CAREFULLY READ THE ENTIRE JOB POST\n\nCointinuum BRX is looking for high energy, passionate, tech-savvy blockchain/web3 professionals to co-host with its crypto/real estate podcast team. With strong communication skills and charisma, you will be a collaborative, driven, and experienced crypto professional.\n\nWe offer an exciting startup experience with significant performance-based compensation. This is a great opportunity for individuals who are passionate about exploring a career in Blockchain, DeFi and Cryptocurrency.\n\n\n\n\nQualifications\n\n4-5 years of professional experience\nSelf-motivated and entrepreneurial\nStrong communication skills\n\n\n\nAbout us:\n\nCointinuum/BRX is a niche provider of real estate investment services through two innovative blockchain solutions- Cointinuum asset-backed cryptocurrency (token) and the Bit Real Estate Exchange asset tokenization platform. We provide support and services inclusively to real estate investment firms and individuals alike as we seek to democratize real estate investments for all. We know and understand the blockchain environment and we’re highly adept in the real estate sphere. Our 20+ years of experience allow us to quickly grasp the evolving needs of the real estate industry so we can deliver the solutions essential to meet its needs.\n\nQualified applicants will have the opportunity to work in a great company culture and collaborative team environment. The role of co-host will report to the company’s CEO.\n\n\n\n\nResponsibilities:\n\nResearch and create content for podcast, blogs and articles\nRecord videos\nCollaborate with team\nManage blog schedule\nPost content to social media\nOther duties as assigned\n\n\n\nSchedule:\n\nPart-time\n\n\n\nCompensation:\n\nPayments are made in Cointinuum token (CTM) NOT $USD\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["crypto"]},{"job":"Growth Product Manager Matcha","company":"0x Labs","location":"San Francisco","post_date":"3d","link":"https://web3.career/growth-product-manager-matcha-0x/40028","key":"40028","details":"COMPANY\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We’re a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we’ve made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe’re a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We’ll consider your application regardless of where you call home.\n\n\nMATCHA\n\nMatcha is 0x Labs’ first consumer product. It is a meticulously designed decentralized exchange that makes it easy for anyone in the world to access crypto assets on the Ethereum blockchain safely. Powered by the 0x API, we provide users with the best prices by aggregating liquidity from all of the major decentralized exchanges and splitting/routing orders intelligently.\n\nBy focusing on user experience and education, Matcha will onboard the next wave of users into the DeFi ecosystem. As a Product Marketing Manager on the team, you’ll take large and early part in building and scaling this flagship product.\n\n\n\nRESPONSIBILITIES\n\nLead and guide product direction for a cross-functional team of engineers and designers\nDrive a product-led growth culture\nResearch and intimately understand our target users and our product funnel. Translate growth opportunities into short-, medium-, and long-term product roadmaps that will have a direct positive impact on Matcha’s growth\nDesign, run and interpret experiments and A/B tests\nCraft metrics that accurately reflect Matcha’s growth goals\nClearly communicate your team's priorities and product roadmap with leadership stakeholders and drive alignment across multiple teams in scrappy ways\n\n\nREQUIREMENTS\n\n\nAt least 3 years of Growth Product Management experience working with consumer products preferably in crypto, fin-tech startups or gaming\nYou have taken a product from 0 to scale, ideally in consumer tech or fin-tech\nHave a growth mindset and experience using research, experimentation and product analytics to make product changes that improve conversion\nFamiliarity with crypto/web3 and DeFi. Some would say you are a power user\nDeep analytical expertise; you will partner with our data science team, but you should be able to perform basic data analysis/querying skills yourself\nStrong communication and writing skills\nPassion for the benefits of decentralization and the 0x mission\nExhibit our core values: do the right thing, consistently ship, and focus on long-term impact\n\n\n\nBENEFITS\n\nCompetitive salary and equity with occasional cryptocurrency-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA for U.S.-based employees\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nFlexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office conveniently located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco’s Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","product","manager","ethereum","nft"]},{"job":"Product Marketing Manager Matcha","company":"0x Labs","location":"San Francisco","post_date":"3d","link":"https://web3.career/product-marketing-manager-matcha-0x/40027","key":"40027","details":"COMPANY\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We’re a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we’ve made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe’re a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We’ll consider your application regardless of where you call home.\n\n\n\nMATCHA\n\nMatcha is 0x Labs’ first consumer product. It is a meticulously designed decentralized exchange that makes it easy for anyone in the world to access crypto assets on the Ethereum blockchain safely. Powered by the 0x API, we provide users with the best prices by aggregating liquidity from all of the major decentralized exchanges and splitting/routing orders intelligently. By focusing on user experience and education, Matcha will onboard the next wave of users into the DeFi ecosystem. As a Product Marketing Manager on the team, you’ll take large and early part in building and scaling this flagship product.\n\n\nRESPONSIBILITIES\n\nTell the story of Matcha as our team defines the category of decentralized exchange\nCraft a vision and execute the marketing strategy for Matcha\nOwn product marketing initiatives including competitive analysis, customer segmentation, audience insights, messaging and positioning\nBuild and scale Matcha’s portfolio of marketing channels and programs through experiments and optimizations that drive a high return on investment\nManage tracking and reporting on campaign and creative performance to uncover growth and optimization opportunities\nCreate unique and authentic content that drives net-new user acquisition and engagement with Matcha’s brand\nRigorously test hypotheses and use data to drive decisions, including implementing the necessary analytical frameworks and reporting mechanisms to measure and drive success\nCollaborate cross-functionally with other teams, including engineering (internal and external), design, research, data science, product management, executive leadership, and recruiting\n\n\n\nREQUIREMENTS\n\nAt least 3 years of Product Marketing experience working with consumer products preferably in crypto, fintech or gaming\nExperience crafting and executing a holistic cross-channel marketing strategy and familiarity with key channel performance indicators (attribution, LTV, CAC, return on investment, payback periods)\nPassion for the benefits of decentralization and the 0x mission\nExhibit our core values: do the right thing, consistently ship, and focus on long-term impact\n\n\nPREFERRED\n\nStrong quantitative and analytical abilities: you can pull your own data to answer your questions, and develop insights to take action from that data. Experience writing SQL queries and proficiency with data visualization tools (Metabase, MixPanel)\nExperience scaling a content marketing program\nExperience managing of 3rd party agencies and contractors\n\n\n\nBENEFITS\n\nCompetitive salary and equity with occasional cryptocurrency-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA for U.S.-based employees\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nFlexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office conveniently located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco’s Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","ethereum","nft"]},{"job":"Compliance Associate Financial Investigations and Transaction Monitoring","company":"Anchorage Digital","location":"United States","post_date":"3d","link":"https://web3.career/compliance-associate-financial-investigations-and-transaction-monitoring-anchorage/40026","key":"40026","details":"Compliance Associate, Financial Investigations and Transaction Monitoring\nUnited States /\nCompliance /\nFull-Time Remote\n/ Remote\n\nApply for this job\nAt Anchorage Digital we are building the world’s most advanced digital asset platform for institutions to participate in crypto.\n\n\nFounded in 2017, Anchorage Digital is a regulated crypto platform that provides institutions with integrated financial services and infrastructure solutions. With the first federally chartered crypto bank in the US, Anchorage Digital offers institutions an unparalleled combination of secure custody, regulatory compliance, product breadth, and client service. We’re looking to diversify our team with people who are humble, creative, and eager to learn.\n\n\nWe are a remote-first, global team, but provide the option of working in-office in San Francisco, New York City, Indianapolis, Sioux Falls, Porto, and Singapore.\n\n\nThe Compliance Associate for Financial Investigations and Sanctions will be a part of a team building a program from the ground up. This role is crucial in ensuring the quality of execution in the transaction monitoring and financial investigations dispositioning activities, which is key in the Anchorage Digital’s BSA/AML Compliance Framework.\nAs a Compliance Associate, Financial Investigations and Transaction Monitoring, you will:\nDrive the execution of transaction and sanctions alert dispositioning\nAssist the Financial Investigations and Sanctions leads on building out the FIU and Transaction Monitoring programs\nDrive internal discussions with stakeholders to facilitate the relevant FIU/TM projects\nManage the alert dispositioning flows\nYou may be a fit for this role if:\nYou have experience in BSA/AML transactional review and/or sanctions alert dispositioning\nYou have knowledge of BSA/AML and Sanctions regulations\nYou have expertise in using blockchain analytics tools (ChainAnalysis, TRM Labs, etc.) to disposition transaction monitoring alerts, preferably at a bank\nYou demonstrate a passion for building out programs in its early stages, including creation and maintenance of policies, procedures, and new tools\nYou demonstrate a proven track of being able to work independently \nYou possess strong attention to detail\nAlthough not a requirement, bonus points if:\nYou were emotionally moved by the soundtrack to Hamilton, which chronicles the founding of a new financial system. :)\nAbout Anchorage Digital: Who we are\n\n\nThe Anchorage Village, what we call our team, brings together the brightest minds from platform security, financial services, and distributed ledger technology to provide the building blocks that empower institutions to safely participate in  the evolving digital asset ecosystem. As  a diverse team of more than 300 members, we are united in one common goal: building the future of finance by providing the foundation upon which value moves safely in the new global economy. \n\n\nAnchorage Digital is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.\n \nAnchorage Digital is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance","finance"]},{"job":"Brand Designer","company":"Crypto.com","location":"Seoul","post_date":"3d","link":"https://web3.career/brand-designer-crypto/40024","key":"40024","details":"Brand Designer\nSeoul, South Korea /\nMarketing – Brand Marketing /\nFull-time: Hybrid\n/ Remote\n\nApply for this job\nAbout Crypto.com:\n\n\nFounded in 2016, Crypto.com serves more than 50 million customers and is the world's fastest growing global cryptocurrency platform. Our vision is simple: Cryptocurrency in Every Wallet™. Built on a foundation of security, privacy, and compliance, Crypto.com is committed to accelerating the adoption of cryptocurrency through innovation and empowering the next generation of builders, creators, and entrepreneurs to develop a fairer and more equitable digital ecosystem.\n\n\nLearn more at https://crypto.com.\n\n\nAbout the role:\n\n\nAs a Brand Designer you will be a key member of the Brand Marketing Team and will be responsible for bringing creative vision to life in the form of world class visual designs. You'll be joining a team where we conceive, design, and lead the development of high-quality creative work that pushes the Crypto.com brand forward. We are looking for a senior designer who has a talent for transforming complex visual assignments into sophisticated, impactful, memorable design solutions.\n\n\nThe ideal candidate has diamond hands, can spot FUD from a mile away, and doesn’t think HODL is a typo. You’ve been through bull and bear markets, are part of the broader crypto community, and want to play an important role in Crypto.com’s mission to accelerate the world’s transition to cryptocurrency.\nResponsibilities\nWorking closely with the social media manager to maintain the day to day content on multiple social media platforms from static, motion to video.\nFrom ideation to implementation, you will deep-dive into exploring visual executions, and communicate design directions, decisions, and rationale to the team.\nMaintaining a consistent brand look & feel for all visual communications across multiple channels, while proactively evolving the contents all the time.\nDesired skills and experience\nBachelor’s degree in Graphic Design, Graphic Arts, or Fine Arts preferred.\n2+ years of experience working in a creative agency, design studio, or independently.\nExcellent experience with using Adobe Creative Suite and other graphic software.\nA genuine passion for cryptocurrencies and blockchain technology. Working understanding of the crypto asset marketplace including cryptocurrencies, utility tokens, NFT’s, DeFi and GameFi.\nA visual creator at heart with great design aesthetics, an eye for detail, and the ability to captivate an audience visually.\nA strong portfolio showcasing your production skills and the ability to be highly creative.\nAbility to edit video and create motion graphic is a plus\nExperience with photography, illustration, and 3D rendering is an advantage.\nThe ability to work both independently and collaborate as part of a team, handling multiple projects simultaneously.\nA fast learner with a “get things done” attitude.\nAble to react fast. Capacity to thrive in a fast-paced and agile environment.\nDemonstrate strong organizational skills, interpersonal skills and be able to manage conflicting requirements from different stakeholders.\nHumble to embrace better ideas from others, eager to make things better, open to challenges and possibilities\nBenefits\n\n\nWhat you can expect from us?\n\n\nWe offer an attractive compensation package working in a cutting-edge field of Fintech.\n- Huge responsibilities from Day 1. Be the owner of your own learning curve.\n- The possibilities are limitless and depend on you.\n- You get to work in a very dynamic environment and be part of an international team.\n- You will get to have involvement in developing a brand new product from scratch alongside with a talented team.\n\n\n\n\nOnly shortlisted candidates will be contacted with information on the next steps of our application process.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","design","react","nft"]}]}