{"jobs":[{"job":"Affiliate Sales","company":"Afterpay","location":"New York","post_date":"7d","link":"https://web3.career/affiliate-sales-afterpay/39829","key":"39829","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nWe are much more than our job descriptions, but as Afterpay Ads, Affiliate Sales, here’s where you will begin…\n\n\nWork closely with the Afterpay Ads Sales leadership team to assess the current business, develop a deep understanding of the Afterpay Ads product, our advertising partners and competitive landscape\nClose advertising deals with key retail partners that align with Afterpay Ads strategies & business targets\nPartner with cross-functional teams to structure and execute strategic initiatives\nTrack, measure and proactively communicate report to senior management on the portfolio of accounts, focusing on goal attainment and course corrections\nAnalyze, measure and communicate campaign performance to advertising partners\nEnsure that advertising partners receive the highest level of sales and operational customer service\nBuild internal processes to streamline workflows\nDrive success toward KPIs, and exceed revenue targets\n\nQualifications\n\nLike us, you’ll be deeply committed to delivering positive outcomes for our customers and team, and passionate about shaping the future of Afterpay.\n\n4+ years experience in advertising, partnerships and revenue driving teams\nDemonstrated track record of meeting & exceeding KPIs and sales targets\nExcellent communicator with strong interpersonal skills and ability to build relationships within various vertical/industries via email and phone\nExcellent organizational & time management skills\nThrives in fast-paced organizations while producing quality results\nExcels in cross functional collaboration\nUnderstands analytical and quantitative levers used by our merchants\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $74,500 - USD $91,100\n\nZone B: USD $69,300 - USD $84,700\n\nZone C: USD $65,600 - USD $80,200\n\nZone D: USD $63,400 - USD $77,500\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","sales"]},{"job":"Data Privacy Legal Counsel","company":"Binance","location":"Middle East & North Africa","post_date":"7d","link":"https://web3.career/data-privacy-legal-counsel-binance/39827","key":"39827","details":"Data Privacy Legal Counsel\nRemote – Middle East & North Africa /\nLegal & Compliance – Legal /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities\nProvide legal advice on data privacy requirements to support the business globally\nDevelop, implement and review data privacy policies and programmes to ensure data privacy compliance for personal information collection, processing, transfer and disclosure (including the GDPR)\nFacilitate compliance across all aspects of global privacy laws and regulations including data protection, data security and data breach rules\nDraft, review, negotiate and administer legal and commercial documentation, in particular in relation to personal data transfers to third parties and cross-jurisdiction\nActively manage external counsel on contentious and non-contentious privacy-related projects internationally\nContinuously monitor data privacy developments and provide practical advice to the relevant stakeholders\nSupport the development and implementation of legal strategy to reduce risks while balancing against the organization’s overall business strategy\nAssist in negotiation of contracts for different business lines in the ecosystem, and support in a variety of risk management projects\nPartner with cross-functional and regional teams and provide support on legal matters of varying complexity, sensitivity, and tangibility\nProvide general support to the legal team\nRequirements\nQualified lawyer in data privacy with 5-7 years of experience at a reputable global law firm and/or as in-house counsel\nGood knowledge of data privacy laws is essential\nExperience dealing with data privacy laws (including GDPR) a plus\nExperience with developing data privacy policies and processes\nExperience with handling regulatory inquiries, requests for information and investigations\nInterest in the cryptocurrency industry and its development\nMaster of Laws or Juris Doctor degree from a top law school\nStrong team player and good business sense\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["legal"]},{"job":"Affiliate Business Development Manager Philippines","company":"OKX","location":"Manila","post_date":"7d","link":"https://web3.career/affiliate-business-development-manager-philippines-okx/39826","key":"39826","details":"About OKX:\n\nAt OKX, we believe our future is reshaped with technology. Founded in 2017, OKX is one of the world’s leading cryptocurrency spot and derivatives exchanges. OKX innovatively adopted blockchain technology to reshape the financial ecosystem by offering some of the most diverse and sophisticated products, solutions, and trading tools on the market. Trusted by more than 20 million users in over 180 regions globally, OKX strives to provide an engaging platform that empowers every individual to explore the world of crypto. In addition to its world-class DeFi exchange, OKX serves its users with OKX Insights, a research arm that is at the cutting edge of the latest trends in the cryptocurrency industry. With its extensive range of crypto products and services, and unwavering commitment to innovation, OKX vision is a world of financial access backed by blockchain and the power of decentralized finance.\n\nWe invest in our people as much as we invest in the technology. We are united by our engaging culture, here we win as a team, embrace changes, and do the right thing. We are committed to creating a friendly, rewarding and diverse environment to OKers. It doesn’t matter where you come from, here everyone feels valued, respected and has the same opportunities to develop and thrive — we want to bring out the best in you.\n\nWhat you will be doing:\n\nDevelop, manage, and optimize affiliate campaigns; Develop new affiliate network and improve the performance of existing affiliates\nMainly focus on expanding the influencer resources in local market (Philippines), which could bring trading users and income to the platform\nDevise creative ways to identify potential affiliates\nOptimize the strategy of business develop and plan corresponding actions to ensure the conversion rate\nAnalyze user habits and user behavior, and judge the trend of business development\n\nYou’d be a great fit if you have the following skills:\n\nBachelor degree or above\nAffiliate marketing/ business development experience in the Cryptocurrency space\nExperience in building large affiliate networks from start to finish\nExperience with analytical tools and reporting such as Google Analytics and Amplitude\nUnderstanding of fundamental affiliate customer acquisition KPIs and optimization methods to improve performance through data analysis and segmentation\nFluency in local language: Tagalog\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","sales"]},{"job":"Solidity DeFi Engineer","company":"Paraform","location":"United States","post_date":"7d","link":"https://web3.career/solidity-defi-engineer-paraform/39824","key":"39824","details":"it's Global remote job\n\nSolidity engineer with around 3 years of experience in solidity, DeFi. Must know a lot about decentralized finance, like Uniswap, Aave, Compound.\n\nMust know about Openzeppelin contract, ERC20 token, ERC721, upgradeability, and DAO's (on-chain and off-chain)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","defi","solidity"]},{"job":"Data Engineer II","company":"RECUR","location":"Boston","post_date":"7d","link":"https://web3.career/data-engineer-ii-recur/39823","key":"39823","details":"RECUR needs a Data Engineer II to join our team full time. This is an exciting opportunity to join a fast-growing organization, where you will be designing and building data pipelines for analytics, forecasting and finance activities.\n\nWhat do we at RECUR believe makes a great engineering team?\nHere are our core beliefs:\nIt’s important to have team members that care about the team’s results more than their own individual achievements\nIt’s important for leadership to be tolerant of making mistakes\nIt’s important that the team members help, teach, and mentor one another\nIt’s important not to place blame on individuals when things go bad but instead to evaluate as a team how we do it better the next time\nIt’s important to be clear on what that mission is and minimize the distractions on the teams executing on that mission\nSmall teams execute better than big ones, empower small teams with ownership and minimize the dependencies between them\nIt’s important to encourage self-directed innovation\n\nWhat you will do at RECUR\n\nCollaborate with a distributed team of developers and business stakeholders on a wide variety of data engineering, data integration and business intelligence projects.\nDevelop and maintain data pipelines and integrations using AWS cloud services and best-in-class tools from the modern data stack.\nDevelop high quality and maintainable software.\nTest your code using modern automated testing frameworks and practices.\n“Own” your code throughout the full product life cycle, including production deployment and support, including participation in on-call rotations and critical issue escalations.\n\nWhat you will bring to RECUR\n\nYou have experience developing data pipelines, data-integrations and/or other data-centric applications.\nYou have working SQL knowledge and practical experience with relational databases and concepts.\nYou have familiarity with cloud-based databases such as Redshift, Snowflake or BigQuery.\nBigQuery.\nYou have familiarity with modern ETL/ELT, BI and data orchestration tools and techniques. We use Fivetran, DBT and Looker, but experience with other similar tools is valuable too.\nYou are comfortable with applying SDLC process concepts to data pipelines and infrastructure, such as source-control, automated testing, CICD, promotion through multiple environments, etc.\nYou have a passion for leveraging the latest technologies and innovations while still following a rigorous software development life cycle.\nYou learn quickly, are flexible, and do whatever it takes for the team to be successful\nYou have an interest in blockchain, cryptocurrency, and NFTs\nYou are legally eligible to work in the United States or Canada.\nAdditional Details\nThe base salary range for this position is $110,000-140,000. In addition to base salary, this position will be eligible for an annual bonus and is eligible to participate in RECUR’s equity program. The pay ratio between base pay and target incentive (if applicable) will be finalized at the offer. Keep in mind we are open to varying levels of experience which can impact total compensation. Even if you don’t meet all the requirements, we encourage you to apply!\nCommitment to being a remote-first company & embracing remote work best practices\nComprehensive insurance plans - health, dental, and vision + disability and life Insurance\n401(k) with 2% company matching, no waiting period\nFlexible Spending Account and Dependent Care Accounts\n4 weeks paid vacation, 11 company holidays, 3 floating holidays\nParental Leave - Primary & Secondary\n$100 per month stipend for internet & cell phone\nLearning and development reimbursement (including online courses, certifications, conferences, seminars, etc.)\nFree monthly subscription to Headspace, Gympass, Omada\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["data","science","dev"]},{"job":"Clearing Analyst","company":"Binance","location":"Manama","post_date":"7d","link":"https://web3.career/clearing-analyst-binance/39822","key":"39822","details":"Clearing Analyst\nHybrid – Bahrain, Manama /\nFinance & Administration – Finance & Administration /\nFull-time Onsite\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities:\nResponsible for tracking and processing the status of system deposit and withdrawal transactions\nConduct daily reconciliations and reporting of the system deposit and withdrawal of fiat and crypto funds, and according to any banking details\nManage various fund transfer requirements based on the trading needs, and across various platforms and banks\nCoordinate with various internal stakeholders on fund transfer related requirements. Internal stakeholders include Treasury, Finance, and Trading operations, etc\nParticipate on ad-hoc tasks when needed, and take the lead on any clearing-related functional requirements.\nRequirements:\nBachelor degree or above, accounting, finance, economics and other related majors\n4+ years of related working experience in the financial industry\nWorking experience in the trading markets, third-party payments, or clearing and settlement positions in commercial banks is preferred\nHave a keen sense of risk and a good ability to identify risks\nHave good logic analysis ability, communication, and expression skills\nFamiliar with Internet finance and traditional financial services\nHigh work commitment, energetic, innovative spirit, strong pressure resistance, strong sense of responsibility and teamwork awareness\nExcellent communication skills, and ability to work effectively with a global team across 3 continents\nUnderstanding of Crypto / Blockchain is a plus.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst"]},{"job":"Web3 Sourcer","company":"Binance","location":"Canada","post_date":"7d","link":"https://web3.career/web3-sourcer-binance/39821","key":"39821","details":"Web3 Sourcer\nRemote – Canada /\nHR – Talent Acquisition /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe have an exciting opportunity for a Web3 Sourcer to join our team here at Binance. This is a dynamic role to join our Talent Acquisition team; you'll be responsible for owning the pipeline of candidates for various roles and levels of complexity on a global scale. You’ll be a key member of the recruitment team with a focus on delivering exceptional sourcing methods and ensure a great candidate experience.\n\nThe key responsibilities for this role include:\nTake full ownership in how you achieve your top of funnel metrics, pipeline conversion percentages and hires to help the team achieve our collective hiring goals.\nIdentify, engage, activate and nurture top talent through traditional techniques and unconventional methods.\nBe an advocate for a sourcing driven recruiting culture at Binance.\nDeliver a diverse and qualified candidate pool that reflects our business.\nDevelop a deep understanding of our talent segments to proactively build long-term pipelines across multiple business areas in some of the most competitive markets in the world.\nProactively identify and implement new methods to improve sourcing efficiency and effectiveness.\nBe a trusted partner by developing relationships with your recruiting partners and hiring managers by presenting sourcing insights to ensure hiring success.\nBuild-up world class, scalable sourcing strategies that deliver an 'always-on' pipeline of quality hires.\nBuild our market intelligence by running benchmarking, market mapping initiatives and knowledge sharing initiatives.\nManage our existing sourcing tools and implement new ones\nTo be considered for this role, ideally you'll have\nA proven track record in sourcing and/or recruiting top technical talent in a high growth environment.\nExperience of working in the crypto space and/or having a good understanding of Web3 in general.\nDemonstrative ability in traditional sourcing techniques utilized for sourcing top talent across multiple areas of the business.\nPractical experience of implementing sourcing strategies that address both short-term and long-term hiring needs.\nKnowledgeable in advanced sourcing tools and techniques utilized for recruiting top talent.\nAbility to build, cultivate, and activate relationships with candidates and business leads.\nProven experience of testing new sourcing techniques, tools and approaches that drive results.\nExperience partnering with cross-functional partners to execute on sourcing strategies that result in achieving common goals.\nYou have an extensive talent network and a detailed understanding of various talent pools across multiple geographical regions.\nYou are a confident communicator, able to pitch to candidates, and influence recruiters and people on various levels within the organization.\nYou are good with tooling and make data driven decisions by running reports,building dashboards and implementing new systems\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["recruiter","non-tech"]},{"job":"Crypto Research Analyst","company":"Tribal","location":"San Francisco","post_date":"7d","link":"https://web3.career/crypto-research-analyst-tribal/39820","key":"39820","details":"Overview\n\nAre you ready to join an agile, diverse, and global team of innovators in redefining the B2B payment space for startups and SMEs in emerging markets? Tribal Credit is built for companies looking for a better way to pay business expenses and optimize their financial management. We provide modern payment methods like multi-currency physical and virtual business Visa cards and a powerful spend management platform to track and control expenses—all in one seamless interface.\n\nOur founders are serial entrepreneurs who have launched startups both in emerging markets and the U.S. We're backed by leading international investors, including SoftBank, QED Investors, BECO Capital, Global Ventures, Endeavor Catalyst, Endure Capital, and OTG Ventures . We're also part of the Visa Fintech Fast Track program among an elite group of fintechs.\n\nThis position is 100% remote, based in the United States, and will report to the Senior Crypto Research Analyst.\n\nAs a Crypto Research Analyst, you will…\n\n\nResearch, evaluate, and analyze crypto protocols and projects to identify trends that represent potential new crypto direction\nDevelop and deliver targeted market research, fundamental analysis, and forward-looking strategic plans\nActively seek out and investigate new information and sources to stay on top of industry trends\nCommunicate and present data-driven recommendations to leadership\nActively engage with the Tribal's crypto ecosystem to build relationships and develop a deep understanding of the needs and priorities\nCoordinate Tribal participation in external events (e.g., conferences, webinars) and/or Tribal-hosted events. This could include such responsibilities as preparing speaker applications or talking points for senior Tribal leadership.\nHelp manage community initiatives to educate and grow users and network participants\nHelp refine Tribal's crypto vision as the space continues to evolve.\n\n\nWho You Are\n\n2+ years of experience in a crypto role as an analyst or associate, or other associated roles such as investment banking, consulting, or finance\nDeep interest in the cryptocurrency markets\nIn-depth knowledge of existing crypto projects, emerging trends, and new technologies\nStrong analytical, problem solving, and writing and verbal communication skills\nAgile, flexible, and responsive approach to work.\nBachelor's degree in Engineering, Computer Science, Finance, Business or related area of study\nIntermediate proficiency (or better) with Microsoft Excel is required\nExperience with R and Python is helpful but not essential.\nStrong presence and engagement with the crypto community is a plus.\nFluency in English is required; knowledge of other languages (Spanish, Portuguese, or Arabic) is helpful.\n\n\nBenefits\n\n100% employer paid healthcare insurance for team members and family.\nEmployer paid life insurance.\nEmployer paid post-tax short-term and long-term disability.\nUnlimited time off and all public holidays.\nAllowance for home office equipment.\nHighly supportive team culture.\n100% remote, flexible work environment.\nMarket-competitive salaries.\nTop-notch project management, productivity, and team engagement tools.\nUnlimited learning resources, and much more.\n\n\nOur Values\n\nPassionate about creating value: We experiment with new possibilities, to effect positive change for the world around us.\nDevoted to high standards: We don't merely do the work, we strive for excellence, precision, and mastery at what we do.\nProactively learning and growing: We're curious and passionate about learning and growing.\nHuman-centered: We put people's welfare at the center of everything we do.\nCandid, open, connected: We work in perfect sync powered by open, continuous communication and feedback.\n\n\nEqual Employment Opportunity & Privacy Statement\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, gender, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nClick here to learn about our Tribal Privacy Policy and #JoinTheTribe\n\nLearn more about Tribal at www.tribal.credit\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","analyst","crypto"]},{"job":"Compliance Manager MLRO Argentina","company":"Binance","location":"Buenos Aires","post_date":"7d","link":"https://web3.career/compliance-manager-mlro-argentina-binance/39819","key":"39819","details":"Compliance Manager/MLRO - Argentina\nRemote – Argentina, Buenos Aires /\nLegal & Compliance – Compliance /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\n\n\nResponsibilities\nDevelopment and management of Argentina's compliance policies and processes\nEnsure ongoing monitoring and reporting\nCoordinating various foreign regulatory filings\nFocusing on internal compliance policy review, including ongoing assessments, assisting with compliance review, internal audit reviews and ongoing or ad hoc reviews\nAssisting in the development of training materials\nProviding statistics on monitoring completion as needed\nMaking recommendations for enhancing the firm’s systems, controls and processes\nManaging monitoring registers and other records necessary to evidence efforts\nAssisting with maintaining overall compliance with the requirements and obligations prescribed by COAF (Council for Financial Activities Control), authorities and other relevant authorities\nRequirements\nProven interest and/or experience in the fintech sector\nMinimum of 10 years experience in a risk, fraud, compliance, AML or regulatory function, experience working with any regulated financial services business in legal or compliance roles preferred\nProfessional certification in compliance risk management\nAbility to work independently in a fast-paced, global organization maintaining close contact with relevant teams across multiple locations\nExcellent problem solving skills and ability to provide useful and efficient counsel\nGood understanding in performing risk assessments, periodic/trigger reviews and enhanced due diligence\nProficiency in compliance applications and programmes\nTo carry out the necessary studies to ensure compliance with the regulations issued and to provide necessary communication and coordination with FIU\nProactive, diligent team player \nAn advanced English level is a mandatory\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance"]},{"job":"Compliance Risk Officer","company":"Binance","location":"Manama","post_date":"7d","link":"https://web3.career/compliance-risk-officer-binance/39818","key":"39818","details":"Compliance & Risk Officer\nHybrid – Bahrain, Manama /\nLegal & Compliance – Compliance /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking to hire a Compliance & Risk Officer to support a newly established business unit. The Compliance & Risk Officer will have the opportunity to build the Compliance & Risk Function of the business to the highest standard as per the business needs and regulatory requirements. The Compliance & Risk Officer will work closely with various internal stakeholders, and be part of a high-growth business unit.\nResponsibilities:\nSupport the country licensing application processes by delivering completed compliance policies and procedures, and defending them to the regulator. Support responds to regulator questions and requests for information\nResponsible for maintaining and updating as needed all compliance policies and manuals, and notification to the business of any regulatory changes\nAct as a central point of contact for all information on compliance-related issues\nAssisting in all compliance and regulatory matters with local and international regulatory bodies\nPreparing regular reports and strategic direction to senior management regarding compliance matters\nWorking with in-house and external advisories to monitor, and then implement responses to regulatory developments that impact the businesses\nCollaborating with other internal stakeholders on special compliance projects as necessary\nPerform other assignments as the senior management and the Board of Directors may direct.\nRequirements:\n8+ years of compliance experience with a reputable multinational company, preferably in the fintech or financial service sector\nStrong understanding of local regulations and compliance requirements\nGood understanding of the capital markets, trading markets, FX asset class, and liquidity provision activities\nEntrepreneurial, innovative and strong ability to adapt to a fast-paced and constantly evolving regulatory environment\nExcellent communication skills, and ability to work effectively with a global team across 3 continents\nCrypto knowledge will be a plus.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance"]},{"job":"Growth Operations Intern BNB Chain","company":"Binance","location":"Remote","post_date":"7d","link":"https://web3.career/growth-operations-intern-bnb-chain-binance/39817","key":"39817","details":"Growth Operations Intern (BNB Chain)\nRemote – Global /\nMarketing – Marketing /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nYou will be part of BNB Chain’s Ecosystem Growth Operations team and working on growth initiatives to bring the next billion users into Web3! We are looking for someone with a creative spark to design initiatives/campaigns that will hook users, draw them in and walk them down the Web3 rabbit hole. Ideas alone are not enough, you must be willing to get your hands dirty to test, learn and scale these initiatives as we embark on an accelerated ‘user growth’ journey.\nResponsibilities:\nWork directly with Ecosystem Growth Ops team in executing growth strategies.\nCrunch numbers to analyse trends and customers to make data driven decisions.\nConduct market research and analyse data to pinpoint new businesses, key customers and market opportunities.\nUnderstand the needs and expectations of customer groups, ideate and execute tailored strategies to drive adoption of product and establish positive long-term relationships.\nWork cross-functionally across product marketing, tech, growth and sales.\nAssist in organising online and offline events and meet-ups.\nRequirements:\nSelf-starter with a bias for action to get things done, and isn’t discouraged by failure or mistakes.\nExcellent oral and written communication competency, comfortable with negotiations and interacting with top decision makers.\nMeticulous, logical and able to crunch numbers.\nFast learner who can adapt quickly to changes and work both independently and collaboratively.\nExperience in start-ups, or in a business development / account management role (ideally in tech or e-commerce) is a plus.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","intern","entry","level","operations"]},{"job":"Business Development Manager Custody","company":"Binance","location":"Zurich","post_date":"7d","link":"https://web3.career/business-development-manager-custody-binance/39816","key":"39816","details":"Business Development Manager - Custody\nRemote – Switzerland, Zurich /\nBusiness Development – Business Development /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nBinance is looking for an experienced business development professional with a strong understanding of the crypto custody industry to spearhead our growth in this space. This role will leverage relationship development, existing networks, and understanding of the institutional crypto custody space in order to introduce and inspire new investment into the world of cryptocurrency from major institutional clients from a global market.\nResponsibilities\nAcquire, develop, and maintain relationships with institutional clients (Web3 partners, Defi, Layer 1, HNWIs, private banks, HFs, VCs, etc.) globally for Binance custody \nIdentifying prospective clients and proposing the relevant service lines according to their perceived operations\nNurture existing deals with VIP and institutional teams\nEngage with project teams and crypto native institutions to generate leads and new business opportunities for Binance custody\nOriginate new institutional clients and manage the entire business partner’s lifecycle from prospecting, to deal negotiation, closing, including renewals and upsales\nUnderstand the challenges of partners and assess the activities of our competitors to proactively satisfy and retain the partnership\nProvide thought leadership for Binance, with a customer-focused, regulatory-awareness attitude\nRequirements\nWorking experience in crypto custody industry\nExperience in custody, banking, or Prime Brokerage and Settlement Services.\nSkilled in prospecting techniques\nKnowledge and passion for the crypto/blockchain industry\nSelf-driven, results focused individual who can work with minimal supervision\nExcellent oral and written communication skills\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Head of Asia","company":"Composable Finance","location":"United States","post_date":"7d","link":"https://web3.career/head-of-asia-composablefinance/39815","key":"39815","details":"Your mission\nComposable Finance is seeking a passionate Business Development (BD) and Growth expert in the Web3/Crypto space to become a key part of our journey in Asia as Partnership Director as we continue to expand globally. The ultimate goal of this role is to lead the charge in growing out Composable Finance’s overall presence and marketing across Asia. Specifically, the Head of Asia - Partnership Director role will work closely with Developer Relations (Dev Rel) and other key teams within our organization to conduct industry research and subsequently provide tailored marketing, outreach, and services to developers and users within Asia.\nYour profile\nResponsibilities:\n\n\n\n\nConduct market research on the state of the DeFi market in Asia in order to understand current options/opportunities, shortcomings, and user needs and tendencies within the region.\nThis includes analyzing other companies and how they are able to create branding and outreach initiatives to promote Growth and Strategic Partnerships in Asia.\nExample: Understand the growth and development of Cardano in Asia, and analyze BD/Growth strategies used for successful expansion.\n\nTailor marketing tactics to specific interests, needs, and media channels of the region, based on the aforementioned market research.\nThis includes written content (blogs, social media posts), video content, and in-person content such as participating in or even hosting events/conferences within the region.\n\nConduct developer interviews to understand unique developer needs in this region, working closely with Developer Relations.\nDevelop innovative outreach strategies for key partnerships in the space, again working with Developer Relations and leveraging the aforementioned market and developer research.\nDevelop an in-depth overall BD strategy for Composable Finance’s products and tokens, leveraging key industry players within Asia.\nManage business development with a primary focus on driving integrations with the Composable Ecosystem. This includes:\nOverseeing technical integrations, synchronizing with the Head of Strategy and Head of Product.\nOverseeing the growth of Composable’s Business Development team within Asia.\nOverseeing relationships with various Asia-based venture studios that can be coached by Composable to utilize our technical stack.\nOverseeing relationships with various Asia-based TradFi organizations - both for our Ecosystem Fund and for eventually utilizing our Cross-Chain Virtual Machine (XCVM).\nDeveloping and maintaining key partnerships with developers, infrastructure, and tooling partners, working together with the Head of Product to generate business development opportunities.\nPitch projects developed by Composable Finance to investors and other stakeholders.\n\n\n\nRequirements:\n\nStrong understanding of the DeFi space and blockchain technology.\nExperience in a similar Business Development/Growth Role.\nExcellent written and oral communication skills in both English and Mandarin.\nAbility to confidently moderate/facilitate discussions among technical and non-technical groups.\n\n\nPreferred Experience:\n\nExperience working directly within blockchain/crypto spaces.\nStart-up mentality, with a hands-on approach and willingness to go above and beyond.\nInterested in the Polkadot Ecosystem.\n\n\nWhy us?\nPerks:\n\nCompetitive Crypto payments, all made in USDC.\n100% remote work. No geographic restrictions.\nAn entrepreneurial environment that encourages innovation and facilitates the growth of cutting-edge technology.\nThe ability to work as an independent contractor: We treat you as your own agent and support you accordingly!\nAnnual Working Equipment Allowance.\nMonthly Gym & Fitness Bonus\nPaid Absence Days\nAnnual personal development funding to facilitate career development\n\n\nDiversity & Inclusion: A company commitment to equal opportunity. We do not condone discrimination on the premise of race, color, religion, sexual orientation, age, gender identity or expression.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","ai"]},{"job":"Senior Growth Manager Custody","company":"Binance","location":"Hong Kong","post_date":"7d","link":"https://web3.career/senior-growth-manager-custody-binance/39814","key":"39814","details":"Senior Growth Manager - Custody\nHybrid – Hong Kong /\nBusiness Development – Business Development /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nBinance is looking for an experienced sales or business development professional with a strong understanding of the crypto industry to spearhead our growth in this space.\n\n\nThis role will leverage relationship development, existing networks, and understanding of the institutional crypto space in order to educate, introduce, and inspire new investment into the world of cryptocurrency from major institutional clients and high-net-worth individuals from a global market.\nResponsibilities\nAcquire, develop, and maintain relationships with institutional clients (HNWIs, private banks, HFs, VCs, etc.) globally\nEngage with project teams and crypto native institutions to generate leads and new business opportunities\nOriginate new institutional clients and manage the entire sales lifecycle from prospecting, to deal negotiation, closing, including renewals and upsales\nCollaborate with cross-functional teams to ensure high standards of customer service\nUnderstand the challenges of our clients and assess the activities of our competitors to proactively satisfy and retain our clients\nProvide thought leadership for Binance, with a customer-focused, regulatory-awareness attitude\nIdentify new business opportunities in the crypto industry especially within crypto wallet/ custody/ crypto prime services\nEducate new and existing clients on the exciting world of cryptocurrency\nRequirements:\nCustodian sales experience within crypto sector\nStrong sales track records\nSkilled in prospecting techniques\nKnowledge and passion for the crypto/blockchain industry\nExcellent oral and written communication skills\n\n\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","senior"]},{"job":"System Administration Specialist","company":"Binance","location":"Singapore","post_date":"7d","link":"https://web3.career/system-administration-specialist-binance/39813","key":"39813","details":"System Administration Specialist\nHybrid – Singapore /\nFinance & Administration – Finance & Administration /\nFull-time Onsite\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities\nResponsible for the maintenance, configuration, and reliable operation of the approval systems\nTroubleshoot errors by running diagnostics, documenting problems and resolutions, prioritizing problems, and assessing impact of issues\nProvide documentation and technical specifications to IT staff for planning and implementing new or upgrades of the system\nLead help desk support efforts, making sure all problems are resolved in a timely manner with limited disruptions\nRequirements\nBachelor’s degree required\n3-5 years of system administration experience\nExperience with scripting and automation tools\nA proven track record of developing and implementing IT strategy and plans\nFluent writing and speaking in English and Mandarin, for efficient collaboration with various stakeholders across the company\nA team player, able to work under pressure\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":[""]},{"job":"Senior Software Engineer C++","company":"Applied Blockchain","location":"United Kingdom","post_date":"7d","link":"https://web3.career/senior-software-engineer-c-appliedblockchain/39812","key":"39812","details":"Applied Blockchain is an innovative applications development company, focusing on distributed ledger technology and advanced cryptography. Based in London at Level 39, One Canada Square, Canary Wharf and in Batalha, Porto, Applied Blockchain has an expert team of developers creating cutting-edge solutions for disruptive startups and corporate clients in banking and finance, e-payments, energy trading, aviation, telecommunications and social impact sectors. We are also developing the next generation of blockchain solutions. These include Silent Data, a privacy-preserving data oracle for off-chain data, and London Bridge, a hardware-secured bridge between Algorand, Ethereum, and other EVM chains for cross-chain asset transfers.\n\n\n\n\nWhat you’ll be doing\n\n\nContributing to a C++ and TypeScript codebase on our Silent Data product (with your focus being on the C++)\nDesigning and implementing new features for a rapidly evolving cutting edge product as part of a small agile team\nTaking ownership of the product along with the rest of the team\nTaking on some technical leadership responsibilities to help drive the direction of the product\n4+ years of C++ development experience\nGood understanding of Linux/UNIX\nExperience with container based architectures (we use docker and kubernetes)\nExperience with Git\nExperience with SQL Databases (we use postgres)\nSoftware design and architecture skills\nBlockchain knowledge (ideally Ethereum and Algorand) or cryptography knowledge\n\nNice to have:\n\n\nWeb development experience\nTypeScript experience (part of the product includes a React frontend and Node.js backend)\nExperience working with confidential computing (Intel SGX)\nKnowledge of HTTPS and gRPC protocols\nExperience leading a team\n“Hybrid Flex Work” (you decide, every week, if you want to work full remote, hybrid, or physically in our office)\n£1000 euros annual allowance for Training (up to 50% of this value can be used for you to buy work station equipment to work from home).\n5 days/per year for Training.\nIn-person fun team events/team buildings every 3 months.\nCompany equipment and Onboarding kit.\nAnnual Bonus (dependant on company and personal performance).\nStock Option Plan.\nPaid subscription of a mental health support app.\nBirthday Off.\nAmazing referral programme.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["c","c","plus","plus","dev","senior","react"]},{"job":"Afterpay Sales","company":"Afterpay","location":"New York","post_date":"7d","link":"https://web3.career/afterpay-sales-afterpay/39811","key":"39811","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nWe are much more than our job descriptions, but as Afterpay Ads, Affiliate Sales, here’s where you will begin…\n\n\nWork closely with the Afterpay Ads Sales leadership team to assess the current business, develop a deep understanding of the Afterpay Ads product, our advertising partners and competitive landscape\nClose advertising deals with key retail partners that align with Afterpay Ads strategies & business targets\nPartner with cross-functional teams to structure and execute strategic initiatives\nTrack, measure and proactively communicate report to senior management on the portfolio of accounts, focusing on goal attainment and course corrections\nAnalyze, measure and communicate campaign performance to advertising partners\nEnsure that advertising partners receive the highest level of sales and operational customer service\nBuild internal processes to streamline workflows\nDrive success toward KPIs, and exceed revenue targets\n\nQualifications\n\nLike us, you’ll be deeply committed to delivering positive outcomes for our customers and team, and passionate about shaping the future of Afterpay.\n\n4+ years experience in advertising, partnerships and revenue driving teams\nDemonstrated track record of meeting & exceeding KPIs and sales targets\nExcellent communicator with strong interpersonal skills and ability to build relationships within various vertical/industries via email and phone\nExcellent organizational & time management skills\nThrives in fast-paced organizations while producing quality results\nExcels in cross functional collaboration\nUnderstands analytical and quantitative levers used by our merchants\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $74,500 - USD $91,100\n\nZone B: USD $69,300 - USD $84,700\n\nZone C: USD $65,600 - USD $80,200\n\nZone D: USD $63,400 - USD $77,500\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Head of Growth Fully Remote","company":"Rook","location":"New York","post_date":"7d","link":"https://web3.career/head-of-growth-fully-remote-rook/39810","key":"39810","details":"Compensation: 325k-426k\nThe opportunity\nWe are looking for a Head of Growth to establish our suite of protocols and products as key infrastructural components in Decentralized Finance (DeFi).\nIf you are an exceptional contributor with an exemplary reputation and high ambitions, this is a unique opportunity for you to advance your career, achieve financial independency, and bring forth meaningful financial innovation into the world. This can be a career defining position.\nAs our new Head of Growth you can step in and take command of growth at a project that is set up and primed for expansion. We have a working suite of innovative protocols and products that are ready for growth.\nHow innovative? As an example, with us you can trade stablecoins (e.g. USDC) and get paid to do so. For instance, you can swap $1,000 and get $1,010. Not through inflationary tokenomics or sleight of hand, but through money made from your transaction. Think Citadel Securities, except the user receives virtually all of the value that was created as a result of their transaction. This radically efficient, positive sum value exchange technology has the potential to transform all of finance for the better. And it needs an expert Head of Growth to help grow it. And that’s where you come in.\nFrom day one, at your disposal there’ll be a team of highly talented contributors working on marketing, creative, branding, sales and community management, to orchestrate as you see fit. You’ll also interact directly with our CEO, CTO and Head of product, some of the most brilliant people in Web3.\nThis is a challenging, high-impact, full-time role with highly competitive compensation.\nWhat you’ll achieve\n\n\nEstablish our protocols and products as cornerstone DeFi infrastructure\nHelp implement a culture of product-led growth throughout the organization\nTake ownership for improving the entire customer and client lifecycle for our suite of products and protocols\nBuild systems for repeatable growth for our ecosystem\nMake sure Rook is top-of-mind when it comes to all things MEV\n\nWhat you’ll bring\n\nWe exclusively hire contributors who firmly meet our criteria of eligibility\nA track record of excellence and a sterling reputation\nExcellent verbal and written communication skills. You should be able to concisely and convincingly express your ideas both in writing and through speech.\nInterest in Web3 is a must\nDemonstrable expertise in growing a software B2B and B2C growth is required\nExperience in fintech preferred, but not required. We can teach you finance, but we can’t teach you how to be a Head of Growth.\nExperience in web3 is not required\nYou should be a hands-on leader, not a people manager. For where our organization is right now, we don’t (yet) need an executive, but a doer that possesses a high degree of ownership, responsibility and entrepreneurial spirit. We need equal parts strategizing and leadership as we need hustle and elbow grease.\nConvincingly communicate data-driven (both quantitative and qualitative) protocol and product user and prospect needs to the product and protocol teams.\nEvangelize a culture of speed and experimentation for all our growth efforts.\nStrategy: Build and communicate a comprehensive growth marketing plan across the organization\nResearch: Analyze our current acquisition and retention strategies, research competitors and talk to our customers and users to help inform your strategy.\nAcquisition: Be responsible for developing profitable customer acquisition channels\nConversion: Own and improve how we convert our prospects into customers. Working closely with sales and the Product Team, you'll identify, test and roll out product and protocol improvements\nRetention: Ensure our customers get to their 'AHA' moment quicker, churn is kept low and LTV is increased.\nStakeholder Management: Since we’re a multisided platform, you’ll work with a variety of stakeholders across our ecosystem and make sure plans and projects are communicated accordingly.\nGiven the need to talk to users and (prospective) partnerships, this is not an anon-friendly role. To gain the trust of people, it helps to show your face.\n\nWhat working at Rook is like\nWorking at Rook offers you the chance to work with the best, develop subject matter mastery, design your own work-life balance, create original products and research, operate in a work organization with great amounts of autonomy and freedom, advance the state of the art, and provide meaningful change to the world of finance.\nThe Rook Labs team consists of world-class contributors with deep experience in blockchain automation, MEV, trading, and financial systems. We’re a remote team of over thirty contributors with alumni from Google, Wikimedia, NASA, UBS, Citadel, Gemini, Apple, Shopify, Automattic, Oxford, Harvard, Princeton, and Imperial College London.\nWhat we’ll provide you\n\nWork with the best and learn from the best: Working at Rook Labs means you work exclusively with highly talented and highly professional individuals. There’s no room for adequacy, because few things are more cumbersome to you doing your best work than having to fix the mistakes of colleagues.\nRemote: We’re a remote team that’s distributed over US and European time zones. We also get together a few times per year, at major web3 conferences or our annual offsite.\nWork, how you want it: We let you work flexible hours so you can design your ideal workday schedule. And with our unlimited PTO policy, you decide on your vacation schedule, and take time off when you need it. No monitoring via timeclock. No cameras pointed at you. No pressure sensors in your chairs.\nGuided Autonomy: Contributors at Rook are trusted and respected to do their best work without micro-management. We believe in people over process, and provide context instead of rules. This allows contributors very high levels of autonomy and candor, leading to a workplace of fervent collaboration and innovation.\nThe best workplace in Web3: We’re committed to building the best possible workplace in all of web3. To accomplish that, we’ve assembled a team of operational experts to accomplish just that.\nStellar compensation: We believe that our contributors are our key to success. Therefore, we offer exceptional terms and higher total compensation than big tech and traditional finance, with in-built mechanisms to expose you to the future success of our protocol.\nMake a dent: We’re reimagining finance, and your work can make a meaningful impact in helping us shape a better, more open, inclusive and fairer financial system.\nA growth person’s dream environment: A great, innovative, useful and working product suite, ready to be marketed by you, with the resources you need to get it done at your disposal. And our products have true, sustainable network effects: they get more efficient and more performant the more they’re used.\nFinancial security: We’ve got a well-stocked treasury with >5 years of runway at our current burn rate\n\nAbout Rook\nThe purpose of Rook is to make value exchange as beneficial as possible for users and protocols. We believe that the value created by a transaction - the maximum possible amount of value created as a result of that transaction - belongs to those that own the assets: the buyer and the seller.\nThat’s why we have built the Rook protocol: An open, equitable, and distributed MEV marketplace that captures and hands back the value to those who have the right to it.\nThis marketplace provides the fundamental architecture to allow DeFi to fulfill its promise of building a financial infrastructure that can outcompete TradFi, while maintaining the fair, inclusive, and user-centric ethos of DeFi.\nLearn more about Rook\nFurther Listening\n\nhttps://www.rookbase.xyz/pooltogether-podcast-with-hazard/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","remote","marketing","non-tech"]},{"job":"Senior Strategic Partner Manager","company":"Ripple","location":"Miami","post_date":"7d","link":"https://web3.career/senior-strategic-partner-manager-ripple/39809","key":"39809","details":"As a Senior Strategic Partner Manager on the RippleX Partner Relations team you work with valued partners to foster innovation, adoption and impact within the XRP ledger ecosystem.\nYou will work directly with a portfolio of partners innovating in the areas of blockchain, de-fi, and tokenization. You will develop a deep understanding of each partner’s organization, culture, internal constituents, aspirations, and needs to build highly impactful relationships with key executives and decision-makers to ensure achievement of mutual objectives.\nYou will develop and execute strategic account plans for each partner. You will work with the larger Partner Relations team to establish procedures that drive operational excellence in support of the strategic account plans. You will oversee partner-facing activities between partners and other Ripple stakeholders including, Marketing, Product Management, Business Development and others\nBringing together your experience with high-level relationships, technology and finance domains, and strategic execution you will help Ripple and its partners drive the next wave of innovation on the XRP ledger!\nWhat You’ll Do\n\n\nEvaluate and manage new strategic partnerships, alliances and/or joint ventures.\nProvide leadership in the planning, designing, due diligence, and implementation of strategic account plan\nProactively drives results by overcoming barriers and making sound decisions based on thoughtful, balanced consideration of customer/partner objectives, Ripple objectives, and by soliciting clear input from key stakeholders\nBreak down project objectives into appropriate and manageable tasks and milestones, assemble and guide both internal and external resources on execution and progress of the work\nAdvise and guide partners to achieve the desired and agreed on outcomes.\nTravel to customer and partner locations (20-30%)\n\nWhat We’re Looking For\n\n5-10 years of experience supporting partners and/or customers in the areas of software/technology, financial services/technology or blockchain/cryptocurrency\nProven experience in business and strategic development\nAbility to effectively interact with the C-suite, founders and leaders\nDemonstrable understanding of multi-stakeholder management in complex environments\nExcellent team-working and interpersonal skills, able to build trust and confidence among customers, suppliers, partners and colleagues\nExperience in development and launch of modern, complex business solutions involving innovative technology and B2B relationships\nA strong sense of ownership, and empathetic attitude that “the customers’ problem is my problem”\nOut-of-the-box thinker, client advocate - a doer, not a just a thinker\n\nWho We Are\nRipple is doing for value what the internet did for information: enabling its instant and seamless flow around the world. We call this the Internet of Value (IoV). Using blockchain and cryptocurrency technology, Ripple is dedicated to creating powerful gains in financial efficiency, equity and inclusion. In addition, Ripple is developing and enabling the future use cases that will catalyze the new digital economy for governments, businesses and consumers.\nRipple has offices in San Francisco (HQ), New York, London, Mumbai, Singapore, São Paulo, Toronto, Reykjavík, Washington D.C. and Dubai.\nWHAT WE OFFER – The resources and support to be your best at work and beyond:\nDo Your Best Work\n\nThe opportunity to build in a fast-paced start-up environment with experienced industry leaders\nA learning environment where you can dive deep into the latest technologies and make an impact. A professional development budget to support other modes of learning.\nThrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team.\nRipple is Flexible First: you have the option to work remotely, from our offices, or a combination of the two within the 11 countries we are located around the world.\nWeekly all-company meeting - business updates and ask me anything >\nWe come together for moments that matter which include team off-sites, team bonding activities, happy hours and more!\n\nTake Control of Your Finances\n\nCompetitive salary, bonuses, and equity\nBonus Flexibility Program: Participants in the Corporate Bonus Plan have the option to elect to receive their annual bonus in cash, equity or XRP, or a combination.\n100% paid medical and dental and 95% paid vision insurance for employees starting on your first day\n401k (with match)\nCommuter benefits\nEmployee giving match\nMobile phone stipend\n\nTake Care of Yourself\n\nTwice a quarter R&R days so you can rest and recharge\nGenerous wellness reimbursement and weekly onsite & virtual programming\nFlexible vacation policy - work with your manager to take time off when you need it\nIndustry-leading parental leave policies. Family planning benefits.\nCatered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events\n\nBenefits listed above are for full-time employees. Interns - please discuss benefits with your recruiter.\nRipple is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.\nPlease find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["senior"]},{"job":"Associate Credit and Market Risk","company":"Gemini","location":"United States","post_date":"7d","link":"https://web3.career/associate-credit-and-market-risk-gemini/39808","key":"39808","details":"Empower the Individual Through Crypto\n\nGemini is a crypto exchange and custodian that allows customers to buy, sell, store, and earn more than 30 cryptocurrencies like bitcoin, bitcoin cash, ether, litecoin, and Zcash. Gemini is a New York trust company that is subject to the capital reserve requirements, cybersecurity requirements, and banking compliance standards set forth by the New York State Department of Financial Services and the New York Banking Law. Gemini was founded in 2014 by twin brothers Cameron and Tyler Winklevoss to empower the individual through crypto.\n\nCrypto is about giving you greater choice, independence, and opportunity. We are here to help you on your journey. We build crypto products that are simple, elegant, and secure. Whether you are an individual or an institution, we want to help you buy, sell, and store your bitcoin and cryptocurrency. Crypto is not just a technology, it's a movement.\n\nThe Department: Risk Management\n\nOur Risk department plays a critical role in proactively identifying, assessing, responding to, and communicating Gemini’s exposure, both internally and externally. Our Risk team is building a robust second line of defense in a first-of-its kind industry; our goal: safeguard Gemini so that we can continue to empower the individual through crypto.\n\nThe Role: Credit & Market Risk Associate\n\nGemini is looking for a Credit & Market Risk Associate to be part of the wider risk management function. The risk management function works closely with various teams across Gemini including products, trading, operations, engineering, compliance and audit to manage inherent risks in processes of the Company. We are looking for someone who can bring a mix of credit & counterparty risk as well as market risk management expertise while at the same time a critical, quantitative and hands-on approach to help manage the credit & market risk faced by Gemini. The role will require the individual to implement risk solutions for counterparty and market risk monitoring and recommend potential risk mitigation actions. The role provides an exciting opportunity to understand and help build risk infrastructure of an evolving asset class and products. The role will provide an opportunity to challenge the most fundamental risk management principles and implement solutions which suit the new and evolving asset class with a beginner's mindset. To excel in this role, the individual will need to be proactive and use his/her experience, analytical skills and technical ability to add value to the organization.\n\nThis role is either full time in office or hybrid office/remote and can be based in New York City, Seattle, or San Francisco.\n\nResponsibilities\n\nConduct thorough analysis of financial statements and assessment of credit requests, including new requests, changed requests etc.\nLead analysis of derivative and financing transactions including credit risk considerations and views of collateral, including analysis of credit protections and covenants\nIdentify and monitor market risk across various existing and new products and derivatives including futures, options and structured products.\nMonitor intraday and overnight market and counterparty risk exposure at portfolio and single-product levels and highlight key risks as needed.\n\nFollow developments in the cryptocurrency markets and help build, revise and enhance risk limits, methodologies and processes.\nPresent analysis, findings, and recommendations to managers and senior leaders, especially findings that involve a counterparties ability to repay and/or meet their margin collateral obligations\nDevelop and prepare models to support analysis of new and existing credit applications from counterparties\nHelp to design and improve policy based risk management and governance framework in the organization.\nDevelop and manage relationships with internal business stakeholders\nPartner with products, data, engineering and operations team to implement risk related monitoring/reporting infrastructure and risk mitigation processes.\n\n\nQualifications & Skills:\n\nBachelor’s degree with specialization in mathematics, statistics, engineering or any other quantitative discipline. Master’s degree preferred.\n\n2-3 years of relevant experience in the financial risk and/or credit and counterparty risk management field with a strong quantitative and technical background.\n\nAbility to effectively manage competing deadlines for projects in a fast paced, high-pressure work environment, with varying degrees of supervision\n\nStrong attention to detail and ability to notice discrepancies in data\n\nImpeccable understanding of financial statements, ratios, and concepts\n\nKnowledge of traded assets and derivatives including futures, options, structured products and their risk characteristics.\n\nProgramming skills in SQL, VBA, Python will be beneficial\n\nCryptocurrency experience is a plus\n\nPreferred Professional Qualifications:\n\nCFA, FRM, PRM designations.\n\nIt Pays to Work Here\n\nWe take a holistic approach to compensation at Gemini, which includes:\n\nCompetitive Compensation and Profit-Sharing Equity\nFlexible vacation policy\nRetirement Plan Matching\nGenerous Parental leave\nComprehensive health plans\nTraining and professional development\n\nSalary Range: In compliance with Colorado's Equal Pay for Equal Work Act and the New York City Pay Transparency Law, the base salary range for this role is between $86,000 - $107,000 in Colorado and $95,000 - $133,000 in New York City. This range is not inclusive of our discretionary bonus or equity package. When determining a candidate’s compensation, we consider a number of factors including skillset, experience, job scope, and current market data.\n\nAt Gemini, we strive to build diverse teams that reflect the people we want to empower through our products, and we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. Equal Opportunity is the Law, and Gemini is proud to be an equal opportunity workplace. If you have a specific need that requires accommodation, please let a member of the People Team know.\n\n#LI -\n\nGemini focuses on Financial Services, Virtual Currency, Bitcoin, and Cryptocurrency. Their company has offices in New York City and New York. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://gemini.com/ or find them on Twitter, Facebook, LinkedIn, and Product Hunt.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":[""]},{"job":"Senior Product Data Analyst","company":"Okcoin","location":"San Jose","post_date":"7d","link":"https://web3.career/senior-product-data-analyst-okcoin/39807","key":"39807","details":"Who We Are\nOkcoin is one of the world's largest and fastest growing cryptocurrency exchanges. We help millions of people buy and sell bitcoin, and over 30 other crypto assets every day — but our work is a whole lot more than that. We're building an inclusive future of finance, one that opens new opportunities to learn financial literacy, store value, and build wealth for everyone.\nAbout the Opportunity\nAs a Product Data Analyst supporting Okcoin, you will be responsible for leveraging data to optimize fiat product features for Okcoin and OKX. You will work directly with our product team to identify needs, suggest solutions, execute and communicate insights. The ideal candidate is someone who is collaborative, has strong communication and problem solving skills.\nWhat You'll Be Doing:\nCollaborating with engineering and data engineering to build scalable analytics infrastructure by writing instrumentation specifications and assisting in data modeling for Fiat payments\nBuilding dashboards/reports which support decision making across Product and Design\nDeep diving into our data, applying data mining techniques to generate actionable insights which enable us to iterate our product\nCollaborating with product to define key metrics as well as identify opportunities to drive those metrics\nDesigning and interpreting AB tests to optimize product features\nWhat We Look For In You:\n4+ years in analytics or data science\nStartup experience\nHigh levels of curiosity and eager enthusiasm for open-ended problems\nFamiliarity working with product analytics solutions and event based analytics\nAdvanced SQL skills and familiarity with data modeling\nAbility to apply statistical analysis and data mining methods\nPassion for cryptocurrency and blockchain innovations\nExcellent written and verbal communications skills; ability to translate insights into clear and actionable plans for product\nNice to Haves:\nExperience with Python and relevant analytics/ML libraries\nPayments analytics experience\n\nHighlights of Perks and Benefits:\nMarket competitive total compensation package\n100% company paid individual medical, dental, & vision insurance coverage\nTraining & Development Reimbursement\nPTO, company paid holidays, and flexible hours\nParental Leave\nEmployee Referral Bonus Program\nCompany Donation Match\nMore surprises when you join!\nOkcoin Statement:\nOkcoin is committed to equal employment opportunities regardless of race, color, genetic information, creed, religion, sex, sexual orientation, gender identity, lawful alien status, national origin, age, marital status, and non-job related physical or mental disability, or protected veteran status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","data","science","senior"]},{"job":"Senior Full Stack engineer Founding team Blockchain Fintech","company":"Stealth mode","location":"India","post_date":"7d","link":"https://web3.career/senior-full-stack-engineer-founding-team-blockchain-fintech-crdneai/39806","key":"39806","details":"Who we are :*\n\nWe are a fintech with aspirations to change the world of global commerce.\nWe plan to bring the best of technology innovations such as blockchain and web 3.0 to create unparalleled user experience for our customers to remove friction and bring new life to the world of global commerce.\n\nWho you are\n\nResponsible Rebel: who always wanted to change the world around, but you are always careful about breaking things\n\nInnovator: always have found ways to do things differently, cheaply\n\nIndustrious: worked hard to achieve goals that seemed unconquerable\n\nLearner: always learning new things and forming opinion that was different\n\nValue Diversity: there are always many ways to get things done\n\nCODE IS YOUR FOOD, BLOCKCHAIN is your dream, DATA and ML/AI is your weapon of choice\n\nWe seek a talented and passionate individual who thrives in an extremely fast-paced, entrepreneurial environment. This is a role on the founding team, and as such, will require great creativity and drive to deliver on an ambitious roadmap. This is an opportunity to help build a revolutionary product from the ground up.\n\nYour responsibilities :\n\nResearching high quality of the material required for a particular blockchain project.\nDesigning and developing applications using blockchain technology.\nTesting and troubleshooting the blockchain-driven projects.\nEvaluating blockchain platforms\nPreparing docs for every project and leading the team to create better solutions.\nKey enabler to UX design\nOwn technical partnership with L0/1 Blockchains\nPartner with Product development team\nA key contributor to our journey to create a new protocol to support b2b commerce\n\nQualification\n\n2 year of experience in Engineering\n\nBachelor (Masters preferred) in computer science\nExperience in working with Solidity and public blockchain platforms including strong skills in Smart Contracts exposure to experience with Ethereum, Hyperledger Fabric, Solana, and layer 2 solutions like Matic, BSC, etc.\nProficiency in programming languages Solidity, Python, C++, JavaScript\nHaving the capability of writing multiheaded code\nExposure to Web3.js libraries is a plus.\nExperience in distributed deployment of Blockchain Networks and deployment experience is required\nExcellent communication and team player\nHaving contributed to open-source blockchain projects would be a strong advantage\nStrong background in software development\nExperience in working with codebases\nHands-on experience on open source projects\nStandard algorithms and data structures knowledge\nBasic understanding of Cryptography\n\nRequirements:\n\n4+ years of professional software development experience (rare exceptions for highly skilled candidates)\nStrong engineering background in fields such as Computer Science, Mathematics, Software Engineering, and Physics.\nExperience in working with Solidity and public blockchain platforms including strong skills in Smart Contracts exposure to experience with Ethereum, Hyperledger Fabric, Solana, and layer 2 solutions like Matic, BSC, etc.\nExtensive experience in writing complex logic in Python\nExperience in JavaScript programming, including JavaScript frameworks such React.js / Next.js, Angular or Vue\nIn-depth knowledge in Django / FastAPI / Flask or a similar framework\nFamiliarity with data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.\nDeep familiarity with containers (Docker) and orchestration (Kubernetes) at scale.\nAgile software product development experience\n\nStealth mode focuses on SaaS, B2B, Payments, Banking, and Blockchains. Their company has offices in New York City and Mumbai Central. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://google.com\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","finance","full","stack","senior","blockchain"]},{"job":"Affiliate Partnerships Coordinator","company":"Afterpay","location":"San Francisco","post_date":"7d","link":"https://web3.career/affiliate-partnerships-coordinator-afterpay/39803","key":"39803","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nAs Afterpay’s Associate Affiliate Partnerships Coordinator, you’ll:\n\n\nEnsure successful execution of advertising campaigns for retail partners at scale\nLiaise with retailers, affiliate networks and internal cross functional teams to support sales functions\nTrack, measure and communicate campaign performance to internal and external stakeholders\nBuild and streamline internal processes to ensure that advertising partners receive the highest level of sales and operational customer service\nMeet individual & team deadlines, KPIs, and drive success toward sales targets\n\nQualifications\n\n1+ years experience in a sales, sales operations or coordinator role\nExcellent organizational & time management skills\nDemonstrated track record of meeting & exceeding KPIs and sales targets\nExcellent communicator with strong interpersonal skills and ability to build relationships within various vertical/industries via email and phone\nThrives in fast-paced organizations while producing quality results\nExcels in cross functional collaboration\nAnalytical mindset, experience with Excel or relevant data analysis programs\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $34.09 - USD $41.68\n\nZone B: USD $31.73 - USD $38.75\n\nZone C: USD $28.99 - USD $35.43\n\nZone D: USD $25.58 - USD $31.25\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","marketing"]},{"job":"Content Strategist","company":"Worldcoin","location":"Rome","post_date":"7d","link":"https://web3.career/content-strategist-worldcoin/39801","key":"39801","details":"About the Company:\nCurrently valued at $1B and backed by leading investors like Andreessen Horowitz and Coinbase Ventures, Worldcoin is a new, collectively owned global currency that will be distributed fairly to as many people as possible. Worldcoin will launch by giving a free share to everyone on Earth. We believe that this is an essential step to accelerate the transition towards a more inclusive global economy, providing new ways for everyone to share future prosperity. We hope you’ll join us on our ambitious journey.\nAbout the Team:\nThe Marketing & Communications team is responsible for growing and improving Worldcoin’s public image all around the world. Tasked with the creation and management of Worldcoin’s global marketing campaigns and communications efforts, the team oversees everything from earned media and branding to content creation and influencer marketing.\nAbout the Opportunity:\nIn this role you will:\n\n\nBe responsible for crafting the Worldcoin brand narrative in all outward facing communications by partnering with influential voices to share our story to the world\nCreate global marketing content & brand strategies to spotlight our mission\nPosition WLD as the leader in the Web3 & crypto space through storytelling across platforms\nGrow and manage a global community of influential Worldcoin advocates through systematic research and outreach processes\nPartner closely with internal stakeholders to identify communications objectives and build narratives and content plans that support those goals\n\n\nAbout you:\n\n3-5 years of experience in a creative writing role\nExcellent writing and editing skills, with an exceptional eye for detail\nAbility to be detailed in your execution but flexible in your approach\nAbility to push a brand forward with fresh, evolving creative ideas\nExcellent taste for visual and written storytelling\nAffinity for data-driven decision making\nInterest in blockchain technology and cryptocurrency, though no prior experience necessary\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":[""]},{"job":"Senior Software Engineer Devops","company":"CANDY","location":"","post_date":"7d","link":"https://web3.career/senior-software-engineer-devops-candy/39799","key":"39799","details":"Candy’s mission is to deepen our interaction with experiences that bring us joy. As fans. As collectors. As people creating lives, we’re passionate about living. We know that relationship because we’ve chased it since we were kids. We are unapologetic fans and momentous collectors who see limitless possibilities in the digital revolution that’s disrupting – more like exploding – the way we engage and experience our favorite sports, music, art, and cultural icons.\n\nWe know the passion of being a die-hard fan and the need for the experience beyond the bleachers. We’re building a fully immersive storefront where fans can not only buy, sell, and trade their digital assets, but also experience a fully immersive marketplace that gives our users enablement beyond imagination with their digital assets.\n\nFandom. Reimagined.\n\nOUR INVESTORS:\n\nMichael Rubin- Founder & CEO of Fanatics & Philadelphia 76ers co-owner\nMike Novogratz - CEO of Galaxy Digital, Pioneer Investor\nGary Vaynerchuk- CEO of VaynerMedia, Social Media Entrepreneur\n\nSO YOU WANT TO JOIN CANDY?\n\nWe are looking for a Senior Software Engineer - Devops at Candy who will be joining a group of passionate innovators responsible for the \"backbone\" of our product and an integral piece of our platform. You will be tasked with building services and automating processes to enable the broader organization to optimize for both speed and quality. You will partner closely with senior engineers, architects, and development teams to address cross-cutting concerns. You will work in a fast-paced environment, maintaining a healthy sense of urgency, and continually improving engineering processes and optimizing for quality and efficiency. You are eager to learn and \"solve the hard problems\".\n\nWe are searching for creative minds that are excited to take on difficulties in the immediate while providing vision to the future. We want builders, innovators, and those that can not only think outside the box, but collaborate outside the box.\n\nAS OUR MOST VALUABLE PLAYER, YOU WILL...\n\nWrite highly-maintainable, performant code\nImplement and maintain custom tools, quality gates, and services\nMaintain a high-degree of ownership and transparency\nWork closely with engineering leadership and architects to deliver high-quality solutions\nProactively identify and implement process improvements for the way we write, test, deploy, and monitor code\nParticipate in component-level architectural design and code reviews\nAutomate unit and integration tests within a CI/CD pipeline\nMentor junior and mid-level engineers\n\nWHO ARE YOU?\n\n4+ years of experience in an account support type role, ideally focused in sports, media, and/or popular culture\nStraight forward problem solving and critical thinking abilities\nA growth mindset\nPrevious financial services or start-up experience\nAn ease at presenting your work and explaining design decisions\nA love of sports, collectibles, blockchain & crypto, and/or collectibles!\n\nYou’ll Love Working here because...\n\nOur People. You will be working with the top players who are the most enterprising, fun, encouraging, and innovative heads and teams. Aka, people you can be proud to work with!\nOur Mission.We believe that we are building something great and that the finest things we create will make the world a better place. Our goal is to deepen our relationship through experiences to fans and collectors globally.\nPerks.Our team-based culture provides the foundation for people to do their greatest work and constantly learn and grow. We offer a full slate of benefits, including competitive salaries, stock options, health coverage, and unlimited vacation. Given that we’re an early-stage startup, our benefits package continues to evolve as we do. Your ideas and suggestions matter to us!\n\nOur Core Values.\n\nTrust.We safeguard the goal. We believe we will only succeed if we earn trust – trust of our people, trust of our customers, trust of our partners. We will aim to achieve and keep faith at all times.\nInnovation.We dream big. We’re endlessly curious and constantly searching for the best, the better, and the never-before imagined.\nExcellence.We take big swings. We have high expectations of ourselves in everything we do.\nGrit.We drive past the finish line until the last second. Giving up is not an option. We will always find a way.\nInclusion.We are a team player, and we are in it together. We believe that diverse thinking comes from different thinkers, and we need all perspectives to come together and win.\nAuthenticity.We are the real deal and always authentic in what we create, our dealings with others, and in who we are as human beings.\nAccountability.We carry the ball. We hold ourselves to the highest moral and ethical standards. We will be fair and honest and take responsibility for our actions.\n\nTotal Compensation Range (Base + Equity): 150k-225k per year\n\nOur compensation package currently breaks down into a base salary and an equity component for all employees. The candidate’s seniority and the evaluations made of that candidate during the interview process determine compensation.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["devops","dev","senior"]},{"job":"Senior Frontend Engineer","company":"CANDY","location":"New York","post_date":"7d","link":"https://web3.career/senior-frontend-engineer-candy/39798","key":"39798","details":"Candy’s mission is to deepen our interaction with experiences that bring us joy. As fans. As collectors. As people creating lives, we’re passionate about living. We know that relationship because we’ve chased it since we were kids. We are unapologetic fans and momentous collectors who see limitless possibilities in the digital revolution that’s disrupting – more like exploding – the way we engage and experience our favorite sports, music, art, and cultural icons.\n\nWe know the passion of being a die-hard fan and the need for the experience beyond the bleachers. We’re building a fully immersive storefront where fans can not only buy, sell, and trade their digital assets, but also experience a fully immersive marketplace that gives our users enablement beyond imagination with their digital assets.\n\nFandom. Reimagined.\n\nOUR INVESTORS:\n\nMichael Rubin- Founder & CEO of Fanatics & Philadelphia 76ers co-owner\nMike Novogratz - CEO of Galaxy Digital, Pioneer Investor\nGary Vaynerchuk- CEO of VaynerMedia, Social Media Entrepreneur\n\nSO YOU WANT TO JOIN CANDY?\n\nWe are looking for an experienced Senior Front-End Software Engineer to join our Engineering department. In this role, we are looking for start-up minded, driven developers that love building from the ground up. In this role you will be helping design and architect our marketplace from the ground-up so senior level experience is preferred but also those that have a strong start-up mentality will do well in this role.\n\nWe are searching for creative minds that are excited to take on difficulties in the immediate while providing vision to the future. We want builders, innovators, and those that can not only think outside the box, but collaborate outside the box.\n\nAS OUR MOST VALUABLE PLAYER, YOU WILL...\n\nDesign and plan new features that will lay the foundation for Candy's marketplace and customer-facing applications.\nWrite robust, scalable, well-designed software that is easy to maintain and well tested.\nAdvance and refine our technology, user experience, and creative practices.\nCreate online experiences our customers love.\n\nWHO ARE YOU?\n\nYou have 4+ years experience in a professional engineering role.\nYou have tenured experience with Typescript, HTML, and CSS.\nYou have strong experience with multiple modern JavaScript frameworks like React / Next.js, Node, and Vue.\nYou have working experience with building component libraries in collaboration with product designers.\nYou have a deep knowledge of systems design and architecture.\nYou have a Bachelor's degree in Computer Science, HCI, Design, or equivalent practical experience.\nYou have advanced experience in designing and implementing user interfaces.\nYou have an understanding of the modern deployment process, comfort with docker, containers, and Kubernetes.\nYou are driven and can carry out several initiatives simultaneously.\nYou take ownership of everything you do and have opinions on the features you’re working on.\nYou are a standout colleague and aim for having excellent collaboration across teams, functions, and locations.\nYou have a love of sports, collectibles, blockchain and crypto!\n\nYou’ll Love Working here because...\n\nOur People. You will be working with the top players who are the most enterprising, fun, encouraging, and innovative leaders and teams. Aka, people you can be proud to work with!\nOur Mission. We believe that we are building something great and that the finest things we create will make the world a better place. Our goal is to deepen our relationship through experiences to fans and collectors globally.\nPerks. Our team-based culture provides the foundation for people to do their greatest work and constantly learn and grow. We offer a full slate of benefits, including competitive salaries, stock options, health coverage, and unlimited vacation. Given that we’re an early-stage startup, our benefits package continues to evolve as we do. Your ideas and suggestions matter to us!\n\nOur Core Values.\n\nTrust. We safeguard the goal. We believe we will only succeed if we earn trust – trust of our people, trust of our customers, trust of our partners. We will aim to achieve and keep faith at all times.\nInnovation. We dream big. We’re endlessly curious and constantly searching for the best, the better, and the never-before imagined.\nExcellence. We take big swings. We have high expectations of ourselves in everything we do.\nGrit. We drive past the finish line until the last second. Giving up is not an option. We will always find a way.\nInclusion. We are a team player, and we are in it together. We believe that diverse thinking comes from different thinkers, and we need all perspectives to come together and win.\nAuthenticity. We are the real deal and always authentic in what we create, our dealings with others, and in who we are as human beings.\nAccountability. We carry the ball. We hold ourselves to the highest moral and ethical standards. We will be fair and honest and take responsibility for our actions.\n\nTotal Compensation Range (Base + Equity): 150k-225k per year\n\nOur compensation package currently breaks down into a base salary and an equity component for all employees. The candidate’s seniority and the evaluations made of that candidate during the interview process determine compensation.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","senior","react","javascript"]},{"job":"Senior Backend Engineer","company":"CANDY","location":"","post_date":"7d","link":"https://web3.career/senior-backend-engineer-candy/39797","key":"39797","details":"Candy’s mission is to deepen our interaction with experiences that bring us joy. As fans. As collectors. As people creating lives, we’re passionate about living. We know that relationship because we’ve chased it since we were kids. We are unapologetic fans and momentous collectors who see limitless possibilities in the digital revolution that’s disrupting – more like exploding – the way we engage and experience our favorite sports, music, art, and cultural icons.\n\nWe know the passion of being a die-hard fan and the need for the experience beyond the bleachers. We’re building a fully immersive storefront where fans can not only buy, sell, and trade their digital assets, but also experience a fully immersive marketplace that gives our users enablement beyond imagination with their digital assets.\n\nFandom. Reimagined.\n\nOUR INVESTORS:\n\nMichael Rubin- Founder & CEO of Fanatics & Philadelphia 76ers co-owner\nMike Novogratz - CEO of Galaxy Digital, Pioneer Investor\nGary Vaynerchuk- CEO of VaynerMedia, Social Media Entrepreneur\n\nSO YOU WANT TO JOIN CANDY?\n\nWe are looking for an experienced Senior Backend Engineer to join the engineering department. Your contribution to Candy’s success will be aimed towards building the premium blockchain-powered digital collectible experience on the team. In addition, you will play a prominent role in building databases and operating systems. Above all, you will advance and refine our proprietary technologies, platforms, and creative practices.\n\nWe are searching for creative minds that are excited to take on difficulties in the immediate while providing vision to the future. We want builders, innovators, and those that can not only think outside the box, but collaborate outside the box..\n\nAs our Most Valued Player, you will...\n\nBuild core infrastructure software (APIs, microservices, database modeling), instrument them for performance, and enhance for throughput.\nWork on integrating backend services such as decentralized databases, user authentication, eCommerce platforms, and customer insight systems into our products.\nWork in collaboration with UX engineers and product managers to implement platform requirements.\nWrite robust, scalable, well-designed software that is easy to maintain and well tested.\nAdvance and refine our proprietary technologies, platforms, and creative practices.\n\nWho are you?\n\nYou have 4+ years experience in a professional engineering role.\nYou have a bachelor's degree in Computer Science, HCI, Engineering, or equivalent practical experience.\nYou have experience developing and/or integrating decentralized technologies, infrastructure, and data systems.\nYou have experience with cloud systems such as Azure, AWS, or Google Cloud.\nYou have experience building custom SaaS applications and APIs.\nLanguage-agnostic with a preference for experience in Python, Java, and/or Go.\nYou have a strong comprehension of the modern deployment process, comfort with docker, containers, and/or kubernetes.\nYou can drive and carry out several initiatives simultaneously.\nYou take ownership of everything you do and have opinions on the features you’re working on.\nYou have a love of sports, collectibles, blockchain and crypto!\n\nYou’ll Love Working here because...\n\nOur People. You will be working with the top players who are the most enterprising, fun, encouraging, and innovative heads and teams. Aka, people you can be proud to work with!\nOur Mission. We believe that we are building something great and that the finest things we create will make the world a better place. Our goal is to deepen our relationship through experiences to fans and collectors globally.\nPerks. Our team-based culture provides the foundation for people to do their greatest work and constantly learn and grow. We offer a full slate of benefits, including competitive salaries, stock options, health coverage, and unlimited vacation. Given that we’re an early-stage startup, our benefits package continues to evolve as we do. Your ideas and suggestions matter to us!\n\nOur core values:\n\nTrust. We safeguard the goal. We believe we will only succeed if we earn trust – trust of our people, trust of our customers, trust of our partners. We will aim to achieve and keep faith at all times.\nInnovation. We dream big. We’re endlessly curious and constantly searching for the best, the better, and the never-before imagined.\nExcellence. We take big swings. We have high expectations of ourselves in everything we do.\nGrit. We drive past the finish line until the last second. But, giving up is not an option. We will always find a way.\nInclusion. We are a team player, and we are in it together. We believe that diverse thinking comes from different thinkers, and we need all perspectives to come together and win.\nAuthenticity. We are the real deal and always authentic in what we create, our dealings with others, and in who we are as human beings.\nAccountability. We carry the ball. We hold ourselves to the highest moral and ethical standards. We will be fair and honest and take responsibility for our actions.\n\nTotal Compensation Range (Base + Equity): 150k-225k per year\n\nOur compensation package currently breaks down into a base salary and an equity component for all employees. The candidate’s seniority and the evaluations made of that candidate during the interview process determine compensation.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","senior","java"]},{"job":"Client Executive B2B WEB3 Part time","company":"dOrg","location":"United States","post_date":"7d","link":"https://web3.career/client-executive-b2b-web3-part-time-dorg-1/39796","key":"39796","details":"About us\n\ndOrg is a software development collective that builds decentralized tools and applications. Our organization pioneers new technologies and methodologies for distributed organizing, and is the first DAO to be legally recognized in the US. We’ve worked with dozens of leading web3 organizations and have 60+ active contributors across 15 countries.\n\nWe envision a world where power is robustly decentralized– institutions are transparent and self-governing; coordination happens without extractive intermediaries; wealth is fairly distributed; and people have more time for meaningful pursuits. We believe that decentralized technologies are key to this future.\n\nOur achievements have been featured in Time, Coindesk, and Hackernoon among others.\n\nAbout the role\nAs our Client Executive, your focus will be to enhance the quality of service that we provide to our clients -mainly web3 organizations.\n\nYour role will focus on the entire client lifecycle, from first contact to onboarding, support and retention as well as being the point of contact if there's any issue. This will involve hands-on support on project-specific matters in addition to driving improvements in our overall processes and strategies for guaranteeing a superb great client experience.\n\nIt’s a part-time role that we estimate will require up to** 10 hr/week** but could increase in the future as needed.\n\nYou are:\n\nSomeone that feels at home taking full autonomy of your role, including deciding what’s a priority, what your role should entail, and managing your own timescales and deadlines.\nDeciding what’s a priority, what your role should entail, and managing your own timescales and deadlines.\nSomeone that feels comfortable reaching out to others to gather the information you need.\nA web3 native – already acclimated to DAOs and the broader crypto space. +5 years experience with client experience or project management.\n\n\nResponsibilities:\n\nDefine, communicate and enforce delivery excellence standards (Execution/ Quality Control/ Project Delivery/ KM).\nDefine and manage the customer pipeline (Create, implement and monitor metrics for presales, delivery, post delivery and next step proposals)\nDevelop a strategy/framework that allows DOrg to connect customer insights with technical solutions in addition to the current ongoing engagements.\nDefine and implement knowledge management guidelines that allow the organization to recycle solutions and compound our learnings\nExcited to be part of a DAO community and all that it entails: from taking part in governance decisions, to joining our All-Hands community meetings, to working closely with other internal-facing roles.\n\nBenefits:\n\nUltimate autonomy. Work whenever, wherever on whatever interests you most\nPeer support: Up your game by working with other talented professionals\nBuild with cutting-edge tech on high-impact web3 projects\nCommunity: retreat, friends around the world, workshops, IRL retreats, and much more!\nCompetitive rates & token allocation opportunities in client projects\nPaid in crypto\nUS residents can leverage our partnership with Opolis for S-corp payroll and benefits\nShape the direction of dOrg and the future of work\nEarn Rep to unlock many more :)\n\nWant to maximize your impact by applying for this position? Use our interest form and indicate that you saw the offer on this job portal.\n\ndOrg focuses on Open Source, Peer-to-Peer, Web Development, Bitcoin, and Cryptocurrency. Their company has offices in Burlington. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://dorg.tech or find them on Twitter and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","part","time"]},{"job":"Customer Strategy Analyst","company":"Rain","location":"New York","post_date":"7d","link":"https://web3.career/customer-strategy-analyst-rain/39794","key":"39794","details":"Who we are\nRain’s mission is to create the fastest and easiest pathways for web3 teams to access capital in the real world. We’re a small and mighty team of passionate builders and veteran founders building at the intersection of cryptocurrency and fintech. We are looking for a compliance officer to join us to accelerate the organization and guide the early structure and regulatory ethos of the company as at the earliest stage. You will have the opportunity to deliver massive impact at a quickly growing company that is funded by some of the top investors in fintech and crypto.\nOur Ethos\nWe believe in building an open and honest workplace based on mutual respect and high achievement. We are looking for people that value challenging work environments and are seeking opportunities to grow. As a fast growing company, our team members at all levels have the freedom to explore ideas and impact the roadmap and vision of our company.\nWho We are Looking For\nRain is seeking an experienced analytical and high integrity person to join our operations team. The right candidate will be someone that is driven, versatile and self motivated. As a company at the cutting edge of financial tooling, our team deals with interesting problems and challenges on a regular basis. We are looking for smart and talented people to help manage the customer journey and the challenges they face throughout the onboarding cycle and as customers start using our products. Successful candidates can look forward to working closely with the operations and teams to deliver positive customer outcomes while helping our company manage risk.\nWhat you will work on:\n\n\nYou will be one of the core members of our operations team with the opportunity to contribute to various pieces of our organizational growth. The person in this role will report directly to the founders with opportunities to grow adjacent skills across the company\nCreate and maintain strategic initiatives governing customer experience\nDevelop and design customer lifecycle activities including but not limited to onboarding, approval, and management\nActionalize policies and procedures by utilizing internal tooling and third party vendors\nCollaborate with legal and compliance resources to ensure coverage and compliance with applicable laws and regulatory requirements\nDevelop and refine rules that the company can utilize to automate customer onboarding and lifecycle management\nContribute to the firm’s risk management efforts\nAssist with the investigation of fraud and restricted activities, as necessary\nManage the application and ongoing processes of any necessary licenses or registrations across the company\nWhat you will bring to Rain\n\nBA/BS required; advanced degree is a plus\n2+ years of operations or related experience at a bank, financial services firm, or financial technology company.\nProven track record of complex problem solving and decision-making skills.\nStrong analytical skills. Effective leader and team player.\nDesirable but not mandatory:\n\nExperience with customer orchestration tools and services\nRisk management exposure/experience\n\nWe are an equal opportunity employer and value diversity at Rain. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. The role is available remotely in the USA including US Territories such as Puerto Rico, USVI and Guam.\nCompensation is commensurate with experience and includes cash compensation and equity.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst"]},{"job":"Senior SDET Backend Platm Engineering","company":"Bittrex","location":"Washington","post_date":"7d","link":"https://web3.career/senior-sdet-backend-platform-engineering-bittrex/39793","key":"39793","details":"*This is a fully remote, direct hire (W-2) position. Working remotely from a primary residence outside the United States is currently not permitted for this role.\n\nSummary:\n\nBittrex, the leading blockchain technology provider and cryptocurrency exchange, is hiring a fully remote Senior Backend Software Development Engineer in Test for our Platform Team. We are passionate about uptime, code correctness, and quality and we are hiring additional engineers that share our values to help build the next generation of solutions and trading tools. If this sounds like you, we would love to have you join our rapidly growing team.\n\nWe are specifically looking for a senior-level backend SDET with prior experience working on large production codebases who possesses a relentless drive for quality to support our Platform Engineering Team. The Senior SDET will be responsible for ensuring that our product ships with high quality and confidence. This is an opportunity to do testing the right way and work with software engineers who value a high degree of collaboration and integration.\n\nWhen you work at Bittrex, you will find compelling work, worthwhile professional development, outstanding benefits, and the opportunity to make a difference. We believe that we can build an inclusive environment founded on empathy, respect, and equality to create great experiences for our diverse and global customers. This is a fully remote role.\n\nKey Responsibilities:\n\nThe senior-level Backend SDET is responsible for managing and executing the testing of the platform services/API of our advanced financial services application.\n\nYou will need to learn and understand our product at a high level of detail and collaborate with internal teams to execute your primary responsibilities, including:\n\nContribute to the team’s operational excellence, building tools, and frameworks to streamline/automate platform services/API of the Fiat integration process\nDesign, develop, execute, and maintain platform/API automation framework and test scripts\nIntegrate the automated tests into build pipelines and ensure smooth execution\nMonitor the health of test build pipelines. Analyze any test failures and collaborate with Software Engineers for root cause analysis\nPrepare documentation to report status and summarize test results\nCollaborate with the development team, while supporting the front-end and mobile teams, to build high performance services that power Bittrex and our partner exchanges\nCreate manual test cases, as needed, to cover the current and future releases\nReview and analyze results of test cases and scenarios\nCommunicate with internal teams on specific application issues\nPrioritize QA issues and facilitate issue resolution\nWork with product or project managers to establish timelines for timely completion of QA elements\nCollaborate with Software Engineers and other test engineers to produce high quality products\nDrive enhancementsto improve process and technical implementations\nDevelop and maintain QA guidelines and process documentation\nFind creative solutions to ambiguous problems\n\nEssential skills:\n\n5 to 7+ years of SDET experience working on large production codebases in multi-application production environments\n5+ years of experience focused on development and implementation of platform services/API automation work in one or more object-oriented programing languages (C# highly preferred)\nSolid understating of OOPS concepts and service-oriented architecture.\nStrong experience in API testing using tools like POSTMAN, SOAP UI etc. is required (POSTMAN preferred).\nWorking knowledge of SQL and relational databases is required.\nStrong understanding of any cloud service providers (Azure preferred).\nExperience with YAML pipelines in Azure Devops, GitHub, etc.\nExperience in multiple test methodologies, for example, regression testing, ad hoc testing, feature testing, security testing, integration testing, performance testing, user acceptance testing, etc.\nExcellent communication skills\nStrong problem-solving and root cause analysis skills\nBS degree in computer science -or- equivalent professional experience\nKnowledge of shell scripts is a plus.\nKnowledge of BDD technologies like SpecFlow, Cucumber is a plus.\n\nInterview Steps:\n\nRecruiter Phone Screen (15-30 min)\nTechnical Interview (50 min)\nInterview Loop (via Zoom and Coderpad, 3-4 hours, can be divided into two days)\n\nPrior to each step, we will provide tips on who you'll be meeting with, what to expect, and how to prepare.\n\nBenefits at Bittrex:\n\nFully remote roles\nFlex office space\nUnlimited PTO\n401(k) participating with employer match\nTop of the line health coverage\nHealth savings account (HSA)\nEducation and home office stipends\n\nAbout Bittrex:\nEstablished in 2014, Bittrex is a U.S. based cryptocurrency Exchange with a long-standing reputation for industry-leading security, world-class compliance, innovative products, and state-of-the-art trading and technology infrastructure.\n\nWith lightning-fast trades, dependable digital wallets, and trusted security, our goal is to operate a world class cryptocurrency exchange with a focus on security and trust.\n\nWe invite you along on our journey to advance the blockchain industry by fostering innovation, incubating new and emerging technologies, and driving transformative change.\n\n***\n\nBittrex is committed to a diverse and inclusive workplace. Bittrex is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\n\n#BI-Remote #LI-Remote #remotework #LI-KL1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","quality","assurance","senior"]},{"job":"Associate Customer Success Manager Americas","company":"Chainalysis","location":"New York","post_date":"7d","link":"https://web3.career/associate-customer-success-manager-americas-chainalysis/39790","key":"39790","details":"Our Customer Success team is insatiably curious and adept at problem-solving. We use data and domain expertise to navigate the customer-journey, helping each stakeholder define and achieve success. We’re also extremely collaborative and work cross-functionally to share the insights we learn from our customers.\n\nThe Associate Customer Success Manager is a natural at making each and every customer feel like a VIP. They’re great at managing a lot of disparate priorities, building relationships with high-potential customers, and strategizing about how to build accounts and increase adoption. We measure your success by things like user adoption, retention, and overall satisfaction.\n\nWithin a year you are successful if…\n\nYour knowledge of customer journeys, SaaS revenue metrics, and overall Customer Success has grown substantially\nYou’ve directly contributed to increasing the net retention of our customers in our financial, cryptocurrency, and government verticals\nYou can confidently answer advanced product usage and technical questions related to data, compliance and regulatory standards, and investigations across our product suite\nOur customers trust and rely on you to help them achieve their goals\nThe Customer Success team is more efficient and scalable thanks to your input on how to automate, simplify, and improve our daily workflows\n\nA background like this helps:\n\nPrior working experience in Customer Success at a SaaS business is a plus, but mainly we’re looking for candidates who have been in a customer facing role\nExperience building out customer journeys and expanding product adoption\nEmotional intelligence and an empathetic propensity to read between the lines and understand what the customer is saying (and what they mean)\nAn interest in cryptocurrency or AML/KYC helps\n\nAt Chainalysis, we help government agencies, cryptocurrency businesses, and financial institutions track and investigate illicit activity on the blockchain, allowing them to engage confidently with cryptocurrency. We take care of our people with great benefits, professional development opportunities, and fun.\n\nYou belong here.\n\nAt Chainalysis, we believe that diversity of experience and thought makes us stronger. We encourage applicants across any race, ethnicity, gender/gender expression, age, religion, ability and experience. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. We can’t wait to meet you.\n\n#LI-MG1 #LI-Remote\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","customer","support"]},{"job":"Commercial Counsel Procurement Legal Ops","company":"Chainalysis","location":"New York","post_date":"8d","link":"https://web3.career/commercial-counsel-procurement-legal-ops-chainalysis/39784","key":"39784","details":"The Legal team at Chainalysis advises both internal and external stakeholders on the forefront of cryptocurrency and its constantly evolving regulatory landscape. Our job is to ensure the company continues its rapid growth by employing sound and efficient judgment to support operations around the company and influence a groundbreaking industry as it matures and becomes more widely adopted.\n\nAs Commercial Counsel - Global Procurement (and Legal Ops), you will be the key legal partner to the procurement team and be responsible for finalizing all procurement deals, as well as managing baseline legal operations.\n\nIn one year you’ll know you were successful if you have…\n\nBecome the point person for the review and negotiation of all procurement deals, including marketing, sponsorship, SaaS agreements, as well as NDAs, Assignment and Assumption Agreements, and other ancillary legal documents.\nCreated an efficient and thoughtful global procurement contracting review process/playbooks that enables the company to meet its contractual, security, and privacy commitments and initiatives.\nBecome a key partner to the Rev Ops organization in improving the RFP/bid process.\nBecome a trusted advisor to the Finance organization.\nOverseen and improved legal lead vetting of customers and prospects.\nIdentified best in class legal operations initiatives.\nImproved the use of existing legal operations tools, including our CLM solution, DocuSign, and outside counsel management solutions.\nDemonstrated and developed a track record of an obsession with internal client and external customer satisfaction, while promoting scalable processes and procedures.\nBeen a team player and have become a trusted partner to other areas of the business.\n\nA background like this helps:\n\nAbove all, you must have excellent judgment and critical thinking skills.\nMeaningful experience within a procurement function on a large corporate legal team.\nSignificant experience negotiating SaaS and data agreements, as well as marketing and events agreements.\nLegal Operations experience and RFP/bid experience is a major plus.\nDeep understanding of intellectual property and licensing concepts.\nYou are independent, patient, thoughtful, and adept at managing shifting priorities in a demanding, fast-paced environment, but at the same time possess the judgment to know when and how to escalate issues.\nYou are familiar with or have an interest in the cryptocurrency and blockchain industry.\n\nThe base salary range for this role is $126,300 to $157,900on a national basis and may be higher or lower depending on the location of the role. Base salary is just one part of our total rewards package which additionally includes equity, performance bonus or commissions for eligible roles, and competitive benefits. Individual pay decisions are based on a number of factors, including qualifications for the role, relevant work experience, skillset, internal equity, and other factors, consistent with applicable law.\n\n#LI-YT1 #LI-Remote\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["legal"]},{"job":"Marketing CoFounder requires leading successful NFT Crypto DAO launches","company":"AresWeb","location":"United Kingdom","post_date":"8d","link":"https://web3.career/marketing-co-founder-requires-leading-successful-nft-crypto-dao-launches-aresweb/39783","key":"39783","details":"Looking to partner with a Co-founder that has great expertise in promoting the AresWeb project with specific crypto marketing tools.\n\nTo be highly passionate about blockchain and DAO developments. Should have good knowledge of the main blockchains and be able to write technically; simplify concepts and create entertaining content.\n\nNeeds to be creative, to be able to carry guerrilla marketing campaigns.\n\nJust before we move forward wanted to let you know a few things:\n\nWill be bootstrapped. So no financial pay except shares in the company and a big part of the tokens pre-Initial Coin Offering.\nYou have to be able at least twice a year to visit London for a bi-annual team gathering.\nLooking for a cofounder to consult and decide together where we are “going”:\n\nWhat I want:\n\nSomeone to debate and argue productively;\n\nYou can find more about our project at https://twitter.com/AresWeb_net\n\nAresWeb focuses on Financial Services and Blockchain / Cryptocurrency. Their company has offices in London. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://www.aresweb.net or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","marketing","non-tech","crypto","dao"]},{"job":"Lender Success Associate [Remote]","company":"Splash Financial","location":"United States","post_date":"8d","link":"https://web3.career/lender-success-associate-remote-splashfinancial/39782","key":"39782","details":"ABOUT OUR COMPANY:\nWe got tired of seeing our friends and family struggle under the crushing weight of student loans. So in 2013, we did something about it. We made a marketplace filled with banks and credit unions looking to help student borrowers. We used that network to help people shut out of refinancing find a way in. And we did it all from a tiny office in Cleveland, OH. In other words: we built Splash Financial.\nToday, we’ve become a national leader with over $6 billion in refi requests. We’re expanding into technologies like machine learning, and automated underwriting that helps us match consumers to great offers — right from their phone. And we’ve raised over $70 million from investors like DST Global, Citibank, Northwestern Mutual, DVP, CMFG Ventures and more. But at our core, we’re still that little company from Cleveland with a big dream: to make people more powerful than their debt.\nABOUT OUR WORKPLACE:\nSplash is remote-first, and proud of it. We spend our days creating ways to simplify financial products, then get them into the hands of people who need help. Right now, we’re focused on developing financial technologies that fundamentally change the way the industry lends. And before you ask: no, we’re not a crypto thing. And to hire the best, we provide the best: great health insurance, competitive salaries, and unique benefits like a $500 stipend to improve your home office (Giant monitor, anyone?). And although we’ve been around since 2013, we still love to think like a start-up — a place that empowers good people to do great things, fast. We’re friendly, folksy, and have Slack channels for both major league sports and minor league anime.\nAlso: we sometimes have free t-shirts.\nAbout the Role:\nSplash Financial is seeking a Lender Success associate to help manage our growing network of lender. This individual will play an important role, partnering with the Director as the point of contact for lenders. Effective candidates for this position will help increase lender engagement, maintain exceptional levels of service by responding to lender needs, questions and requests. This candidate should also be an analytical, tech-savvy communicator with the ability to build rapport with clients.\nWhat you'll do at Splash:\n\n\nWork with lenders to ensure requests are delivered in a timely manner\nUnderstand lender concerns and address them appropriately, knowing when to seek out help from others\nDevelop good working relationships with internal departments including individuals from IT, Lending, Credit and/or Operations\nEnsure that the owning departments is aware of any key deliverables and project milestones\nServe as a liaison internally and externally\nCommunicate client issues and requests to our developers/product teams and create solutions with them\nKeep management up-to-date on any client risks, major changes and other important details\nCross-functional development with product, development, sales and other internal teams to further understand the entire client life cycle\nPartnership with Director of Lender Success to develop additional skills/talents\nWhat you'll bring to Splash:\n\nBachelor’s Degree plus 1+ year experience in lending or underwriting; in lieu of a Bachelor’s Degree, 5+ years of related experience\nDemonstrates fundamental understanding of general banking and lending functions, loan structures and terminology\nSelf motivated, a great planner, exercises excellent judgment and handles challenges with positivity\nAbility to build client relationships, manage multiple clients, and set expectations appropriately through clear, digestible communication\nStrong organizational skills with an ability to prioritize tasks, make decisions and utilize resources with limited direction from the supervisor\nDemonstrates clear oral and written communication and can communicate effectively cross-functionally\nBenefits:\n\nComprehensive and affordable insurance benefits\nUnlimited paid time off policy\n401(k) with company match\n8 paid company holidays\nHome office stipend\nPaid parental leave\nGenerous employee referral bonus\nEmployment at Splash is based on individual merit. Opportunities are open to all, without regard to race, color, religion, sex, creed, age, handicap, national origin, ancestry, military status, veteran status, medical condition, marital status, sexual orientation, affectional preference, or other irrelevant factors. Splash is an equal opportunity employer.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote"]},{"job":"Chief Technology Officer","company":"Leaders in the Arena","location":"United States","post_date":"8d","link":"https://web3.career/chief-technology-officer-leadersinthearena/39781","key":"39781","details":"Beckett Collectibles is seeking a Chief Technology officer to join our highly dynamic environment. The CTO will be reporting directly to the CEO, the CTO will be responsible for scaling the technology organization and preparing the company for their next phase of exponential growth. The right candidate will have a proven track record in leadership and team building with a focus on leading distributed organizations across the company.\n\n\n\n\nBeckett Collectibles is a leader in the trading card and collectibles industry, providing pricing, grading, authentication, and other products and services for the sport, non-sport, and gaming collector. With a focus on integrity, commitment, and accuracy, Beckett will continue to be a leader in the collectibles industry providing dynamic products and services to collectors worldwide. Find out more about Beckett products and services at www.beckett.com.\n\n\n\n\n\nResponsibilities\n\nEstablish, execute, and achieve Beckett Collectibles’ technical vision and scaling milestones in strategic alignment with business objectives, employee development, and revenue goals\nManage the collective engineering team across multiple locations (US, Eastern Europe and India primarily), leading strategy for technology platforms, partnerships, and external relationships\nBuild and maintain a highly engaged engineering organization and culture; guide continuous learning for the engineering team and continuous improvement in our solutions\nWork closely with product, marketing, business development, and operations to define and deliver new products and enhancements\nNurture and enhance our engineering culture of inclusivity, curiosity, and ownership\nEnsure all technology practices, products, and services adhere to regulatory standards within financial services and data privacy\nPartner with fellow leadership peers to remediate production breaks and issues. Deliver real time updates, thorough postmortems and creating frameworks to prevent repeatable errors\nTrack, analyze, and monitor technology performance metrics\nOversee all system design and changes in system architecture\nKeep abreast of new trends and best practices in the technology landscape and be Beckett Collectibles’ thought leader in innovation and creativity\n\n\n\nQualifications\n\nMS in Computer Science / equivalent business / practical experience\nExperienced at managing efficient, dynamic teams with a track-record of leadership building, communication across different time zones and developing technology to enhance the customer’s experience. Experience working with distributed and/or remote teams preferred\nSignificant experience developing innovative products that heavily leverage emerging technologies in the Blockchain/NFT spaces.\nExceptional technical capability, with deep knowledge of and experience with modern software development practices and technologies\nPlayer-coach engineering leader with the ability to act as an architect and commit production code as needed\nAbility to make technical decisions with the lens of what is best for a fast-growing startup\nExperienced in building complex technical solutions with deep knowledge of key architectural principles found in highly scalable systems\nExperience building a technical strategy and understand technical trade-offs and risks\nStrong computer science fundamentals: data structures, algorithms, programming languages, distributed systems, and information retrieval\n\n\n\n\nLeaders in the Arena is proud to be a “fair (second) chance” company that provides equal employment opportunities to all employees and applicants. We prohibit discrimination in employment and harassment on the basis of race, color, sex, gender identity, sexual orientation, age, disability, religion, national origin, genetic status, veteran status, or any other characteristic protected by applicable law. This policy applies to all terms and conditions of employment, including recruitment, hiring, transfer, promotion, compensation, discipline, and termination.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["cto","executive","nft"]}]}