{"jobs":[{"job":"Visual Designer Marketing","company":"MetaMask","location":"United States","post_date":"6d","link":"https://web3.career/visual-designer-marketing-metamask/39876","key":"39876","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society.\n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.\n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nAbout our Design Team\n\nDesigners at ConsenSys make work that moves the crypto industry forward, spreading the gospel of WAGMI and pushing for the adoption of web3 technology. We’re ambitious, using our unique point of view to create work that infiltrates crypto culture and changes mindsets.\n\nWhat you’ll do\n\nAs a Visual Designer, Marketing, you will be responsible for designing and iterating upon the execution of ConsenSys’s marketing initiatives across its suite of products. Working closely with your counterparts in the marketing team and product design community across ConsenSys, you’ll raise the bar for the creative quality of our marketing efforts including efforts such as brand identities, digital experiences, events and swag design. And to do so, you'll bring with you a wealth of experience and be curious, creative and intuitive with a deep commitment to creating work that resonates with the highly-engaged crypto community.\n\nWould be great if you brought this to the role\n\nConceptualizing, designing and iterating on marketing executions to create engaging moments for our users across media channels\nCollaborating with the creative, design, product and marketing teams to deliver experiences that achieve brand and messaging goals\nEnsuring brand design systems are adhered to throughout the development of marketing initiatives\nWorking on new forms of interaction through the use of NFTs and web3 technology\nThinking strategically and empathetically about user outcomes\n\nWe’re looking for someone with\n\n3-5 years relevant experience, preferably at a design firm or advertising agency\nExpertise and/or formal education in design and creative direction and its process of ideation, creation and production\nExperience working across various media placements, including video, digital, physical and social platforms\nA strong portfolio demonstrating a passion for the creative craft through effective marketing campaigns\n\nThe ideal candidate\n\nThrives within a cross-discipline team in a remote-first environment\nUnderstands video, digital, physical and social media in all of their many forms\nHas extensive experience with creative tools like Adobe Creative Suite and Figma\nIs passionate about creative work and sweats the details\nIs driven by curiosity and pursuing new ways to engage\nIs a lifelong learner, always honing their craft, and eager to participate beyond their role\nIs eager to participate beyond their role with a can-do attitude\nGets excited about web-based and technology experiences\nWorks well in a fast-paced, agile environment\nIs a motivated self-starter who communicates clearly and effectively\nHas knowledge and experience in the blockchain/web3 space\n\nIt’s a bonus to have\n\nExperience in website and app design\nExperience in motion design\nExperience with remote work tools like Slack, Google suite and JIRA\nKnowledge of full-funnel marketing strategies\nInternational experience or experience working with global teams\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $78,000-140,000.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n#LI-KB1\n\nMetaMask focuses on Cryptocurrency, Blockchain / Cryptocurrency, and Web3. Their company has offices in San Francisco, London, Brooklyn, and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://metamask.io or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","marketing","ethereum"]},{"job":"Brand Content Marketing Manager","company":"Binance","location":"Remote","post_date":"6d","link":"https://web3.career/brand-content-marketing-manager-binance/39875","key":"39875","details":"Brand & Content Marketing Manager\nRemote – Global /\nMarketing – Marketing /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilites\nCreate and execute a content marketing strategy to generate compelling content to increase brand awareness, drive leads and engage our thriving community\nLead content marketing initiations including blog, newsletter, and industrial event\nSupport the content review of all marketing content material from the local marketing team\nWork closely with SEO, Product Marketing, and Communications to define and drive product and educational narratives\nWork with content strategists across the organisation to ensure excellence with regard to consistency of tone and language across the full customer lifecycle.\nRequirements\nMinimum 8 years of relevant experience in content marketing, preferably in the crypto/payments/tech industry\nExcellent command of British English language and grammar\nComes with a successful track record in leading content / Brand strategy and its brand directionIncumbent comes a flair for creative copywriting & storytelling\nAble to work confidently in a rapidly changing, fast-paced, and results-oriented environment where a high degree of flexibility is required.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","remote"]},{"job":"DeFi Derivatives Quant Crypto Trading Desk","company":"Rysk Finance","location":"Remote","post_date":"6d","link":"https://web3.career/defi-derivatives-quant-crypto-trading-desk-ryskfinance/39874","key":"39874","details":"About us:\nRysk is founded on the core principle of collaboration over competition, bringing together the best minds in blockchain development, protocol design and financial engineering. The core team is global, fully remote and champions productivity, not presenteeism. Together, we are building the next generation of products in decentralised finance.\n\nWhat we do:\nWe are preparing to launch the Dynamic Hedging Vault, our automated market maker for crypto options, on chain. The DHV protocol's network of smart contracts will be responsible for all aspects of pricing, trading, hedging, collateral management and settlement. A world first.\n\nDHV harnesses the demand in DeFi for trading volatility by offering sophisticated option strategies to traders through both long and short positions in vanilla options, but it also solves a much deeper problem: systematic correlation. Traditional crypto assets are highly correlated, meaning investors are unable to sufficiently benefit from portfolio diversification. As the name suggests, the DHV is hedged against crypto market moves and, by sharing its trading profits equally among investors, gives its liquidity providers crypto-native returns that are uncorrelated to the wider crypto market. Another world first.\n\nIn addition to serving volatility traders and portfolio managers, we have a range of other products that cater to institutional investors and depositors.\n\nWhom are we looking for:\nRequirements:\n- Excellent problem solver\n- Strong in mathematics\n- Programming experience\n- Fast learner\n- Excellent communicator (both verbal and technical documentation)\n- Enthusiastic about crypto and DeFi\n- Share our vision that the revolution in DeFi has only just begun\n\nBeneficial, but not required for the right candidate:\n- Knowledge of derivatives, volatility or stochastic calculus\n- Data science\n- Python\n- Kubernetes / Docker\n\nYour responsibilities and duties:\nYou will be working directly under our head quant to ensure the smooth running and profitability of Rysk's most sophisticated products. This will include:\n- Developing a deep understanding of the asset class\n- Financial modelling of crypto and crypto volatility\n- Building out the quant analytics library\n- Designing Risk Metrics and Reports\n- Managing the Desk's production systems & minimise downtime\n- Monitoring the protocols' trading activity\n- Writing internal paper (methodology docs, whitepapers)\n- Publishing research material to the public domain\n- Supporting the Desk\n- Supporting the wider team and community\n\nRysk Finance focuses on Finance, Finance Technology, and Blockchain / Cryptocurrency. Their company has offices in Remote. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://rysk.finance or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["crypto","defi","remote"]},{"job":"Staff Backend Blockchain Engineer","company":"CANDY","location":"New York","post_date":"6d","link":"https://web3.career/staff-backend-blockchain-engineer-candy/39872","key":"39872","details":"Candy’s mission is to deepen our interaction with experiences that bring us joy. As fans. As collectors. As people creating lives, we’re passionate about living. We know that relationship because we’ve chased it since we were kids. We are unapologetic fans and momentous collectors who see limitless possibilities in the digital revolution that’s disrupting – more like exploding – the way we engage and experience our favorite sports, music, art, and cultural icons.\n\nWe know the passion of being a die-hard fan and the need for the experience beyond the bleachers. We’re building a fully immersive storefront where fans can not only buy, sell, and trade their digital assets, but also experience a fully immersive marketplace that gives our users enablement beyond imagination with their digital assets.\n\nFandom. Reimagined.\n\nOUR INVESTORS:\n\nMichael Rubin- Founder & CEO of Fanatics & Philadelphia 76ers co-owner\nMike Novogratz - CEO of Galaxy Digital, Pioneer Investor\nGary Vaynerchuk- CEO of VaynerMedia, Social Media Entrepreneur\n\nSO YOU WANT TO JOIN CANDY?\n\nWe are looking for a Staff Backend Blockchain Engineer to help us deliver on a new blockchain platform, which will be showcasing availability of our products through a top-notch marketplace. Within this role you will be our head architect and develop smart contracts coordinating with our broader team to integrate blockchain contracts into our stack. You will document, guide, and design keeping track of issues and either self-implement or design fixes.\n\nWe are searching for creative minds that are excited to take on difficulties in the immediate while providing vision to the future. We want builders, innovators, and those that can not only think outside the box, but collaborate outside the box.\n\nAS OUR MOST VALUABLE PLAYER, YOU WILL...\n\nWork with others to design and build our systems using blockchain and have strong expertise within smart contracts.\nDemonstrate great attention to detail.\nDemonstrate great knowledge of programming tools and the ability to regularly produce working, correct code.\nHave the ability to comprehend that a thriving open source ecosystem multiplies your productivity.\n\nWHO ARE YOU?\n\nYou have 7+ years of experience in software engineering.\nYou have demonstrated excellence in software engineering including exposure to distributed systems, scalability, and algorithms.\nYou have a background in computer science and a knowledge of various programming paradigms.\nYou have focused on delivering impactful results that consumers benefit from in a blockchain ecosystem.\nYou have experience with architecture and design of blockchain solutions through deep knowledge of Solidity and the Ethereum Virtual Machine.\nProfessional TypeScript experience.\nExperience writing smart contracts in a professional capacity.\n\nYou’ll love working here because of:\n\nOur People. You will be working with the top players who are the most enterprising, fun, encouraging, and innovative heads and teams. Aka, people you can be proud to work with!\nOur Mission. We believe that we are building something great and that the finest things we create will make the world a better place. Our goal is to deepen our relationship through experiences to fans and collectors globally.\nPerks. Our team-based culture provides the foundation for people to do their greatest work and constantly learn and grow. We offer a full slate of benefits, including competitive salaries, stock options, health coverage, and unlimited vacation. Given that we’re an early-stage startup, our benefits package continues to evolve as we do. Your ideas and suggestions matter to us!\n\nOur Core Values\n\nTrust. We safeguard the goal. We believe we will only succeed if we earn trust – trust of our people, trust of our customers, trust of our partners. We will aim to achieve and keep faith at all times.\nInnovation. We dream big. We’re endlessly curious and constantly searching for the best, the better, and the never-before imagined.\nExcellence. We take big swings. We have high expectations of ourselves in everything we do.\nGrit. We drive past the finish line until the last second. Giving up is not an option. We will always find a way.\nInclusion. We are a team player, and we are in it together. We believe that diverse thinking comes from different thinkers, and we need all perspectives to come together and win.\nAuthenticity. We are the real deal and always authentic in what we create, our dealings with others, and in who we are as human beings.\nAccountability. We carry the ball. We hold ourselves to the highest moral and ethical standards. We will be fair and honest and take responsibility for our actions.\n\nTotal Compensation Range (Base + Equity): 150k-225k per year\n\nOur compensation package currently breaks down into a base salary and an equity component for all employees. The candidate’s seniority and the evaluations made of that candidate during the interview process determine compensation.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","blockchain","solidity","ethereum"]},{"job":"Product Design Manager","company":"Anchorage Digital","location":"United States","post_date":"6d","link":"https://web3.career/product-design-manager-anchorage/39871","key":"39871","details":"Product Design Manager\nRemote – United States /\nDesign /\nFull-Time Remote\n\nApply for this job\nAt Anchorage Digital we are building the world’s most advanced digital asset platform for institutions to participate in crypto.\n\n\nFounded in 2017, Anchorage Digital is a regulated crypto platform that provides institutions with integrated financial services and infrastructure solutions. With the first federally chartered crypto bank in the US, Anchorage Digital offers institutions an unparalleled combination of secure custody, regulatory compliance, product breadth, and client service. We’re looking to diversify our team with people who are humble, creative, and eager to learn.\n\n\nWe are a remote-first, global team, but provide the option of working in-office in San Francisco, New York City, Indianapolis, Sioux Falls, Porto, and Singapore.\n\n\nThe Design department at Anchorage Digital develops a deep understanding of the products we build and the problems we solve in order to create new patterns that meld traditional financial workflows with the world of crypto.\n\n\nWe design solutions to questions with no precedent for institutional users. How do we make the experience of sending funds secure, but also highly efficient? How do we balance the human need for privacy with the open and transparent nature of the blockchain? How do clients express their opinion in on-chain proposals with the newest digital assets?\n\n\nYou will lead a team of designers that are intentional, collaborative, and relentlessly curious, to play a core part in fostering design at our fast-growing company. This is a rare opportunity to help shape the future of the financial world by defining the way institutions (all over the world) interact with digital assets.\nAs a Product Design Manager, you will...\nLead and grow a team of high performing designers working across multiple inter-related product lines.\nImprove and institute lightweight and effective design processes.\nCollaborate cross-functionally to research and define user problems, shape our strategy and help your team ship great experiences.\nInstill and ensure design principles throughout the product: security, usability, simplicity.\nSwitch to hands-on mode if needed to help your team deliver.\nWork closely with Product and Engineering counterparts to craft the product vision, roadmap, and execution priorities.\nEffectively communicate design strategies, concepts, and solutions to peers, partners, and stakeholders throughout the organization.\nUphold a company culture where Design, Product, and Engineering are valued equally.\nYou may be a fit for this role if you have:\nLead design teams in a similar Product Design management position\nExperience with end-to-end product design and shipping products to customers\nExperience working cross-functionally in an organization with many stakeholders\nAn understanding of design’s relationship to business goals\nA high degree of emotional intelligence and great communication skills\nCapacity to embrace change in growth environments with complex product challenges\nSome special combination of the following: creative, humble, detail-oriented, self-aware, curious, thoughtful, and tenacious\nAlthough not a requirement, bonus points if:\nYou have experience working with financial products\nYou have kept up to date with the proliferation of blockchain and crypto innovations\nYou were emotionally moved by the soundtrack to Hamilton, which chronicles the founding of a new financial system\nAbout Anchorage Digital: Who we are\n\n\nThe Anchorage Village, what we call our team, brings together the brightest minds from platform security, financial services, and distributed ledger technology to provide the building blocks that empower institutions to safely participate in  the evolving digital asset ecosystem. As  a diverse team of more than 300 members, we are united in one common goal: building the future of finance by providing the foundation upon which value moves safely in the new global economy. \n\n\nAnchorage Digital is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.\n \nAnchorage Digital is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","design","non-tech"]},{"job":"Software Engineer FullStack Matcha","company":"0x Labs","location":"San Francisco","post_date":"6d","link":"https://web3.career/software-engineer-full-stack-matcha-0x/39870","key":"39870","details":"COMPANY\n\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We’re a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we’ve made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe’re a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We’ll consider your application regardless of where you call home.\n\n\n\nYOUR ROLE AS A FULL STACK ENGINEER\n\n0x protocol is the exchange infrastructure for the internet. It is governed by the 0x DAO community which is, in large part, composed of ZRX token holders. Other stakeholders contribute and participate in the protocol public life: 0x integrators, Market Makers, blockchain analysts, analytics products, investors, and other 0x enthusiasts. The current product suite that these audiences most commonly use includes 0xTracker, ZRX Portal, and the institutional 0x.org website. In joining the Platform team, you’ll own the end-user experience for these interfaces, giving 0x stakeholders the power to govern and benefit from the 0x open protocol.\n\n0xTracker started off as a community-driven effort and rapidly established itself as the most reliable source of truth for 0x network adoption and growth. Is it currently visited by thousands of users daily. We have aggressive goals to make it become the reference data tool for decentralized exchange data. It will become a cornerstone of 0x’s go-to-market as well as we believe that there’s no better way to craft narratives than with data.\n\nZRX Portal — the hub for ZRX token holders — was launched in beta in early 2020. Here, community members can create and vote on protocol and Treasury proposals. In April, we launched a 0x Communal Treasury (worth several $M), fully governed by the ZRX holders community via the ZRX Portal. ZRX Portal currently attracts tens of thousands of 0x enthusiasts monthly.\n\nYou’ll serve as the primary owner of one or more of these products, joining a nimble but fully-fledged team (Full-Stack engineer, Designer, and Product Manager). You will enjoy ample whitespace to spread your wings and innovate, while getting guidance and support to do so effectively. You’ll also have the opportunity to collaborate with other Front-End engineers at 0x Labs (e.g., the team working on matcha.xyz), with whom you’ll help us push forward the frontiers of web3.\n\nTECH STACK\n\nWe don’t care much about your experience with our stack (or any specific stack); we care far more that someone has solid fundamentals, is generally intelligent, has strong learning agility, and is an overall upstanding human. We understand it takes time to ramp, and we’re happy to invest with the right person if necessary.\n\nThat said, we’re excited about the rapidly evolving tech we’re building on. It includes:\n\nNext.js\nReact (we use Hooks heavily!)\nTypeScript\nreact-spring and react-use-gesture for high-performance animations and interactions\n>\nAlchemyAPI and ethers 5.0 for interacting with Ethereum\nVercel for continuous deployment and infrastructure\n\nRESPONSIBILITIES\n\nCreate trustworthy user experiences by building, testing, and shipping features that are simple, intuitive, performant, and reliable\nOwn entire product suite from specification to shipping\nWork effectively with a high degree of autonomy, within a collaboratively minded team\nKeep abreast of the nascent and rapidly evolving blockchain space, and introduce innovative tools and products\nCollaborate cross-functionally with other teams, including engineering (internal and external), design, research, data science, product management, executive leadership, and recruiting\nBe a steward and influencer of our early engineering culture\n\nREQUIREMENTS\n\n5 years+ as Senior Software Engineer\nExperience with modern JavaScript\nExperience with React\nExperience with CSS/HTML\nPassion for the benefits of decentralization and the 0x mission\nExhibit our core values: do the right thing, consistently ship, and focus on long-term impact\nBachelor's or equivalent experience\n\nPREFERRED\n\nProficiency with TypeScript\nExperience optimizing front-end performance (we take application performance very seriously)\n\nBENEFITS\n\nCompetitive salary and equity with occasional cryptocurrency-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA for U.S.-based employees\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nFlexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office conveniently located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco’s Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","react","ethereum","nft"]},{"job":"Technical Product Marketing Manager Decentralized Networks","company":"Consensys","location":"Remote","post_date":"6d","link":"https://web3.career/technical-product-marketing-manager-decentralized-networks-consensys/39869","key":"39869","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout Infura\n\n\nInfura is the leading infrastructure platform providing scalable and easy-to-use APIs and cloud solutions for blockchain and decentralized application developers. Infura currently offers APIs for Ethereum, IPFS, and other leading decentralized networks, allowing developers to immediately begin building instead of spending time on architecting and maintaining their own infrastructure.\n\nInfura provides developers instant access to decentralized and blockchain networks without the need to sync or understand complicated peer to peer infrastructure. Similar to how one might access a cloud service to alleviate the friction of owning proprietary compute and storage, Infura lowers the barrier to entry for engineers to begin building.\n\nWe believe in a more equitable and decentralized future, and we know developers will be at the forefront of that progress. We want to empower developers to spend their time building, creating, and evolving by providing them with the best and easiest solution to their infrastructure needs.\n\nSome things to know about the Infura team: we are a remote first company, with team members all over the world. We strive to reduce meetings, respect work life balance, promote diversity, and generally be good people. We depend on each other not only to make an amazing product but to be a group that wants to succeed together.\n\nAbout the Role\n\n\nDevelopers are the backbone to innovation and make the Web3 ecosystem tick. We are growing rapidly and seeking a Product Marketing Manager who loves to blend deep technical knowledge with storytelling for a developer audience. Working closely with our Product team, you will focus on increasing adoption and help advance our mission of decentralization, bringing more developers and innovation into the Web3 ecosystem. You will be responsible for our decentralized network products, including IPFS and a new decentralized infrastructure network.  \n\nThe ideal candidate has experience working on product-led growth opportunities ideally at the intersection of infrastructure technology, developer tooling, and blockchain technology. You must have a passion for the crypto space, market analysis and positioning, and running go-to-market strategy and campaigns for technical audiences such as engineers and product managers. \n\nWhat you’ll do\n\nBuild a deep understanding of our technical personas in order to effectively onboard, excite, and show value to them within the realm of decentralized networks\nConduct competitive analysis to influence product roadmap decisions and vision for IPFS and the new decentralized infrastructure network\nDevelop differentiated messaging and positioning based on a deep understanding of our target personas’ top goal and challenges, and bring it to life in launches, content, campaigns, events, enablement, and more\nCreate technical product marketing materials, including videos, whitepapers, presentations, web content, and more\nIncrease adoption of new and existing products and features by collecting quantitative and qualitative data on usage and adoption patterns\nPartner with Product Management and Engineering to understand product roadmap and upcoming releases to drive and implement release marketing efforts across users, partners and internal teams\nPartner closely with other Product Marketers to develop and lead internal content including sales enablement training, FAQs, and cheat sheets\nCollaborate with our developer evangelists to educate developers and infrastructure providers on our product capabilities and value via online and in-person events\nCollaborate with our community managers to build our presence across technical forums like Stackoverflow, Discord, Reddit, and Hackernews\nContribute to marketing strategy and messaging, and help maintain technical accuracy of marketing messages\n\nWould be great if you brought this to the role\n\nStrong experience as a technical product marketing manager with a deep understanding of the motivations of technical audiences\nA proven track record of your ability to understand technical personas and build adoption and engagement of new and existing product lines\nTechnical aptitude, curiosity, and a keen understanding of the Web3 blockchain software ecosystem and its technical audiences\nExperience crafting compelling positioning, messaging and thought leadership content\nHands-on capability to build a range of marketing assets, including succinct slide pitch-decks, eBooks, demo videos, and event/webinar content.\nAbility to effectively influence both internal and external stakeholders across all levels of the organization\nProven track record of performing well in a fast-paced environment\nOutstanding organizational skills to define and manage multiple projects with tight deadlines effectively within a fast-paced environment.\nBe innovative with your marketing approach in reaching out to our audiences as well as in engaging them frequently\nBonus: we love crypto natives and degens.\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $118,000-190,000.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","remote","ethereum"]},{"job":"CRM Associate","company":"Consensys","location":"Remote","post_date":"6d","link":"https://web3.career/crm-associate-consensys/39868","key":"39868","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout marketing\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and prizes ourselves on being defiantly optimistic.\n\nAbout the role\n\nWe’re looking for someone who has a great eye for detail, is organized, loves all things data and is goal-orientated. Experience working can work in a fast-paced environment is key, along with the ability to juggle and execute multiple projects at once.\n\nWhat you’ll do\n\n\nOwn marketing analytics and reporting, taking responsibility to build out capabilities significantly from our current setup\nImprove intelligence of marketing automation and customer personalization by bringing together customer data and insights with information on customer product usage, other engagement data and much more\nManage attribution and engagement reporting using tools  such as Google Analytics, HubSpot, Salesforce Sales Cloud and more\nWork with the Marketing team to develop and maintain processes and workflows that improve customer experience and help maximize revenue opportunities.\nTechnical management, maintenance and development of Hubspot and the MarTech stack \nCreation and maintenance of collective data dashboards, graphs and visualization using Martech Stack  \nProvide marketing and business leadership with key performance data - revenue, reach, RoI and more\nExecuting marketing campaigns for ConsenSys brand and product entities\n\nWould be great if you brought this to the role\n\nPractical knowledge of analytical tools used to optimize online activities, including HotJar, Google: Analytics, Tag Manager, Search Console, Data Studio, Mixpanel etc)\nAbility to assist marketing verticals on the performance of online properties, including visits, clicks, conversions, retention, churn and more\nHighly numerical, research and analytical skills\nAdvanced in Excel / Google sheets formula knowledge. (pivots, functions: vlookup, countifs, sumifs etc)\nAnalyzing data and making strategic recommendations to the internal team\n+3 years experience of working in marketing operations, in business or revenue operations with a marketing focus, or in a marketing team, ideally at a start-up or scale-up\nBe a proficient communicator, comfortable interacting and engaging throughout the organization\nBe naturally driven and work to high standards while being pragmatic and delivery focused\nBachelor's degree in business, marketing, mathematics, statistics or related field\nDetail-oriented but always cognizant of the bigger picture and the business strategy\n\nBonus Points for: \n\nA deep understanding of blockchain technology and Ethereum Ecosystem\nExperience working for a blockchain or cryptocurrency organization\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $81,000-115,000.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["crm","remote","ethereum"]},{"job":"Remote Solidity Developer","company":"Phaxis","location":"TX Richardson US","post_date":"6d","link":"https://web3.career/remote-solidity-developer-phaxis/39866","key":"39866","details":"Must Haves\n- Strong Solidity dev experienceBuild their new core platform's smart contracts using Solidity\n- Strong CS fundamentals\n- Blockchain/DLT/Crypto experience\n\nPlusses\n- working on EVM-compatible applications\n\nDay-to-Day: will be building new smart contracts for the base layer core platform using Solidity - will be part of the new 'smart contracts' team\n\n\nAbout The Role:\nThe Smart Contracts team is looking for engineers who can contribute to services on the backend with Solidity.\n\nDevelop new core features and components of new smart contracts\nImplement and enhance smart contract services on network nodes that exposes EVM features\nImplement and enhance the EVM and web3 focused API services and tools\nDesign and implement Ethereum Remote Procedure Call APIs\nDevelop sample applications to demonstrate value and strength of the platform. Sample applications will include web, mobile, and embedded development\nInvestigate E2E smart contract transaction execution details between the ledger and the API services\nBe a strong and proficient hands-on programme\nSkills Needed:\nExperience writing and debugging smart contracts for an EVM based ledger\nExperience with distributed applications and web3 tools\nGood understanding of the Ethereum blockchain and ecosystem\nExperience with blockchain protocol development is a plus\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","dev","solidity","ethereum"]},{"job":"Senior Account Manager 0x API web3","company":"0x Labs","location":"San Francisco","post_date":"6d","link":"https://web3.career/senior-account-manager-0x-api-web3-0xlabs/39865","key":"39865","details":"Company\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We're a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we've made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe're a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We'll consider your application regardless of where you call home.\n\n0x API\n\n0x API is liquidity infrastructure for the internet. It provides developers seamless access to aggregated liquidity, enabling the future of Decentralized Finance applications on Ethereum as well as other blockchain networks. The 0x API is designed to make it easy for developers to tap into DEX liquidity in a fast, reliable, and easy to use way so they can focus on what matters: their product.\n\nTens of companies of all sizes — from public companies like Coinbase and GameStop to DeFi native applications like Matcha and Zapper — use 0x API to enable trading, investing and portfolio management. Since launch in early 2020, 0x API has facilitated over 40 million trades from nearly four million unique users — adding up to more than $100B in traded volume.\n\nAs a web3 Senior Account Manager on the 0x API team, you'll play a key role in growing our user base as well as keeping our growth metrics up and to the right. You'll also work closely with an amazing interdisciplinary group including Business Development, Product and Marketing.\n\nYOUR ROLE AS A WEB3 SENIOR ACCOUNT MANAGER FOR 0x API\n\n0x API is one of 0x Labs long term bets to grow access to decentralized markets and smart contracts. This means establishing and growing 0x API as the liquidity infrastructure for the internet and onboarding the next wave of DeFi developers and builders. In this role you will be responsible for working with our existing integrators to help them ideate and execute strategies to reach their growth targets using our products.\n\nWho You Are\n\nYou are a professional dot-connecter, both in the context of business strategy and human relationships. You quickly grasp unique business models, needs, and constraints, and are effective in communicating solutions and illustrating their trade-offs. You have a thorough understanding of the blockchain/cryptocurrency market that's rooted in genuine passion, including its projects, leaders, and community.\n\nResponsibilities\n\n\nBuild long-term relationships with our enterprise clients and position 0x as the preferred partner among clients through deep understanding of their priorities, needs and business processes\nBecome a thought partner to our enterprise clients and work with them on strategies that leverage our product offering to help them reach their user and volume growth goals\nFollow up on projects and strategies for each of client, being accountable for growing 0x API users and volume growth through existing business relationships\nSupport the Product and Engineering teams through feedback to enable new product capabilities\n\n\nRequired\n\n5+ years of experience in business development, account management, or related disciplines at a top technology and/or finance company, with some time spent working closely with external teams on product partnership efforts\nTechnologically savvy with a broad understanding of business models and product use cases\nEffective, succinct verbal and written communication skills, with the ability to tailor messaging to a broad set of audiences from varied professional, cultural, and technical backgrounds\nAbility to operate in ambiguity with a high degree of autonomy, balanced by excellent cross-functional communication\nRigorous research and project management skills\nAdherence to a strong code of ethics, and the ability to balance the best interests of 0x, our community, and external projects\nAbility to use strategic frameworks to build processes from scratch\n\n\nPreferred\n\nTechnical or software engineering background.\nEnthusiasm for and knowledge about decentralized finance, 0x and other blockchain technologies.\n\n\nBenefits\n\nCompetitive salary and equity with occasional cryptocurrency-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA for U.S.-based employees\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nFlexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office conveniently located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco's Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","account","manager","api","ai"]},{"job":"Crypto FA role Fundraise—Web3.0 Project","company":"CALDANCE","location":"San Francisco","post_date":"6d","link":"https://web3.career/crypto-fa-role-fundraise-web3-0-project-caldance/39864","key":"39864","details":"Job description\n\nCALDANCE (https://caldance.io) is a Fitness-to-earn web 3.0 project that perfectly integrates Web2 fitness equipment as crypto mining machines and Web3 Gamefi models created by a solid funding team of serial entrepreneurs, engineers/blockchain programmers/international sports marketers.\n\nWe have closed a private round plus the second round of strategic investors of Crypto funding and there is still some room left for other Crypto related investors/VC to invest in the project. We need VC that has a good reputation in the Web3.0/Crypto world.\n\nRequirements:\n\n\n\n\n1. It’s a Crypto FA role. You'll personally know family offices, venture capital firms, or crypto whales with resources and reputations on the market where we can pitch the project directly. And you'll help coordinate those meetings. As a FA role which means that we need the candidate to connect us with potential investors and we will pay by successful investment on a commission basis.\n\n2. You have a lot of experience in capital raising and even better raising funds for crypto projects.\n\n\n\n\nNice to haves:\n\n3. You'll be able to help us with our investment pitch and our pitch deck\n\n\n\n\nIf this post resonates with you and you have the contacts/experience, then we want to work with you.\n\n\n\n\nPlease be prepared to:\n\n1. Demonstrate you have a network of investors\n\n2. Demonstrate who and how much you've helped raise\n\nPlease check https://caldance.io for more information\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["crypto"]},{"job":"Automation QA Engineer","company":"Crypto.com","location":"Hong Kong","post_date":"6d","link":"https://web3.career/automation-qa-engineer-crypto-com/39863","key":"39863","details":"We are looking for several QA Engineers to work on groundbreaking ** DeFi and GameFi / Web3 projects** with an initial focus on:\n\nAutomating regression testing for core flows for each decentralized application to free up time for manual QAs\nAdding testing suite to our custom subgraphs\nAdding testing for the backend and bots we have running\n\nResponsibilities:\n\nDevelop and execute test plans and test cases with a strong emphasis on using code to solve technical challenges and shorten the test cycle through automation.\nEstimate test efforts, analyze and communicate test results and participate in day to day QA Activities.\nDevelop/maintain and improve the test frameworks, tools and technologies used by the organization to maintain a high quality bar.\nWork with Development, Test and Product Management to design and implement test and validation strategies.\nExecute and manage test cases and results, report on test and defect metrics.\nCreate, execute and troubleshoot automated test scenarios across our systems.\nContribute to robust, scalable, and high quality test automation solutions for functional, regression and performance testing\nContribute to the building of a Continuous Integration (CI) environment and ongoing process improvement activities.\nIdentify required improvements in the test and development processes; make contributions to our automation tools that address specific needs.\nMaintain a high quality bar in a complex and constantly evolving workspace.\n\nRequirements:\n\nExperience with web testing and automated test techniques with a strong focus on quality throughout the entire software development cycle.\nProgramming skills in javascript / typescript language.\nProven ability to translate functional requirements and use cases into working test plans and test cases.\nStrong customer focus, excellent problem solving and analytical skills. Strong verbal and written communication skills.\nPassion for improving code quality through interaction with the development team.\nSome knowledge of continuous integration practices, preferably using CircleCI.\nFamiliar with AWS cloud.\nExperience in Cypress is preferred.\nExperience with DeFi applications is a plus.\nExperience with smart contract and graphQL is a plus.\nExcellent communication skills in English. Fluency in Mandarin is a plus.\n\nCrypto.com focuses on Information Services, Internet Infrastructure, Cryptocurrency, and Blockchains. Their company has offices in Hong Kong, Singapore, and United States. They have a very large team that's between 1001-5000 employees.\n\nYou can view their website at https://www.crypto.com/en/index.html or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","quality","assurance","javascript"]},{"job":"Full Stack Blockchain Developer","company":"CleAth","location":"India","post_date":"6d","link":"https://web3.career/full-stack-blockchain-developer-cleath/39862","key":"39862","details":"We are looking for someone who is fascinated about the change which blockchain technology can bring to the world.\nWe are still at the ideation phase and looking for someone who can join as a founding engineering team member and lead the development of the initial phase along with the founders.\nThere is a fantastic opportunity to work and create something magnificent from the ground up. We can't promise a great salary at this stage, but that will be compensated by lucrative equity in the business.\n\nCleAth focuses on Blockchains, Full Stack Startup, and Blockchain / Cryptocurrency. Their company has offices in Noida. They have a small team that's between 1-10 employees.\n\nYou can view their website at http://cleathinstealth.com\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","blockchain"]},{"job":"Product Manager","company":"Harmony","location":"Palo Alto","post_date":"6d","link":"https://web3.career/product-manager-harmony/39860","key":"39860","details":"Product Manager\nOn-site – Palo Alto, CA /\nBusiness /\nBusiness\n\nApply for this job\nHarmony is an open and fast blockchain. Our mainnet runs Ethereum applications with 2-second transaction finality and 100 times lower fees. We are an open platform for your assets, collectibles, identity and governance.\n\n\n🚀 Building a (Rocket)Ship\nWe are a Day-1 startup. Blockchains are becoming the foundation of the global economy, yet their adoption is at only 1%. That means that you as a pioneer and developer are shaping the future with 10X impact. Harmony is a community-driven project, a network with hundreds of applications, and a team wearing crazy ambitions on their sleeves. Because the invincible summer awaits!\n\n\nFor engineers, we value your deep understanding of how bytes work. You are a tool maker, a system hacker, and a math nerd all in ONE. Your typical day involves prototyping a top-conference research paper, debugging and profiling in hexdecimal, or writing updates to coordinate asynchronouly with tens of engineers in the open. Building a blockchain is like jumping off the cliff while assembling the plane engine on the fly – but, if you can thrive in chaos, why NOT?\n\n\nFor creatives, we approve your obsession with user experience. You are a product designer, a brand manager, and an industry analyst all in ONE. Your typical day involves studying what delights and what hurts through hard metrics, writing long-form narratives on the why's and the do's, or scrumming tasks for a product launch to iterate with millions of users. Building a community is like sharing your blue heart while keeping the culture alive for decades – but, if this is your dream of 50 years, start NOW?\n\n\n💙 See Harmony’s Culture and Values on \"Empathy, Passion & Excellence\".\nResponsibilities\nDevelop strategies with market fit, economics design, technical features\nDrive deliverables of prototype iterations, launch campaigns, user feedback\nEngage ecosystem of community members, external developers, industry partners\nRequirements\nNo prior experience necessary.\n5 days full-time in office (Palo Alto, CA) and off-hour emergency.\nExceptional communication and people skills.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","ethereum"]},{"job":"Senior Treasury Analyst","company":"Ripple","location":"San Francisco","post_date":"7d","link":"https://web3.career/senior-treasury-analyst-ripple/39857","key":"39857","details":"We are looking for a dynamic, highly analytical and collaborative individual to join our growing Treasury team at Ripple. The Senior Treasury Analyst will be involved in all aspects of global treasury operations and will support critical initiatives to facilitate the expansion of the company’s financial infrastructure.\nReporting to the Senior Treasury Manager, this position will be responsible for global cash positioning, forecasting and reporting, bank and exchange onboarding, insurance and project management. This individual will collaborate daily with cross-functional team members and Ripple’s external partners.\nTo Be Successful In This Role\n\n\nYou will be highly organized, detail oriented, and able to frequently assess and reorder priorities\nYou demonstrate initiative, provide complete follow-through on areas of responsibility and seek opportunities for process improvement\nYou also possess effective communication and problem-solving skills, and are able to learn new concepts quickly\nYou have a genuine interest in digital payments and the blockchain industry\nYou never hesitate to ask questions, offer solutions, and collaborate with your team members\n\nWhat You Will Do\n\nCash Forecasting - Prepare and analyze daily cash positions, ensuring adequate liquidity is available to meet global financial obligations. Provide support in short and long-term cash forecast modeling, development of reporting that ultimately drives decision making at the leadership level.\nCash Positioning and Reporting - Prepare, assess, and record cash flow transactions. Ensure adequate liquidity to meet global financial obligations. Own high-level business reporting.\nGlobal Onboarding - Own global account / exchange management, including opening/closing accounts, portal administration, KYC, signatory updates, and FBAR Reporting.\nPayment Operations - Provide support to Accounting, Fin. Ops, Tax, Compliance, Crypto Ops, and other cross-functional teams, as it relates to Treasury matters.\nProject management - Maintain treasury management system and provide support for operational improvement, including scalability, system connectivity and automation. Support and maintain organization of other ad hoc Treasury-related projects\n\nWhat We Are Looking For\n\n4+ years of progressive experience in a Global Treasury function\nExperience with domestic, cross-border, FX, and digital asset payments\nStrong analytical skills and meticulous attention to detail\nStrong organizational and communication skills\nAdvanced proficiency in Excel and Google Sheets\nAbility to rapidly respond to changing priorities\nProven ability to self-direct and is proactive\nSQL preferred\nBachelor’s degree in Finance, Economics, Business Administration, additional degrees/certifications a plus but not required\n\nWho We Are\nRipple is doing for value what the internet did for information: enabling its instant and seamless flow around the world. We call this the Internet of Value (IoV). Using blockchain and cryptocurrency technology, Ripple is dedicated to creating powerful gains in financial efficiency, equity and inclusion. In addition, Ripple is developing and enabling the future use cases that will catalyze the new digital economy for governments, businesses and consumers.\nRipple has offices in San Francisco (HQ), New York, London, Mumbai, Singapore, São Paulo, Toronto, Reykjavík, Washington D.C. and Dubai.\nWHAT WE OFFER – The resources and support to be your best at work and beyond:\nDo Your Best Work\n\nThe opportunity to build in a fast-paced start-up environment with experienced industry leaders\nA learning environment where you can dive deep into the latest technologies and make an impact. A professional development budget to support other modes of learning.\nThrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team.\nRipple is Flexible First: you have the option to work remotely, from our offices, or a combination of the two within the 11 countries we are located around the world.\nWeekly all-company meeting - business updates and ask me anything >\nWe come together for moments that matter which include team off-sites, team bonding activities, happy hours and more!\n\nTake Control of Your Finances\n\nCompetitive salary, bonuses, and equity\nBonus Flexibility Program: Participants in the Corporate Bonus Plan have the option to elect to receive their annual bonus in cash, equity or XRP, or a combination.\n100% paid medical and dental and 95% paid vision insurance for employees starting on your first day\n401k (with match)\nCommuter benefits\nEmployee giving match\nMobile phone stipend\n\nTake Care of Yourself\n\nTwice a quarter R&R days so you can rest and recharge\nGenerous wellness reimbursement and weekly onsite & virtual programming\nFlexible vacation policy - work with your manager to take time off when you need it\nIndustry-leading parental leave policies. Family planning benefits.\nCatered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events\n\nBenefits listed above are for full-time employees. Interns - please discuss benefits with your recruiter.\nRipple is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.\nPlease find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","senior"]},{"job":"Technical Support Specialist API support","company":"Binance","location":"Buenos Aires","post_date":"7d","link":"https://web3.career/technical-support-specialist-api-support-binance/39855","key":"39855","details":"Technical Support Specialist (API support)\nRemote – Argentina, Buenos Aires /\nCustomer Support – Customer Support /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities\nManage and provide support for backend applications including API integration to our platforms\nConfigure and troubleshoot issues received from users via our Zendesk ticketing system\nEscalate issues based on comprehensive reporting of one’s work, and analyze the business requirements and feedback from others to create and maintain documentation\nCoordinate with local team members to provide technical support, maintenance and resolution of issues\nRequirements\nFluent ability in English and Portuguese or Spanish\nSome programming background is a big plus\nBachelor’s degree or higher in a technical field (Computer Science a big plus)\nKnowledgeable in hardware and software applications, installation, configuration, and maintenance of the data warehouse; and operating systems such as Windows/Linux/iOS\nPrior exposure to data warehouse, prior experience working in IT Services or B2B after-sale service\nStrong logical and analytical mindset with a high sense of responsibility and teamwork is a must\nAble to work under pressure and solve problems independently whilst holding strong communication skills\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["api","customer","support"]},{"job":"Market Surveillance Global Lead","company":"Binance","location":"Remote","post_date":"7d","link":"https://web3.career/market-surveillance-global-lead-binance/39854","key":"39854","details":"Market Surveillance Global Lead\nRemote – Global /\nLegal & Compliance – Compliance /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a Market Surveillance Global Lead that will build and implement new surveillance capabilities for Binance globally. This person will drive the design of the surveillance infrastructure, and will be responsible for leading and managing the professional development of the team responsible conducting market surveillance of digital asset trading activities.\nResponsibilities\nContribute to the development and evolution of the Market Surveillance department and execute the surveillance monitoring plan, including the continued monitoring and enhancement of surveillance to detect and prevent misconduct, risk assessments and mapping of controls, and market intelligence reporting.\nOversee analysis related to market incidents and responding to inquiries from regulators and stakeholders.\nEnsure issues detected through surveillance activities are escalated, remediated and documented.\nDraft policies and procedures related to market misconduct.\nContribute to the design and development of models to enhance surveillance coverage, including but not limited to various forms of conduct risk, compliance policies, and market manipulation.\nManage ad-hoc reviews of trading activity by analysing complex situations, identifying high risk behaviours, and applying judgment to resolve issues in an efficient manner.\nKeep informed of regulatory, business, and market structure changes globally that impact the surveillance program and continually look for methods to improve coverage and performance.\nRequirements\nPossess exceptional leadership, management,  analytical and communication skills needed for dealing with market participants and internal stakeholders.\n10+ years of industry experience, ideally in financial services compliance, at a financial services regulator, exchange/trading venue or similar experience, with a good understanding of derivatives and trading.\nStrong analytical skills with the ability to break down complex problems into manageable units and develops solutions.\nCan absorb new concepts quickly and apply them pragmatically.\nResults oriented, sets goals and priorities that maximize the use of resources available to consistently deliver quality results.\nOutstanding leadership characteristics with the ability to set direction and motivate others to follow that direction to reach the team’s vision.\nStrong interpersonal and communication skills.\nAbility to identify and cultivate high quality team members.\nHigh ethical standards, respect for confidentiality and privacy.\nProven experience working in a rapidly changing and complex work environment.\nStrong functional knowledge of trade surveillance and exception based monitoring.\nSubstantial knowledge of financial/trading regulatory frameworks.\nDemonstrate a high level of initiative, analytical skills, and impeccable integrity.\nDigital Asset product and market structure knowledge is a plus.\nTableau, Python, and SQL skills are a plus.\nEducation: Bachelor's degree in finance, economics, data science or related field.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead","remote"]},{"job":"JavaScript Fullstack Engineer","company":"Binance","location":"Romania","post_date":"7d","link":"https://web3.career/javascript-fullstack-engineer-binance/39853","key":"39853","details":"JavaScript Fullstack Engineer\nRemote – Romania, Iași /\nEngineering – Backend /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nAs a Full Stack Development Engineer (FSDE) at Binance Data Security, you’ll help to build and manage high performance interfaces for our security platform. You will be on the cutting edge of many security issues for a wide variety of platforms and technologies including cloud services, identity and access management, mobile devices, and virtualisation, all operating at massive scale. You’ll work with data scientists, security engineers, and other software development engineers across multiple teams to design, develop, test, and deliver new frontend features.\nResponsibilities\nDeveloping front end website architecture\nDesigning user interactions on web pages\nDeveloping back-end website applications\nCreating servers and databases for functionality\nEnsuring cross-platform optimisation for mobile phones\nEnsuring responsiveness of applications\nWork on bug fixing, code refactoring and improving application performance\nPractice writing clean and maintainable code according to best practices\nContribute to an agile team that solves complex challenges and builds quality software\nCollaborate with the design team by providing inputs and suggestions on the feasibility of their designs\nSeeing through a project from conception to finished product\nDesigning and developing API\nMeeting both technical and consumer needs\nStaying abreast of developments in web applications and programming languages\nRequirements\nDegree in computer science\n3-5 years of experience\nProficiency with fundamental front-end languages such as HTML, CSS, and JavaScript\nFamiliarity with JavaScript frameworks such as Angular JS, React, and Amber\nProficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net\nFamiliarity with database technology such as MySQL, Oracle, and MongoDB\nExcellent verbal communication skills\nGood problem-solving skills\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","javascript","react","ruby"]},{"job":"Executive Assistant Outercore","company":"Protocol Labs","location":"United States","post_date":"7d","link":"https://web3.career/executive-assistant-outercore-protocollabs/39850","key":"39850","details":"About Protocol Labs\nProtocol Labs drives breakthroughs in computing to push humanity forward. Protocol Labs is a product-development lab, but behind the protocols and tools we build, behind the research and implementations, are passionate people, teammates, and community members. Most teams in the Protocol Labs Network are fully distributed and work remotely around the world. Engineers, researchers, and operators work in the open to improve the internet — humanity's most important technology — as we explore new advances at the intersection of many exciting fields (web3, cryptography, networks, distributed systems) and cultures (startups, research, open-source, distributed work).\nProtocol Labs drives breakthroughs in computing to push humanity forward. Protocol Labs is a product development lab, but behind the protocols and tools we build, behind the research and implementations, are passionate people, teammates and community members. Today, we are focused on how we store, locate, and move information.\nMost teams in the Protocol Labs Network are fully distributed and work remotely around the world. Engineers, researchers, and operators work in the open to improve the internet — humanity's most important technology — as we explore new advances at the intersection of many exciting fields (crypto, networks, distributed systems) and cultures (startups, research, open source, distributed work).\nAbout Outercore\nOutercore is the division of Protocol Labs that leads technical, business, and community programs to build the future of p2p distributed networks and empower our many communities – from decentralized web developers, to browsers, to blockchain projects, to data storage hosts. Everything Outercore does is open source. We’re comfortable sharing unfinished work and trying out new things. The goal is to come up with solutions the entire ecosystem can benefit from.\nAbout This Role\nWe are seeking a dynamic and highly-organized Executive Assistant to support our leadership team’s day-to-day administrative and operational needs, while also contributing to selected strategic projects. If you’re an exceptional communicator with a knack for both people and systems, and are keen to learn and grow, we’d love to speak with you!\nResponsibilities:\n\n\nManage calendars and emails meticulously and thoughtfully.\nOversee all travel (high volume) and expense reports.\nEstablish new—and improve existing—administrative systems and processes.\nContribute to leadership meetings by assisting with the production of materials and pre-reads, taking notes, and tracking action items.\nCoordinate the preparation for and execution of regular team-wide & public meetings.\nMake recommendations for your executives with regard to their time management, prioritization, and organization.\nSupport and celebrate teammates by shipping swag and gifts, celebrating employee birthdays and national holidays, and promoting wellness. Help people feel energized to be here!\nAssist with ad hoc projects, events, and travel arrangements as needed.\n\nWhat We’re Looking For\n\nYou are incredibly organized, with superb attention to detail and a strong ability to execute.\nYou are adept at handling sensitive information and situations with care and confidence.\nYou communicate, perform, and react well under pressure or ambiguity.\nYou enjoy optimizing processes to make them more efficient, and you’re an expert in many modern open collaboration tools such as Google Apps, Notion, Zoom, Discord, Slack, Github, Discourse, and more.\nYou are able to anticipate and respond to the needs of others before they arise.\nYou have at least 2 years of experience in administration or operations in a fast-growing or large company.\n\nBonus points\n\nExperience in a high-growth technology startup\nInterest in open source software, decentralized web, or web3 technologies\nExperience with global, multi-cultural teams or communities\n\nWhat’s it like to work at Protocol Labs?\nProtocol Labs' mission is to improve humanity’s most important technology, the Internet. We build protocols, systems, and tools to improve how it works. Today, we are focused on how we store, locate, and move information. Our projects include IPFS, Filecoin, libp2p, and more.\nAs a distributed team, we hire anywhere in the world, and at various levels of experience (entry, senior, staff). We look for people with unique perspectives and diverse backgrounds.\nWe have a great benefits package, including parental leave, contributions to your retirement, competitive pay, and unlimited time off. For U.S.-based employees, we also provide platinum-level health, dental, and vision coverage for you and your family.\nIf you’re passionate about the future of computing and a more democratized internet, we want to talk to you.\nGDPR for Job Applicants and Candidates\nWhen you apply to a job on this site, the personal data contained in your application will be collected by Protocol Labs, Inc. (“Protocol Labs”), which is located at 427 N Tatnall St #51207, Wilmington, Delaware 19801 and can be contacted by emailing legalrequests[at]protocol.ai. Protocol Labs’ data protection team can be contacted via legalrequests[at]protocol.ai. Your personal data will be processed for the purposes of managing Protocol Labs’ recruitment related activities, which include setting up and conducting interviews and tests for applicants, evaluating and assessing the results thereto, and as is otherwise needed in the recruitment and hiring processes. Such processing is legally permissible under Art. 6(1)(f) of Regulation (EU) 2016/679 (General Data Protection Regulation) as necessary for the purposes of the legitimate interests pursued by Protocol Labs, which are the solicitation, evaluation, and selection of applicants for employment.\nYour personal data will be shared with Greenhouse Software, Inc., a cloud services provider located in the United States of America and engaged by Protocol Labs to help manage its recruitment and hiring process on Protocol Labs’ behalf. Accordingly, if you are located outside of the United States, your personal data will be transferred to the United States once you submit it through this site. Because the European Union Commission has determined that United States data privacy laws do not ensure an adequate level of protection for personal data collected from EU data subjects, the transfer will be subject to appropriate additional safeguards.\nYour personal data will be retained by Protocol Labs as long as Protocol Labs determines it is necessary to evaluate your application for employment or to assist in the hiring process. Under the GDPR, you have the right to request access to your personal data, to request that your personal data be rectified or erased, and to request that processing of your personal data be restricted. You also have the right to data portability. In addition, you may lodge a complaint with an EU supervisory authority.\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","react"]},{"job":"OnChain Data Analyst","company":"OpenSea","location":"United States","post_date":"7d","link":"https://web3.career/on-chain-data-analyst-opensea/39849","key":"39849","details":"OpenSea is the first and largest marketplace for non-fungible tokens , or NFTs. Applications for NFTs include collectibles, gaming items, domain names, digital art, and many other items backed by a blockchain. OpenSea is an open, inclusive web3 platform, where individuals can come to explore NFTs and connect with each other to purchase and sell NFTs. At OpenSea, we're excited about building a platform that supports a brand new economy based on true digital ownership and are proud to be recognized as Y Combinator's #4 ranked top private company.\n\nWhen hiring candidates, we look for signals that a candidate will thrive in our culture, where we default to trust, embrace feedback, grow rapidly, and love our work. We also know how critical it is to celebrate and support our differences. Employing a team rich in diverse thoughts, experiences and opinions enables our employees, our product and our community to flourish. We are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. To help facilitate this, we support remote, hybrid or onsite work at either New York City, San Francisco or the Silicon Valley for the majority of our opportunities.\n\nOpenSea is looking for entrepreneurial Blockchain Data Scientists to work closely with the Marketplace Product & Engineering team. You’ll help us build a high-quality, data-informed primary drop launchpad for creators as well as the most liquid secondary marketplace. You’ll help us drive order optimization, management, and matching in a high-integrity way that helps our buyers, creators, and sellers all achieve their goals while maintaining strong customer outcomes.\n\nThe ideal candidate will be deeply passionate about data & crypto and have the desire to deploy pioneering solutions against large-scale problems. We are seeking candidates who are excited about wearing multiple hats and working closely with engineering and product to bring real solutions to market on fast timeframes, rapidly iterating from imperfect MVP through experimentation and development.\n\nResponsibilities\n\n\nMeasure the liquidity and business impact of all the features the marketplace team ships to ensure best-in-class buyer, seller, and creator experience\nDrive team and company understanding of supply, demand, and competitive dynamics in our marketplace, across all verticals and chains\nBuild and iterate data scoring systems and products that will equip OpenSea and our partner creators with a next-level understanding of how to plan and execute a successful drop, curate and respond to their communities and grow their web3 footprint over time\nWork with business teams to continuously refine, and improve the systems to cater to ever-changing OpenSea needs\nBe a true degen with a deep understanding of OpenSea’s business and the larger NFT marketplace\nHave your ear to the ground and be able to consult on external market dynamics that can help teams all over the company be data-informed in adapting to the ever-changing market\nBe obsessive about data quality and familiar with tools like Etherscan, Dune, and Nansen to be able to ensure the accuracy of your work\n\n\nIf you don't think you meet all of the criteria below but still are interested in the job, please apply. Nobody checks every box, and we're looking for someone who is excited to join the team.\n\nDesired Experience\n\n5+ years of experience in data science, with a strong quantitative background and specific experience in modeling programmatic buying exchanges; and/or forecasting for traditional marketplaces; and/or consumer product classification; and/or personalization and recommendation systems.\nExperience in SQL, Python, Airflow, Mode, and Spark; bonus points for experience with Dune Analytics, Nansen, or other web3 analytics tools like DefiLlama\nExperience communicating effectively up, down, and sideways across the company, with thoughtfulness around optimizing asynchronous communication and tailoring communication to different preferred >\nStrong cross-functional skills and ability to operate under ambiguous and fast-moving problem spaces\n(Nice to have) Bonus points for web3 experience, a love for the community, and/or a degen portfolio\n(Nice to have) Humility, humor, curiosity, resourcefulness and a relentless drive to grow and learn\n\n\nThe base salary for this full-time position, which spans across multiple internal levels depending on qualifications, ranges between $130,000 to $255,000 plus benefits & equity.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","data","science","nft"]},{"job":"Investment Analyst Intern","company":"DoraHacks","location":"United States","post_date":"7d","link":"https://web3.career/investment-analyst-intern-dorahacks/39848","key":"39848","details":"About DoraHacks\nDoraHacks is a global hacker movement and the world’s most active multi-chain Web3 developer incentive platform. More than 2,000 projects from the DoraHacks community have received over $21.5 million in grants and hackathon prizes. DoraHacks.io has around 250,000 active users worldwide. The platform offers hackathons, bounty, quadratic funding, privacy voting, and other community governance/funding toolkits. In addition, over 40 major Web3 ecosystems are currently using Dora infrastructures to fund their open source communities.\nDoraHacks is building the future open source curation market. We believe that by equipping developers with the best tools, connecting them to the right people, we can help the open source community solve the whole world's problems better.\nDoraHacks aims at creating an everlasting hacker movement\nForward-looking: Pioneer the thought process, with revolutionary discovery and solution, never blindly follow the crowd\nLong-term: Think long-term, continuously build and create value in the long-run\nPragmatic: Develop technologies and products that solve the real-world problem\nSupportive: Back in the hacker movement all builders, supporters and contributors\nRespectful: Welcome and collaborate with everyone in the community\nAbout The Job\nDora Ventures is the seed money accelerator of DoraHacks, a global hacker community and one of the largest blockchain developer networks in the world.\nDora Ventures is growing fast and we need an exceptional analyst to join our team. If you aspire to be one of the best cryptocurrency analysts in the world, we want to hear from you. This role will work closely with the Partners to analyze investment opportunities in early-stage hacker projects, pre-launch & liquid digital assets. Come join us, drink from the crypto firehose, and learn about every investable category in crypto. This includes equity deals focused on blockchain infrastructure, in addition to pure token deals focused on decentralized finance, non-fungible tokens, middleware, and more.\nResponsibilities\n\n\nMake cryptocurrency verticals research & token economics and value accrual mechanisms analysis\nDevelop investment suggestions based on the above research and industry trends\nMapping verticals in the digital asset landscape\nExplain key info to Dora Ventures Partners and collaborate with them to get investment insights from the research\nHelp our portfolio companies understand how to maximize the value of our investment\nMaintain and reconcile trade data\n\nRequirements\n\nBachelor's degree or above\nExcellent data analytic skills\nStrong English written and verbal communication skills\nEager to acquire new knowledge with strong learning ability\nProficient in Excel\nPython, R, Matlab, or experience with other analytics tools is a plus\n\nLogistics\nThis is a remote position that can be done from anywhere. Due to the remote nature of this role, we are unable to provide visa sponsorship. Resumes and communication must be submitted in English.\nOur interview process takes place on Google Meeting/Zoom and consists of the following:\n\nTest (Online test/Take-home assignment)\nInitial screen (15 minutes)\nTeam interview (45 mins)\nFinal interview (30-45 mins)\n\nPlease let us know if you require any support for the interview process, and we’ll do our best to provide assistance.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","intern","entry","level","finance"]},{"job":"Social Media Community Intern Binance Accelerator Programme","company":"Binance","location":"Remote","post_date":"7d","link":"https://web3.career/social-media-community-intern-binance-accelerator-programme-binance/39846","key":"39846","details":"Social Media & Community Intern - Binance Accelerator Programme\nRemote – Global /\nInternships – Internships /\nIntern\n\nApply for this job\nResponsibilities:\nConceptualise and implement social media marketing and community engagement\nDevelop plans for social content, social-led campaigns and social content frameworks across the region, working cross-functionally with product, data, sales and design, and other teams\nEngage and build communities through one-on-one as well as one-to-many conversations\nAnalyse social media landscape to supply actionable insight (in real-time) to both the social and greater marketing team with hot topics, breaking news, sentiment/market observations\nOwn and operate multiple official social media and signal channels, as well as the content strategy/output and results for each\nStreamline social media accounts to ensure uniform content and tone of voice\nSource and manage influencers to help drive engagement and brand awareness\nTrack, monitor and understand content performance through insights and analytics\nRequirements:\nMinimum commitment period of 6 months (full-time or part-time)\nNative or bilingual level proficiency in English\nExperience in the blockchain/crypto space is an added advantage\nKeen sense and strong understanding of cryptocurrency related terminologies and trends and liking for crypto culture\nClear and concise >\nWell-versed with Twitter, Facebook, Reddit, and Telegram\nPrior experience with YouTube, TikTok or Discord is an added advantage\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","intern","entry","level","social","media"]},{"job":"Javascript Fullstack Engineer","company":"Binance","location":"Dubai","post_date":"7d","link":"https://web3.career/javascript-fullstack-engineer-binance/39845","key":"39845","details":"Javascript Fullstack Engineer\nRemote – UAE, Dubai /\nSecurity & IT Helpdesk – Security /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nAs a Full Stack Development Engineer (FSDE) at Binance Data Security, you’ll help to build and manage high performance interfaces for our security platform. You will be on the cutting edge of many security issues for a wide variety of platforms and technologies including cloud services, identity and access management, mobile devices, and virtualisation, all operating at massive scale. You’ll work with data scientists, security engineers, and other software development engineers across multiple teams to design, develop, test, and deliver new frontend features.\nResponsibilities\nDeveloping front end website architecture\nDesigning user interactions on web pages\nDeveloping back-end website applications\nCreating servers and databases for functionality\nEnsuring cross-platform optimisation for mobile phones\nEnsuring responsiveness of applications\nWork on bug fixing, code refactoring and improving application performance\nPractice writing clean and maintainable code according to best practices\nContribute to an agile team that solves complex challenges and builds quality software\nCollaborate with the design team by providing inputs and suggestions on the feasibility of their designs\nSeeing through a project from conception to finished product\nDesigning and developing API\nMeeting both technical and consumer needs\nStaying abreast of developments in web applications and programming languages\nRequirements\nDegree in computer science\n3-5 years of experience\nProficiency with fundamental front-end languages such as HTML, CSS, and JavaScript\nFamiliarity with JavaScript frameworks such as Angular JS, React, and Amber\nProficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net\nFamiliarity with database technology such as MySQL, Oracle, and MongoDB\nExcellent verbal communication skills\nGood problem-solving skills\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","javascript","react","ruby"]},{"job":"Blockchain Digital Asset Analyst","company":"Friedman LLP","location":"FL Fort Lauderdale US","post_date":"7d","link":"https://web3.career/blockchain-digital-asset-analyst-friedmanllp/39844","key":"39844","details":"Marcum LLP offers a great career with exceptional benefits.\nThere’s a lot to think about when it comes to launching your accounting career. At Marcum, we offer you a world of opportunity, a highly competitive salary, exceptional benefits, flexible work options, and industry-leading technology, all within an environment that values your contributions and supports your professional growth.\nAt Marcum, eligible associates receive a benefits package that includes health, dental, and vision insurance, short and long-term disability insurance, life insurance, flexible spending accounts, and transit benefits, as well as paid time off, a 401(k) plan with an employer contribution, and a profit sharing plan.\nMarcum Technology has one of the largest Blockchain and Digital Assets Advisory groups in the country and they are looking for a full time Blockchain & Digital Asset Analyst to join their team and work in their Southern Florida offices. Junior through Senior level candidates will be considered. Travel is required.\nMarcum Technology is proud to be at the forefront of this emerging industry, providing blockchain & digital asset services to both domestic and international clients, from start-ups to mature businesses, providing expertise and solutions to enable digital asset and distributed ledger technology companies, to ensure their audit, accounting, reporting, and tax compliance requirements are met. We continue to expand our practice fueled by new client acquisitions and growth of our existing client businesses - growth is limitless!\nThe Blockchain & Digital Asset Analyst must have:\n\n\nFamiliarity with popular digital currency platforms including digital assets, blockchains, exchanges, custodians, wallets, lending platforms, etc and the desire to continue to learn by conducting research on complex topics.\nAt least 1 year of audit/digital forensics experience, or 1 year of a role related to blockchain/digital assets/asset custody, as a developer or an analyst.\nBachelor’s degree in Accounting/Finance, Computer Science, Information Technology, or related field. Certified Bitcoin Professional (CBP), Certified Ethereum Professional (CEP) or similar certifications is a plus.\nExcellent verbal and written communication skills\n\nResponsibilities will include, but are not limited to:\n\nMaintaining an up to date understanding of the digital asset and blockchain technology industry in order to assess trends and their impacts to clients\nPerforming complex reconciliations related to digital asset holdings, cost basis reconstructions, realized/unrealized gains/losses on digital asset holdings.\nAssisting in gaining an understanding of and documenting client digital currency systems, including but not limited to, node setup, wallet structures, key generation and general system understanding\nResearching digital asset and blockchain information as it relates to our clients\nConducting research, consulting with team members, drawing conclusions and preparing memos based on target issues related to blockchain and digital asset\nParticipating in blockchain/digital asset specific projects\nCommunicating with Managers and Partners on work status and client issues that arise\n\nPreferred Qualifications:\n\nMaster’s degree in Accounting/Finance, Computer Science, Information Technology, or related field\nCPA, Certified Bitcoin Professional (CBP), Certified Ethereum Professional (CEP) or similar certifications\nHands on experience using digital asset Exchanges, DeFi Products, Custodians block explorers and various hot & cold wallets\nSoftware Experience – CCH ProSystem, Microsoft Office 365, Advanced Excel, Python, Solidity\n\nMarcum LLP is an Equal Opportunity Employer\nMarcum LLP does not discriminate on the basis of race, ancestry, national origin, color, religion, gender, gender identity, age, marital status, sexual orientation, disability, veteran status, or any other protected classification under the law.\nAre you a search or recruiting firm interested in becoming a preferred recruitment agency? Click here to learn more.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","blockchain","solidity","ethereum","node"]},{"job":"Blockchain Research Graduate Level Summer 2023","company":"Elevance Health","location":"Atlanta","post_date":"7d","link":"https://web3.career/blockchain-research-graduate-level-summer-2023-elevancehealth/39843","key":"39843","details":"Description\nJob Title: Blockchain Research Graduate Level - Summer 2023\nLocation: Atlanta, GA, Indianapolis, IN, Richmond, VA\nStructure: In person\nBe part of our extraordinary team!\nThe Information Technology Intern students will gain real-world work experience in their academic field. During the summer months, interns will engage in challenging projects evolving around the rapidly changing healthcare tech industry. Interns will be paired with industry professionals and mentors and will be given opportunities to stretch their skills and enrich their knowledge base to achieve a greater understanding within Technology. If the intern performs well throughout the internship, there will be opportunities for fulltime employment once the intern graduates.\nSome Of These Activities Include\nInterns will participate in activities to enhance connection to the company as a whole and encourage personal growth.\n\n\nFormal onboarding event for all students to ensure integration to the organization and program\nA one on one mentorship with a leader for the duration of the program\nCadenced Learning series to build student’s acumen and focus on learning the business\nOpportunities to grow and develop through social and networking event\n\nWhat We Are Looking For\nThe Quantum & Future Technology group at Carelon Digital Platforms has an internship opportunity to work on a cutting-edge blockchain use case in healthcare. You will work alongside a team of expert software engineers, systems engineers, and computational scientists. You will be responsible for developing smart contracts pertaining to the use case, deploying them on a private self-hosted blockchain network, and carrying out end-to-end performance testing.\n\nExcellent verbal and written communication\nSuperb problem-solving skills using logic and data\nCritical thinking and analytical skills\nProficiency in technical aspects of computer and software engineering\nAbility to articulate complex technical issues to those not as experienced\nKnowledge of various coding technologies such as, but not limited to Java, JavaScript, React, NodeJs, Angular, Python, R.\nFamiliarity with containerization/orchestration using cloud native stack and associated application design principles\nAbility to convey the problem and solution pictorially using Powerpoint, Miro or other equivalent technologies.\nIntellectually curious self-starters with the ability to work in a fast-paced, flexible team environment\nAdvanced user of Excel, PowerPoint, and Word\nProven analytical skills, excellent written and oral communication abilities\n\nQualifications\n\nPursuing a degree from an accredited college/ university.\nGraduation date between August 2023 to May 2024\nGPA of 3.0 or above\n\nPreferred Skills, Capabilities, And Experiences\n\nUnderstanding and know-how of blockchains infrastructure and platforms, such as, but not limited to Ethereum, Hyperledger, GoQuorum\nFamiliarity with blockchain concepts such as Smart Contracts, Oracles, and ZK Proofs\nFamiliarity with Go, JavaScript/Solidity or any object-oriented compiler-based programming language\nFamiliarity with cloud native orchestration tools such as Kubernetes\nFront-end development experience with popular frameworks such as React, Vue, and Angular.\n\nUpdated 11/10/2023\nPlease be advised that Elevance Health only accepts resumes from agencies that have a signed agreement with Elevance Health. Accordingly, Elevance Health is not obligated to pay referral fees to any agency that is not a party to an agreement with Elevance Health. Thus, any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of Elevance Health.\nBe part of an Extraordinary Team\nElevance Health is a health company dedicated to improving lives and communities – and making healthcare simpler. Previously known as Anthem, Inc., we have evolved into a company focused on whole health and updated our name to better reflect the direction the company is heading.\nWe are looking for leaders at all levels of the organization who are passionate about making an impact on our members and the communities we serve. You will thrive in a complex and collaborative environment where you take action and ownership to solve problems and lead change. Do you want to be part of a larger purpose and an evolving, high-performance culture that empowers you to make an impact?\nWe offer a range of market-competitive total rewards that include merit increases, paid holidays, Paid Time Off, and incentive bonus programs (unless covered by a collective bargaining agreement), medical, dental, vision, short and long term disability benefits, 401(k) +match, stock purchase plan, life insurance, wellness programs and financial education resources, to name a few.\nThe health of our associates and communities is a top priority for Elevance Health. We require all new candidates to become vaccinated against COVID-19. If you are not vaccinated, your offer will be rescinded unless you provide – and Elevance Health approves – a valid religious or medical explanation as to why you are not able to get vaccinated that Elevance Health is able to reasonably accommodate. Elevance Health will also follow all relevant federal, state and local laws.\nElevance Health has been named as a Fortune Great Place To Work in 2021, is ranked as one of the 2021 World’s Most Admired Companies among health insurers by Fortune magazine, and a Top 20 Fortune 500 Companies on Diversity and Inclusion. To learn more about our company and apply, please visit us at careers.ElevanceHealth.com. Elevance Health is an Equal Employment Opportunity employer and all qualified applicants will receive consideration for employment without regard to age, citizenship status, color, creed, disability, ethnicity, genetic information, gender (including gender identity and gender expression), marital status, national origin, race, religion, sex, sexual orientation, veteran status or any other status or condition protected by applicable federal, state, or local laws. Applicants who require accommodation to participate in the job application process may contact ability@icareerhelp.com for assistance.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","intern","entry","level","blockchain","react"]},{"job":"Senior Smart Contract Engineer","company":"Uniswap Labs","location":"New York","post_date":"7d","link":"https://web3.career/senior-smart-contract-engineer-uniswaplabs/39842","key":"39842","details":"The Uniswap Protocol is the largest decentralized trading and automated market making protocol (often called a DEX, \"Decentralized Exchange\") on Ethereum.\n\nThe Uniswap Labs team was a major contributor to the Uniswap Protocol and now focuses on building a suite of products to support the Uniswap Labs ecosystem. Our team is one of the most impactful in crypto. We are based out of SoHo in New York City with the option to be partially or fully remote depending on the position.\n\nWe are looking for an experienced smart contract engineer to help us build the next generation of the Uniswap Protocol. You will be responsible for implementing and designing smart contracts for the next generation of the most popular decentralized trading protocol on Ethereum.\n\nExtra points if you are also comfortable or interested in contributing to frontend development.\n\nResponsibilities:\n\n\nImplement Uniswap V3 smart contracts and tests\nImplement and design periphery contracts for Uniswap V3\nDesign and implement peripheral mechanisms to the Uniswap protocol\n\n\nRequirements:\n\n4+ years of experience building and releasing production grade Solidity contracts\nA deep understanding of the Ethereum Virtual Machine\nPrior experience deploying complex smart contract systems to the Ethereum mainnet\n\n\nNice to Haves:\n\nDegree in math or computer science\nExperience implementing complex math in Solidity\nExperience with React, Redux and other frontend technologies\nLove for unicorns :)\n\n\nMinimum full-time salary of $210,000-$240,000. Disclosure in accordance with New York City's Pay Transparency Law. Full Time employees at Uniswap Labs are also eligible for other compensation elements, including equity, tokens, and benefits, dependent on the position type.\n\nUniswap Labs' benefits include unlimited and encouraged time off, 100% company-paid medical, dental, & vision for you and your dependents, 401(k) participation, annual $1,500 education stipend, up to 16 weeks paid parental leave, home office setup stipend for remote employees and daily lunches at NY headquarters (all benefits are subject to applicable taxes and based on eligibility).\n\nUniswap Labs is proud to be an equal opportunity employer (EEO). We provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability (including gender dysphoria and similar gender-related conditions), sex, gender identity or expression, sexual orientation (including actual or perceived heterosexuality, homosexuality, bisexuality, and asexuality), veteran status, military status, domestic violence victim status, reproductive health decision making or any other protected category.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","smart","contract","react","solidity"]},{"job":"Senior Product Manager Lead Custody","company":"Binance","location":"Dubai","post_date":"7d","link":"https://web3.career/senior-product-manager-lead-custody-binance/39841","key":"39841","details":"Senior Product Manager/Lead - Custody\nHybrid – UAE, Dubai /\nProduct & Design – Product /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for an experienced Product Manager to provide custody products to our enterprise customers. \n\n\nYou’ll transform ideas into strategy and product features, following agile development practices to deliver the final product from start to finish. To succeed in this role, you should be a data driven, creative leader and problem-solver with a passion for the crypto industry. \nResponsibilities:\nResponsible for the App or Web product experience\nResponsible for onboarding flow (KYB) and enterprise process management\nConduct competitor analysis, learn from the market and differentiate from competitors\nCollect and analyze feedback from customers, stakeholders and other teams, consolidate them into requirements, features and end products\nProduce and review product requirements documents (PRD)\nEnsure products and releases are launched correctly and on schedule\nTrack and push development and testing progress. Track and analyze key user metrics in order to form feedback loop to improve our products and services\nRequirements:\nProven experience in custody Crypto product development and management is a must\nExperience in internationally renowned Internet companies, or experience in product development for large Internet platform products are great bonus\nExperience in product lifecycle management, preferably in agile framework\nExperience or knowledge of digital or traditional securities custody is preferred\nGood skills in PRD\nData driven experience is a plus\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead","product","manager","non-tech","senior"]},{"job":"Senior Product Manager Trading","company":"Binance","location":"Europe","post_date":"7d","link":"https://web3.career/senior-product-manager-trading-binance/39840","key":"39840","details":"Senior Product Manager (Trading)\nHybrid – Europe /\nProduct & Design – Product /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a Product Manager to drive innovative trading products to our institutional customers. \n\n\nYou’ll transform ideas into strategy and product features, following agile development practices to deliver the final product from start to finish. To succeed in this role, you should be a data driven, creative leader and problem-solver with a passion for the crypto industry. \nResponsibilities:\nResponsible for trading product development across custody business, especially on frontend trading experience for institutional clients \nConduct market research and competitor analysis to deliver best-in-class trading solutions and products\nYou will work daily with our design and engineering teams to develop new and improve existing platform features\nCreate and maintain product roadmaps, feature backlogs and product documentation such PRDs, user stories, use cases, user flows, logic flows, and functional specifications\nPrioritise development activities with engineering teams, assist in determining the best technical implementation methods, work closely with QA on acceptance testing and lead product launches\nManage cross-functional and cross-department communication and coordination to ensure product quality and progress, and completion of product milestones\nRequirements:\nMinimum 6 years of proven experience as a product manager coupled with a good understanding of financial trading systems\nBuilt or supported institutional grade client facing trading portals\nSound knowledge on financial products (including derivatives) and trading experience\nSound knowledge on trading lifecycle\nFamiliarity with Agile workflow and ability to work within an Agile environment\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","senior"]},{"job":"Principal Engineer Backend Java","company":"Binance","location":"Remote","post_date":"7d","link":"https://web3.career/principal-engineer-backend-java-binance/39839","key":"39839","details":"Principal Engineer - Backend (Java)\nRemote – Global /\nEngineering – Backend /\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are recruiting a Principal Engineer - a technical leader role with hands on coding tasks. He/She would join a greenfield projects to continuously build and scale our blockchain ecosystem.\nResponsibilities\nFull life cycle of software development, including requirement gathering, designing, coding, testing and deployment\nTake a hands-on role in influencing and guiding day-to-day development activities by leading architecture decisions, participating in designs, design review, code review, and implementation\nUnderlying infrastructure/architectural upgrades\nImprove the effectiveness of our core exchange system\nSet up and maintain the system infrastructure\nRequirements\nProven track of record for great learning skills, love to solve challenging problems\nCore Java programming skills and willingness to do hands on coding are a must\nFamiliar with network and multi-thread programming, design pattern and middleware\nFamiliar with Linux/Unix and server side application development\nExperience with top tier internet companies or crypto industry are big bonus\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","java","executive","remote"]},{"job":"CISO TechOps Officer","company":"Binance","location":"Manama","post_date":"7d","link":"https://web3.career/ciso-techops-officer-binance/39838","key":"39838","details":"CISO & TechOps Officer\nHybrid – Bahrain, Manama /\nSecurity & IT Helpdesk – Security /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking to hire an experienced Chief Information Security & TechOps Officer to support a newly established business unit. The CISO & TechOps Officer will have the opportunity to build and expand the Information Security and Technical Operations Function of the business to the highest standard as per the business and regulatory requirements. The CISO & TechOps Officer will work closely with various internal stakeholders, and be part of a high-growth business unit.\n\n\nResponsibilities\nDevelop technical aspects for the business to ensure alignment with the business goals and strategy.\nWork closely with the trading operations team, and manage various technical operations requirements, API Key/access management, etc.\nSupervise system infrastructure to ensure functionality and efficiency.\nBuild quality assurance and data protection processes.\nMonitor KPIs and IT budgets to assess technological performance.\nUse stakeholders’ feedback to inform necessary improvements and adjustments to technology.\nCommunicate technology strategy to partners and investors.\nEmployee technical/security leadership and training.\nSoftware development, review, testing and evaluation.\nMonitor service performance, metrics and SLAs and take action to correct issues. \nAnalyze and report incidents from third-party providers in a timely manner.\nPerform compliance monitoring on regulatory items and report anomalies to relevant stakeholders.\nRequirements\nUniversity degree in a technical subject such as computer science.\nSecurity certification such as, CISSP, OSCP, CISM.\nTechnical certifications in Cisco networking, and cloud systems such as AWS or GCS.\nOver 10 years experience within the technical and regulated financial services sectors.\nExperience with working with regulators and regulatory requirements. \nHands-on experience delivering cloud based office applications such as Microsoft 365, G-Suite etc..\nFamiliar with local laws and regulations of the financial and trading industry in Bahrain.\nIndependent, self-motivated, and have the spirit to expand their functional area of the business.\nExcellent communication skills, and ability to work effectively with a global team across 3 continents.\n\n\n\n\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":[""]},{"job":"Org Strategy Post Parity Relationship Manager","company":"Parity Technologies","location":"New York","post_date":"7d","link":"https://web3.career/org-strategy-post-parity-relationship-manager-parity/39836","key":"39836","details":"Parity is one of the world's most experienced core blockchain infrastructure companies, having built and pioneered some of the most advanced technologies in the blockchain sector. Parity was founded by Dr. Gavin Wood, co-founder and former CTO of Ethereum, the primary engineer behind the Ethereum Virtual Machine (EVM), inventor of the Solidity programming language, and primary author of the Ethereum Yellowpaper.\n\nBased in Berlin, London, and Lisbon with over 340 employees worldwide, Parity has built clients for Ethereum, Bitcoin, and Zcash and has pioneered a completely new, next-generation blockchain protocol with Polkadot and the framework it’s built with, Substrate. Parity builds the open-source technologies needed to power an unstoppable, decentralised web—known as Web3—and helps developers and organisations implement and build upon the Web3 tech stack.\n\nAbout the team:\n\nOrg Strategy is a small team that works closely with many departments within Parity. Our vision is to attract and retain the smartest people in the world to build the future of the decentralised web. However, when key people do leave Parity, we want to continue to support them and nurture the relationships we’ve already built. Engaging and supporting the post-Parity network is a great lever for talent acquisition, mentorship, and to continue supporting the growth of the Polkadot ecosystem.\n\nAbout the position:\nYou’re in charge of developing and implementing exit packages (e.g. a goodbye NFT, Post-Parity DAO).\nYou’ll nurture personal relationships and establish, maintain, and grow wider communities that they can join.\nYou’re the touch-point for people who joined the Polkadot ecosystem after leaving Parity and offer continuous support.\nYou’ll actively keep the post-Parity network involved in current projects and company events.\nYou’ll develop opportunities for mentorship and collaboration (speaking engagements, event participation, etc.).\nYou’ll connect post-Parity people to teams (Parity and parachains) and resources.\nYou’ll develop initiatives to leverage the networks of ex-team members for new talent hiring.\nYou’ll support people when they’re looking for a new role by reskilling and upskilling them through network sharing, resume reviews, recommendation letters, interview preparations, and salary negotiation workshops.\nAbout you:\n3+ years of experience with building, nurturing, and managing communities/people.\nExcellent communication skills.\nSocial, people-person who enjoys networking and bringing people together.\nResourceful and doer mentality: You autonomously and proactively get tasks done.\nOrganisational talent: You always have a clear overview of everyone in the post-Parity network and the many initiatives that you’re running.\nExcited about developing creative ideas to keep the post-Parity network engaged.\nEnthusiasm to dive into the world of Web3 and learn about the Polkadot Ecosystem. Bonus if you’re already familiar with it.\nGenuine interest in joining our collective, forming relationships, and evolving within the Polkadot ecosystem in the long haul.\nAbout working for us:\nFor everyone who joins us:\nAbility to build your network in the Polkadot Ecosystem and wider Web3 space.\nA global work environment that’s collaborative, fast-paced, and self-initiating — perfect for doers who want to envision ideas and execute on them rapidly.\nA culture where efforts and initiatives are noticed and rewarded, and your career goals are taken seriously. We’re focused on talent, not titles.\nFast learning curve: You’ll gain new skills and learn new knowledge constantly.\nOpportunity to learn about Web3 while on the job, with access to some of the brightest minds in this space.\nPlenty of educational initiatives such as internal sessions, AMAs, hackathons, etc.\nA long-term career path with lots of opportunities to grow within Parity or the wider ecosystem.\nTeammates that are genuinely excited about their job, impact, and Parity’s mission.\nCompetitive remuneration package including tokens.\nWork from home or co-work in our office hubs in Berlin, London, or Lisbon.\nFrequent company and team retreats to connect with colleagues in real life.\nFor those joining us as employees in Germany, Portugal, or the U.K.:\n28 paid vacation days per year\nWork laptop (macOS or Linux-based) and equipment to enable you to work successfully\n£2,500 yearly learning and development budget for conferences or courses of your choice\n\nNot a perfect match to our requirements? We're still excited to receive your application and hear how you think you can help us achieve our mission.\n\nTo see how we use your data please see our Applicant Notice.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","remote","solidity","ethereum"]},{"job":"Lead Growth Manager Sales Manager","company":"LATOKEN","location":"United States","post_date":"7d","link":"https://web3.career/lead-growth-manager-sales-manager-latoken/39835","key":"39835","details":"LATOKEN is a crypto exchange leading startup tokens market with 250+ primary placements and 1000+ assets.\n\nOur active users grew by 8x in 2021 to 3M+ accounts including 1.5M+ mobile with 30K+ 5 stars reviews.\n\nWe have the top trust score in the global list of exchanges Coingecko and are rated top 20 among 588 other exchanges.\n\nWe are building the next capital market - the “Amazon of Crypto” where it is easy to put an asset to the marketplace, discover, and buy or sell. In other words, we are opening the door for the next billion traders to the next million digital assets from cryptocurrencies to equity, commodity, and real estate markets.\n\nWe are doing this to unite the global population for humankind's prosperity. Those who own tradable assets benefit from the growth of the global market. Their brainpower and investment decisions focus planetary resources to build a better future. The more people will become stakeholders of the future, the better it will be.\n\nThis becomes possible today as blockchain tech solves the property rights problem without armies and political force. Thus people around the world can open an account as easily as in a social app and have their rights protected.\n\nOur culture is for champions living to change the world and are free to overdeliver toward the mission.\n\nWe are acknowledged by FORBES as one of the top 30 companies for remote jobs in 2022.\n\nWe offer a generous stock options package, competitive pay, and stellar growth with the dawn of the web3 era.\n\nMission: Acquire and retain traders by listing top projects with co-marketing and price growth potential.\n\nMain performance number: Traders Growth Rate, MoM\n\nSecond performance number: Fees Collected\n\nThird performance number: Price Growth 30D from listing Avg.\n\nWe Offer\n\n\nTotal target Remuneration per month up to 10500 USD. Consist of two parts: Base Remuneration (Up to 3500) + up to 200% bonus on fees revenue generated;\nFully remote job (GMT+3);\nWe give proof that a teammate's life made an impact - LATOKEN share in Nasdaq index and millions in your pockets from vested options;\nBreakthrough technology and Product - Market - Timing Fit;\nWorldwide multibillion users market;\n2x traders growth CAGR and 4.7 Google play rating;\nMultibillion worldwide market;\nJoin us to build the first digital exchange wallet with a billion users;\nFeel a great fit - apply now or forward to a great candidate.\n\nFunctions\n\nAnalyze conversion and virality across growth products and channels;\nStructure dashboards and bonuses to prioritize and scale performing co-marketing activities and tasks;\nDo competitors' research and mystery shopping to adopt the best practices for growth products and partnerships;\nImplement and keep up-to-date checklists and SLA for co-marketing product execution in side;\nCRM so managers are clear on what to do and services are fully delivered accordingly to SLA;\nImplement automated reports to clients with their co-marketing activities performance with NPS pool;\nMake growth and team scalable by improving the \"sports team\" process with hiring, automated onboarding with tests and training, bonuses and automated up or out.\n\nRequirement Skills And Experience\n\nCrypto experience is a must;\n1+ years of Team management experience;\n2+ years of experience in two of: token analytics/allocations, partnership marketing, bizdev or sales;\nProven experience in investments, trading, crypto, payments or other fintech is an advantage;\nHas the potential to grow to Product Manager;\nExcellent oral and written communication skills;\nProblem-solving and critical reasoning skills (700+ GMAT level / won city level Olympiad);\nFluent English.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","lead","sales"]},{"job":"Senior React Native Mobile Developer Web3 Remote","company":"Aldrin","location":"Remote","post_date":"7d","link":"https://web3.career/senior-react-native-mobile-developer-web3-remote-aldrin/39833","key":"39833","details":"About Aldrin Labs\nThere is a steep learning curve when it comes to crypto. Only once overcome will we have mass adoption. Aldrin Labs aims to debunk the belief that decentralized finance is inherently complex and separate from centralized finance. We will amend the frustratingly poor user experience and fragmentation that millions of crypto natives and newcomers face. We will seamlessly merge the centralized and decentralized world.\n\n\nAldrin Labs aims to be purposeful. We strive to halve the fifty working years of the average person. This is the mission of Aldrin Labs.\n\n\nAldrin Labs has Aldrin DEX and is incubating an innovative mobile app, a crypto wallet and also working on a money market. These protocols will integrate with each other to provide easy functionality and purposefully help people achieve financial freedom.\n\n\nWe are a fully remote company. We are interested in capturing the best talent, no matter where you live.\n\n\n\n\nThe Role\n\n\nWe are looking for a Senior React Native Mobile Developer with extensive experience in designing, building, and deploying highly secure, scalable, and maintainable client-facing UI systems.\n\n\nYou will be one of the senior developers of the mobile app working closely with our designers, product owners, and backend engineers to develop and maintain high-quality mobile applications for a global audience in an extremely fast-growing industry. We work with a modern tech-stack. We use Typescript, hooks, eslint, reanimated, automated CI and deployments, etc. We work with a design system and an updated figma design.\n\n\nIf you are extremely passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. Ultimately, you should be able to help design and build the next generation of our mobile applications that will impact and shape the financial lives of a growing audience.\n\n\nYou will:\n\n\nContribute code to our iOS & Android React Native apps from the get-go\nWork on integrating and collaborating with other crypto products to enrich the user experience\nImplement features with the aim to provide long term stability of a highly scalable application\nDeveloping clean and reusable react native components\nActively contributing new ideas and innovative UX/UI patterns\nPlay an active role in evolving our mobile engineering practices\n\n\nMinimum Qualifications:\n\n\nStrong expertise in React Native with 3-5+ years of professional experience building high-quality mobile apps\nHigh-level experience with TypeScript\nHave experience with best-in-class client-side data design and management, whether that’s experience with GraphQL/ Apollo or other such tools\nHave a passion for good design and attention to detail. You’ll collaborate with designers but undoubtedly have the opportunity to express your own design sense if desired\nVerbal fluency in English\n\n\nNice-to-Have Qualifications:\n\n\nDemonstrable portfolio of released applications on the App Store or the Android\nPassionate about crypto markets, blockchain technology, and decentralized applications\nKnowledge/experience working on mobile financial applications/cryptocurrencies/wallets\nExperience with Solana Web3 frameworks and technologies, especially on mobile\nExperience working with a large codebase and detox or appium testing tools\nExperience with responsive UI and debugging skills\nExperience developing high-performance mobile app interfaces\nBachelors or Masters degree, preferably in Computer Science, Computer Engineering or other technical (STEM) field or an equivalent of experience\nBenefits\n\n\nCompetitive salary\nRemote work in a dynamic, fast-growth Web3 startup\nFlexible working hours\nOpportunity to work with a diverse, global, and passionate team\nCollaboration with leading projects and thought leaders in the crypto space\nAt Aldrin Labs, we celebrate a truly diverse and inclusive company culture and are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","dev","mobile","react","native","javascript"]},{"job":"Senior Frontend Engineer NFT","company":"Uniswap Labs","location":"New York","post_date":"7d","link":"https://web3.career/senior-frontend-engineer-nft-uniswaplabs/39832","key":"39832","details":"We’re looking for an enthusiastic, self-motivated engineer to help us build the next generation of NFT products on Uniswap Labs's web app interface. As a dedicated frontend hire, you will gain ownership over our existing suite of web products, as well as the ability to influence the creation, design, and execution of future products. You will be responsible for ensuring a consistent, high-quality user experience across trading interfaces, data-heavy analytics pages, documentation portals and more.\nResponsibilities\nCreate a unified component library for use across all Uniswap products\nRapidly implement functional UI elements from design mocks, with an eye toward performance and accessibility\nKnow when to create abstractions vs. one-off features\nEnsure that components are functional, elegant, performant, and mobile-friendly\nUnderstand when and how to run UI tests\n\nRequirements\n\n5+ years of software engineering experience\nAt least 3 years of React experience\nA deep understanding of the architecture of modern client-side React applications\nPrior experience working with component libraries or design teams in user-facing applications\nA desire to keep up with modern best practices in web development\n\nNice to Have\n\nPrior experience creating a design system or component library\nFamiliarity with the web3 frontend stack (ethers.js/web3.js, EIP-1193, client-side private key management, etc.)\nFamiliarity with React Hooks\nExperience with TypeScript in React\nDegree in computer science\nLove for unicorns :)\n\nMinimum full-time salary of $180,000-$220,000. Disclosure in accordance with New York City's Pay Transparency Law. Full Time employees at Uniswap Labs are also eligible for other compensation elements, including equity, tokens, and benefits, dependent on the position type.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","senior","nft","web3js"]},{"job":"Integrations Engineer","company":"The Sourcery","location":"San Francisco","post_date":"7d","link":"https://web3.career/integrations-engineer-thesourcery/39831","key":"39831","details":"About us:\n\nOrb is part of the Balancer ecosystem and a service provider to the Balancer Foundation. Balancer is an open-source DeFi protocol built on the Ethereum network (incl. L2s - Arbitrum, Optimism, & Polygon). More specifically Balancer is a base layer AMM (Automated Market Maker) and DEX (Decentralized Exchange). Built on the Ethereum blockchain, Balancer offers new solutions to the problems of traditional and centralized exchanges. Developers leverage Balancer as a permissionless building block to innovate freely and create new treasury management systems. Balancer's mission is to become the primary source of programmable liquidity.\n\nThe Role:\n\nBalancer's power is its flexibility, and we envision a world in which the most compelling applications of Balancer technology are built by third parties rather than internal teams. Providing expert advice and assistance to external developers is crucial to incubate a broad ecosystem of applications built on Balancer. We're looking for someone to join the Integrations Engineering Team as we assist and directly collaborate with developers building on our platform.\n\nOur Ideal Candidate:\n\n\n3+ years of experience as a software engineer\n1+ years of experience with Solidity preferred\nExperience in highly constrained domains, such as smart contracts or embedded systems, preferred\nExcellent technical communication skills, especially the ability to distill complexity\nExperienced problem solver with a knack for figuring out how things can break\nSolid overview of the DeFi landscape and protocols like Balancer, Aave, Compound, Uniswap, Yearn, etc\nBasic understanding of the Balancer protocol, especially the benefits of V2's modular architecture (solid understanding is a big plus)\n\n\nYou Will:\n\nSupport Balancer's key partners with their integrations by writing and reviewing smart contracts, outlining best practices, and answering technical questions\nBrainstorm and ideate solutions to challenging problems\nFill observed gaps in the developer toolchain\nDevelop systems that improve Balancer's usability\n\n\nWhat We Offer:\n\nCompetitive salary + token incentives\nHighly flexible PTO\nAt least two on-sites (in-person meetups) per year\nExperience at a leading DeFi protocol\nWith a remote team all over the world, you can work from wherever you want!\nWellness & co-working stipends plus phone and internet reimbursement\n\n\nSalary: $120k-140k. + Large Token Grant. Salary offers will be based on the candidate's qualifications.\n\nWe are focused on building a diverse and inclusive workforce. If you're excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\n\nOrb Collective is an equal opportunity employer. We value diversity at our company and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","ethereum"]}]}