{"jobs":[{"job":"Smart Contract Engineer","company":"paraform","location":"San Francisco","post_date":"9d","link":"https://web3.career/smart-contract-engineer-paraform/39730","key":"39730","details":"SALARY: $80,000-$160,000+ EQUITY.\n\nLink to apply to this role and be considered: https://www.paraform.com/company/drift-labs/cl65frf2f032309ms240cxwvi/apply\n\nJob description\n\nDrift is looking for a Smart Contract Engineer to be a core member of our engineering team. You'll have the opportunity to research protocol design, develop smart contracts and maintain backend services that facilitate the growth of the protocol.\n\nAbout Drift Labs\n\nOur goal is to make DEXs the best way to trade derivatives. Despite the decentralized nature of crypto, centralized derivatives exchanges still remain dominant - they're already fast, familiar and reliable. So far, the DEX trading experience hasn't met that standard. Slippage is high for large orders, transferring funds between platforms is subject to massive gas fees, and low liquidity leads to poor pricing. Drift’s goal is to bring a state-of-the-art trader-centric experience from centralized exchanges on-chain. We're a team of experienced traders and builders from DeFi and traditional finance working together to make this a reality.\n\nWho the candidate is\n\n💻  3+ years of experience in software development.\n\n🔨  High level of proficiency with Rust programming language, paradigms, constructs, and idioms. Familiarity with low-level languages such as C++ is welcome.\n\n🗄️  Ability to build scalable applications using performant databases.\n\n✍️  Demonstrated ability to learn new tech and write secure and high quality code.\n\n🔗  Passion for blockchain technology, cryptonomic protocol design, game theory, and decentralized finance.\n\nTechnologies used\n\nRust\n\nSolana\n\nMySQL\n\nAWS\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","rust"]},{"job":"Jr. Artist Blockchain Gaming","company":"NaturalMotion / Zynga","location":"","post_date":"9d","link":"https://web3.career/jr-artist-blockchain-gaming-zynga/39729","key":"39729","details":"Our mission within Zynga Blockchain Games is to empower players to invest, own and earn through fun, high-quality and enduring blockchain games they can trust. If you want to help shape the future of gaming with a world-class team, we look forward to hearing from you.\n\nZynga is looking for a Jr. Artist to join the ZBC organization and support the Visual Direction across our portfolio! This art role includes many touchpoints (UI, 2D, 3D, etc.) to support the game’s Creative Direction at all stages of development from pre-dev to live-ops.\n\nResponsibilities:\nWork closely with Art and Creative Direction to align with needs from a multi-disciplinary lens.\nAdaptive to visual >\nGreat teammate that has experience in the gaming and art space.\nSelf-starter and adaptive to many workflows.\nLoves to sketch and draw, while working with rapid turnaround times.\nCommunicative and flexible to team needs and dynamics.\nOrganized and proactive in making and maintaining art repo structure and naming conventions.\nHigh caliber and integrity of art quality that fits within the >\nBrings a Graphic Design lens into UI and 2D production art creation.\nEnjoys working within 2D and 3D to contribute widely across creative and gameplay needs.\nImplements all art content direct to engine and ensures consistency of visual quality.\nKeeps informed of innovative ways and technologies in the industry and communicates opportunities to foster the look and feel.\nCreation of art assets and assessment of outstanding art needs to ensure timely project results.\nDesired skills and experience:\nKnows 3D software such as 3dsMax, Maya, etc.\nUnderstanding of W2 and W3, NFT, and Blockchain\nCore Adobe Creative Suite skills, including the Adobe Substance 3D Collection\nDrawing proficiency\nComfortable with 2D and 3D art task swapping, including but not limited to:\nAll applicants must provide a portfolio of work upon application to be considered\n2D Art\n3D Art\nAnimation\nIllustration\nGraphic Design\nVector Art\nEngine implementation\nSolid understanding of the principles of art\nWhat we offer you:\nCompetitive salary, bonus plan, ESPP (Employee Stock Purchase Plan)\n401K Company Match Contribution (US)\nRRSP Company Match Contribution (Canada)\nExtended Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)\nMedical, dental, vision, EAP, life insurance, and disability benefits (US)\nVirtual mental health and neurodiversity support programs\nFitness benefits (offering varies by location)\nFinancial wellness program with unlimited access to certified financial planners\nDiscretionary Time Off policy for many employees\nFamily planning support program\nGenerous paid parental leave\nSubsidized Back-up child care\nZynga happy hours and frequent employee events\nFlexible working hours on many teams\nCulture of diversity and inclusion including employee resource groups\nWork with cool people and impact millions of daily players\n\nWe are an equal opportunity employer and we are committed to building a diverse and talented workforce. We do not discriminate on the basis of race, sex, religion, colour, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, medical condition, disability, or any other class or characteristic protected by applicable law. We welcome job-seekers, players, employees, and partners from all backgrounds to join us!\n\nWe will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.\n\nWe are committed to providing reasonable accommodations to qualified individuals with physical or mental disabilities in order to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at AccommodationRequest@zynga.com to request an accommodation associated with your application for an open position.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["game","dev","junior","entry","level","blockchain","nft"]},{"job":"Director of Permance Marketing","company":"Impact Theory","location":"Los Angeles","post_date":"9d","link":"https://web3.career/director-of-performance-marketing-impacttheory/39728","key":"39728","details":"Impact Theory is a freakishly ambitious LA-based Web3 studio, committed to telling stories of empowerment and human potential. We currently produce a wide variety of scripted, unscripted, and digital content for OTT streamers, YouTube, Spotify, WEBTOON, podcasts, and our own internal online learning platform. All of Impact Theory’s content is focused on entertaining and empowering people the world over. If Disney sought to build the most magical brand on earth, we are endeavoring to create the most empowering brand on earth - without sacrificing the entertainment factor.\nWe are embarking on our newest venture into the Blockchain entertainment and NFT space and are building a world class team in the process. Impact Theory is seeking an experienced Director of Performance Marketing to help lead our paid marketing efforts across our entire ecosystem.\nTo be considered, you will need to be enthusiastic, fun, hardcore, and highly motivated. We are a team, not a family. We want kind and encouraging people who show up every day playing to win and striving to be the best of the best. Impact Theory is where you come to make your wildest dreams a reality. We are looking for standout players who are self-motivated and unflappable. If that’s you, please submit a cover letter, and resume. This role will be a hybrid model and based out of our office in Los Angeles\nResponsibilities\n\n\nHands on ability to create effective performance marketing best practices\nUtilize data to help inform and educate Company strategies to increase revenue and social footprint\nWork effectively across teams to build strong partnerships with key roles across the company\nManage the bottom line on all performance marketing programs\nDevelop and implement testing strategies to improve overall KPIs, including new channels, copy testing, ad placements, and retargeting strategies to maximize full-funnel performance\n\nQualifications\n\n2-5 years of previous Director level experience\n5+ years of experience in content strategy and D to C performance marketing\nDemonstrate outstanding analytical and problem solving skills with a strong eye for detail\nExpert in Google Analytics, BI tools, advertising platforms and Excel\nExperience with diverse ad types - CRM, Paid Social, Search, Display\nExpert in data analyzation across multiple social platforms including, YouTube, Podcasts, etc\nIn-depth understanding of all marketing channels and how they interconnect to generate ROI\nPrior copywriter experience preferred\nStrong written and oral communication skills\n\nImpact Theory is an Equal Opportunity employer. We celebrate and embrace diversity, and believe the strongest teams are from a broad tapestry of backgrounds, perspectives, and skills. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristics protected by applicable federal, state, or local law.\nPowered by JazzHR\natvmfatDUE\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","marketing","non-tech","nft"]},{"job":"Open Application • web3 • Blockchain","company":"mkt.market","location":"United States","post_date":"9d","link":"https://web3.career/open-application-web3-blockchain-mkt-market/39725","key":"39725","details":"Use this job opening to share your profile/CV and enter our pool of web3 talents. We'll reach out once there is a role that matches your skillset.\n\n\n\n\nMKT coordinates capital and talent for native web3 organizations such as:\n\n\n\n\nSlingshot • https://slingshot.finance\n\nDeFi Pulse • https://defipulse.com\n\nHyype • https://hyy.pe\n\nCode4rena • https://code4rena.com\n\n+ Atrium, Tessera, GravityBridge, NFTX, Canto.io, Scalara.\n\n\n\n\nWork at MKT supported organizations is dynamic & well-compensated ✌🏼\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["blockchain"]},{"job":"Head of Operations","company":"ADDX","location":"Singapore","post_date":"9d","link":"https://web3.career/head-of-operations-addx/39723","key":"39723","details":"Head of Operations\nHybrid – Singapore /\nOperations /\nPermanent\n\nApply for this job\nWho are we?\n \nWe are ADDX, the entry point into private markets, and we aim to democratise private market investments. As a team, we strive to build a future where everybody can access financial ecosystems easily, fairly, and safely. We won’t stop until capital flows freely and efficiently so that economic participation is seamless, frictionless, and meaningful.\n\n\nWhy join us?\n \n· We have built the world’s first fully regulated platform for digital securities, licensed by the Monetary Authority of Singapore (MAS).\n· In 2022, we received USD 58 million in our Pre-Series B funding round.\n· We are backed by companies such as SGX, Heliconia (a subsidiary of Temasek Holdings) and Development Bank of Japan Inc..\n\n\nWe are growing, and we are looking for talented individuals like you to join our team and take us forward at rocket speed towards our future as the leaders of the private market. If you believe in a future of fair financial markets, just like we do, we’ve been waiting for you at ADDX.\n\n\n\nResponsibilities\nLead the Operations team which comprises of Business Operations & Finance and Custody Operations to ensure the daily ADDX operations is working smoothly to support the business needs and meet regulatory compliance or reporting requirements.\nWork with Product, Marketing, Compliance and Growth teams to influence and shape the product strategy and roadmap, drive change for key issues, and prioritize product change requests.\nMaintain operational stability and excellence in all ADDX’s operations including client onboarding, digital asset/securities token issuance, trading and custody, market surveillance, AML monitoring and operations reporting, in accordance with regulatory policy or guidelines.\nManage operational issues and opportunities raised by the Operations team through effective communication, good understanding of operations processes, robust operational controls, and regulatory requirements.\nSupport audit (internal, external or regulatory) review process through timely preparation of required audit deliverable, responses to audit queries, and follow-up actions on audit comments or findings.\nBuild and maintain proactive alignment with IT team and internal stakeholders, including Product, Finance, Customer Support, Legal, Compliance and Risk, to ensure new product can be launched in a timely manner.\nCollaborate with other departments (such as Growth, Legal, Risk and Compliance, Product, Engineering and QA departments) to deliver and drive business initiative to support the overall corporate growth strategy.\nDrive and support exchange user growth by developing and executing new initiatives/ solutions and translate complex ideas into specific requirements and action plans.\nFormulate operational support for new product approval process covering new business initiative, undertaking or new workflow.\nDesign operation strategies and explore new business models to grow the business.\nOperationalize and execute operational processes or workflow from new business initiative or undertaking.\nRegularly review operations policy and procedure to ensure that they are up to date with current processes.\nEnsure the required reporting are prepared timely and accurately by the Operations team.\nEnsure the best use of technology in operations and ensure that business continuity/ crisis management plans are in place and tested to work successfully.\nEstablish and maintain the relationship with central operation team or other external stakeholders, and facilitate product integration and implementation.\nAssist Senior Management team in building strategy and in running projects.\nModel and reinforce ethical behavior in self and others in accordance with the Company SOPs, adhere to organizational policies and guidelines, support compliance initiatives, maintain confidences, admit mistakes, conduct business with honesty, show consistency in words and actions, and follow through on commitments.\nRequirements\nBachelor’s degree in any discipline\n15 or more years of leadership experience in securities operations, preferably at a financial institution, the banking, fintech or crypto industry is highly desirable\nGood understanding of financial and blockchain trading business\nAble to communicate effectively with stakeholders at different levels, both externally and internally\nFamiliarity with MAS regulatory requirements on daily operations (e.g., AML/ KYC, unusual or suspicious transaction reporting)\nSelf-motivated and result-oriented with good analytical, problem-solving, presentation and communication skills\nGreat logical thinking ability & communication skills\nSelf-driven and a quick learner\nAdaptable, resilient and detail-oriented\nDue to our limited capacity, we regret that only shortlisted candidates will be notified.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","operations"]},{"job":"Creative Director","company":"nWay Inc.","location":"San Francisco","post_date":"10d","link":"https://web3.career/creative-director-nwayinc/39721","key":"39721","details":"Job Description\n\n\n\n\nnWay is looking for a Creative Director to shepherd the creative vision and help create an amazing and balanced user experience for a new and exciting web3 project. As Creative Director, you will work with product managers, designers, artists, engineers, and the production team to foster an environment of collective creativity that inspires teams to come up with the best ideas that they can to support it. The ideal candidate must be an expert on what makes a game highly accessible but compelling enough to keep the competition element challenging yet fair and a deep understanding of free to play game economies and the openness to implement innovative web3 compliments into this exciting new space.\n\n\n\n\nResponsibilities\n\n\n\nDefine a clear, cohesive creative vision for the game by turning high-level ideas into detailed and well-thought out concepts.\nWorks to make high level direction from the VP of Creative a reality and works with the other project leads to meet these goals.\nWork closely with the Lead designers to create engaging and gameplay systems with fun features that will improve user experience, engagement, and monetization.\nWork closely with other core team members to develop their specific parts of the vision + unify your concepts to tie together all design, graphic, narrative, and technical elements.\nWork closely with the Production team to review and discuss production priorities, timelines, and scope.\nCommunicate (and emphasize) the creative direction across all channels to guide teams.\nEstablish design processes to ensures all design and implementation deliverables are up to studio’s high standards of quality.\nValidate the consistency and quality of the game + ensure creative alignment between branding, experience, and strategy.\nMaintain and track ongoing relationships with current partners.\n\n\n\nRequirements\n\n\n\n5+ years of leadership experience as a designer, producer or artist with at least 3+ years on a live free-to-play mobile game.\nExceptional organizational, interpersonal, and presentation skills\nEffective cross-departmental communication: you have the know-how to comfortably communicate with all disciplines (programming, art, design, marketing, and so on)\nA highly collaborative and innovative spirit\nThe ability to take technical and production feasibility into account when coming up with concepts\nMentorship: you’re motivated to share your expertise to guide the next generation of creatives\nAutonomy in using presentation and design tools (e.g. Google Suite, PowerPoint, Photoshop, Illustrator, etc.)\nKnowledge of game engines (e.g. Unity or Unreal) and their limitations\nWorking knowledge of modern fighting and real time strategy games\nDesire to work with an established IP in Web3\nDeep familiarity with competitive multiplayer genres on mobile, PC, console, and tabletop\nExpert knowledge of gameplay and mechanics for competitive games\n\n\n\nPluses\n\n\n\nProficiency with Excel and/or Google Sheets\nExperience with competitive game design\nRunning live ops for at least 1 year in the free to play space\nWorking knowledge of blockchain and NFT technology\nExpert in fighting games and community\nPassion for the collectibles market\n\n\n\nWhy you want to work here\n\n\n\n\nAt nWay, we’re passionate about creating meaningful entertainment through real games with digital ownership and we’re always looking for talented individuals who share that same drive. We’re a small startup defined by a very collaborative, lean and laid back culture where everyone just wants to get things done. Our office is located in the heart of San Francisco and we’re conveniently located near BART, Muni, SF Ferry and Caltrain. We also offer medical, dental, vision insurances, FSA and commuter options. Most importantly, we do our best to keep everyone’s belly full with a fully stocked snack room plus office lunches!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","nft"]},{"job":"Product Manager","company":"Crossmint","location":"New York","post_date":"10d","link":"https://web3.career/product-manager-crossmint/39720","key":"39720","details":"🌎 Location\n\nNYC or Miami (Remote)\n\n🕐 Employment type\n\nFull-Time\n\n🎓 Seniority\n\nSenior (5+ yrs exp)\n\nAbout Crossmint 🍀\n\nAt Crossmint, we are creating the infrastructure layer to make NFTs mainstream. We are trusted by 5,000+ creators and marketplaces, like Magic Eden, David Guetta, Sacramento Kings and Tomorrowland.\n\nOur core product is the leading fiat on-ramp for NFTs. It enables anyone to buy them in 1 minute, even if they don't have wallets or crypto. Check it out here!\n\nWe have a broader suite of NFT APIs and developer tools for enterprises, including minting APIs, and custodial wallets as a service.\n\nWe're backed by Tier 1 investment firms, have strong PMF, many many years of runway and have a very small technical and product team.\n\nAbout The Role 👨🎨\n\nWe're looking for Crossmint's first Product Manager. On this role you will take full ownership of product roadmap and definition of our NFT minting APIs.\n\nThis role is focused on our minting API — the easiest way to programmatically mint and deliver NFTs to anyone in the world. On this role, you will own end to end roadmap, product definition and execution of this product line, and report directly to the CEO, who has lead product for 4 of the most used APIs in the world.\n\nResponsibilities 💪🏽\n\n\nDefine roadmap for our Minting API product;\nDefine product requirements for the API and associated collateral: dev console, dev materials, sample code, etc.\nOwn end to end delivery and execution, working closely with our Engineering Team, Operations, Legal, GTM and Risk;\nUnderstand and continuously improve the developer experience of the Minting API\nParticipate on technical architecture discussions for the product, to ensure it can scale reliably and securely to billions of requests a year;\n\n\nAbout You 🤟🏽\n\n3+ years of product management / founder experience\nYou are a developer yourself, or understand developers extremely well\nGood leadership to you means listening and supporting others and rallying towards a common mission\nYou are more creative than organized, yet are organized enough to ensure you don't drop any balls\nYou obsess over the details, but know when to compromise to ship fast\nExcited about building the future\n\n\nBonus:\n\nExperience working on API first developer products\nExperience or deep knowledge about NFTs;\n\n\nInterview steps 🛠\n\nApplication Review - CV screening\n30m Product Sense Interview (1/2)\n30m Product Sense Interview (2/2)\n30m Work with Engineering Interview\n30m GTM interview with GTM Co-CEO\n30m Design Critique with Head of Design\n\n\nOur team will help you navigate through the interview process and resolve any doubts that you might have. As much as possible, we will block these interviews together to create as little hassle and headache for our candidates (:\n\nBenefits 💎\n\nCompetitive pay and equity in the rocketship 📈\nFlexible PTO 🏝\nCompany laptop and allowance of $300/quarter for any necessary home equipment 🏡💻\nWorking in a disruptive and fast-growing industry where the possibilities are endless 🚀\nCompany-paid trips for quarterly off-sites and team bonding ✈️🥥🌴🌈\nWe are a global remote company, but we love working together some days to bond 🧑💻. If you live in Miami or Madrid, we usually hang 2-3 days/week at the office - free lunch paid by the company! In Miami there's a pool 👀\nFlexible work schedule 🕗\nIf in the US, health Insurance 🩺\n\n\nOur Principles ⛳\n\nMove fast, work smart\nExtreme ownership\nBe kind ❤️\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","nft"]},{"job":"Head of Security Custody","company":"Bitpanda","location":"London","post_date":"10d","link":"https://web3.career/head-of-security-custody-bitpanda/39719","key":"39719","details":"Bitpanda Custody is a recent addition to the Bitpanda den. Our vision is to make it safer, faster and easier for institutions and people to safeguard and administer crypto assets across blockchains, DeFi and exchanges. We develop and design solutions through our people, processes, and technology to make it secure and easier for everyone to create or find value in crypto markets. With Bitpanda Custody, our users experience greater freedom to transact in a fair and efficient manner.\n\nYour mission\n\nThis hands on standalone role requires an expert who eats and sleeps security, it's critical for you to have worked closely with AWS Services and HSMs, as well as hands on experience of passing SOC2 and ISO27001 audits!\n\nWhat you’ll do\n\nImplement and oversee strategies and programs to assess and mitigate physical safety and cybersecurity risks, safeguard the custody business and its assets, and shape crisis management.\nDevelop, implement, and maintain security protocols, processes, procedures and policies, identify and reduce risks, and limit liability and exposure to informational, physical, and financial risks.\nAchieve and maintain SOC2 and ISO27001 audit certifications.\nReview existing security measures and update protocols as needed.\nOversee the daily operations of the company to identify potential security risks and room for improvements.\nEnsure the business is compliant with local, national, and global regulations, especially in areas like privacy.\nConduct research and execute security management solutions to help keep the business safe.\nCoordinate across teams to maintain vigilance and security of the business.\nDevelop logistics to protect Technology, copyrights and other related risks.\nFoster a culture of physical and digital security awareness by conducting training sessions and communicating with personnel.\nManage, evaluate, and resolve any physical or digital security incidents or breaches.\nPresent risk assessments and improved security policies to management team members.\nWork with management to develop and implement an appropriate budget for security programs.\n\nWho you are\n\nStrong professional experience of managing AWS and HSM infrastructures, and passing SOC2 and ISO27001 audits.\nScripting/coding experience in any language. Previous experience in JavaScript would be ideal.\nProven track record of working with multiple teams in medium to large enterprises.\nExcellent written communication skills and ability to contribute as a technical writer.\nYou fully understand the company’s compliance requirements at the group and division level.\n\nWhat’s in it for you\n\nFlexibility-first approach to work* including:\nUnlimited fully-paid annual leave\nRecharge Breaks\n20 weeks gender-neutral New Parent Leave\nHybrid Working*:\n60 days Work From Anywhere following the 80/20 Rule\n€500 Work from Home budget\nAn attractive stock option plan* in a high growth company, and a competitive salary\nExclusive premiums when trading on Bitpanda\nOccasional company-wide and team events — both in-person and virtually!\nLearning & development opportunities\nTop-notch “tech pack” – your choice between PC or Mac\nBitpanda merch to keep you swagged out and living the Bitpanda brand\nA global Bitpanda team of fast-moving, talented, “roll-up-your-sleeves-and-make-it-happen” kind of people who are united (across cultures and time zones) by our unique way of working\n\nAnd, above all, the opportunity to learn & grow as part of Bitpanda’s incredible journey towards being Europe’s future #1 investment platform.\n\nBitpanda is committed to fostering a fair and equal environment based on trust and mutual respect. We believe that a diverse and inclusive workplace is paramount to our success and we are committed to building a team that represents a wide variety of backgrounds, perspectives, and skills.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","security","javascript"]},{"job":"Producer Blockchain Gaming","company":"NaturalMotion / Zynga","location":"","post_date":"10d","link":"https://web3.career/producer-blockchain-gaming-zynga/39718","key":"39718","details":"Zynga, the global leader in social games, is looking for an innovative Producer to join Zynga Blockchain Games.\n\nOur mission within Zynga Blockchain Games is to empower players to invest, own and earn through fun, high-quality, and enduring blockchain games they can trust. If you want to help shape the future of gaming with a world-class team, we look forward to hearing from you.\n\nUnder the direction of a Lead Producer, this Producer will collaborate with creative and technical teams to complete specific project features, on time and at quality. Additionally, they will plan, support team resources, and track progress against the goals set. To do this, they will balance their efforts between day-to-day needs, preparing for longer-term deliveries, and supporting ongoing processes.\n\nThe right person for this role will be ready to embrace our culture and elevate our business performance. They will have experience in solving game development problems, exploring web3, influencing others, and enabling teams to succeed with excellent organization, interpersonal, and communication skills.\n\nResponsibilities\n\nThis Producer will shepherd the production process day-to-day, ensuring other team members are clearly tasked and unblocked. Additionally, this person will run key weekly activities, ensuring we are making measurable progress toward our long-term commitments. Lastly, this role supports roadmapping and backlog management of our product areas, while helping build a productive and predictive environment that encourages team ownership. The Producer will play a key part in the continuous improvement of our production standard processes.\n\nProject Management Skills Needed\nProject road-mapping, backlog refinement, sprint planning & reviews, retrospectives, dependency management\nCapturing team production data such as capacity & velocity to feed your project plans\nIdentifying, tracking, and mitigating risks to the feature development\nDay-to-day team management, helping your team to remain focused and actively working on their tasks\nTriaging, assigning, and prioritizing tasks and bugs while facilitating the team's ability to turn requirements into achievable plans\nAgile development using methodologies such as Scrum/Kanban etc.\nComfort using Jira, Confluence, Miro, Smartsheet, Google/Office suites.\nDesired Experience\n2+ years as a producer/project manager, ideally in games or a similar media\nHands-on experience in the web3 space, across major chains is a plus (Ethereum, Polygon, Sol)\nExperience working with multidisciplinary teams focusing on outstanding organization, communication and team building skills\nSCRUM/Agile/Waterfall development experience with rapid and live development\nWhat we offer you:\nCompetitive salary, bonus plan, ESPP (Employee Stock Purchase Plan)\n401K Company Match Contribution (US)\nRRSP Company Match Contribution (Canada)\nExtended Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)\nMedical, dental, vision, EAP, life insurance, and disability benefits (US)\nVirtual mental health and neurodiversity support programs\nFitness benefits (offering varies by location)\nFinancial wellness program with unlimited access to certified financial planners\nDiscretionary Time Off policy for many employees\nFamily planning support program\nGenerous paid parental leave\nSubsidized Back-up child care\nZynga happy hours and frequent employee events\nFlexible working hours on many teams\nCulture of diversity and inclusion including employee resource groups\nWork with cool people and impact millions of daily players\n\nWe are an equal opportunity employer and we are committed to building a diverse and talented workforce. We do not discriminate on the basis of race, sex, religion, colour, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, medical condition, disability, or any other class or characteristic protected by applicable law. We welcome job-seekers, players, employees, and partners from all backgrounds to join us!\n\nWe will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.\n\nWe are committed to providing reasonable accommodations to qualified individuals with physical or mental disabilities in order to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at AccommodationRequest@zynga.com to request an accommodation associated with your application for an open position.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["game","dev","blockchain","ethereum"]},{"job":"Growth Manager","company":"PearDao","location":"Remote","post_date":"1mo","link":"https://web3.career/growth-manager-peardao/37360","key":"37360","details":"Drive business growth through partnerships and strategic agreements to increase P2P market penetration, user acquisition, revenue, and other relevant metrics in the Latam/Nigeria/India + Pakistan/Russia/Asian regions.\n\n\nCreate and execute localized strategies to aid in the adoption of crypto-based ecosystems, including Gamefi, NFT marketplace, and DAO.\n\n\nIncrease operational efficiency throughout the business development organization.\n\n\nCo-develop and execute go-to-market strategies for new and existing products and markets.\n\n\nCross-functional collaboration with different teams and geographies.\n\n\nOrganize offline activities and conferences to promote products of PearDAO.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","crypto","dao","nft"]},{"job":"Junior Frontend Developer","company":"Empiric Labs","location":"New York","post_date":"10d","link":"https://web3.career/junior-frontend-developer-empiriclabs/39717","key":"39717","details":"Junior Frontend Developer\n\n\n\n\nAbout Empiric Labs:\n\n\n\n\nEmpiric Labs is building essential zk-rollup infrastructure for Ethereum. Our work is at the cutting edge of cryptography and blockchain technology.\n\n\n\n\nWe are building Empiric Network, the first live oracle on StarkNet and the leading provider of robust data feeds to the ecosystem today. The network is powered by data partners that include Alameda Research, Jane Street, Gemini, CMT Digital, Flow Traders and more. Because Empiric Network is entirely on-chain, protocols using Empiric finally have access to data that is as verifiable, transparent and secure as the smart contracts themselves. Empiric is also pioneering computational feeds that combine its high-quality, real-time market data in novel ways — entirely on-chain and verifiable by leveraging zero-knowledge computation. These advanced computational feeds will enable the next generation of DeFi protocols to go beyond what is possible today.\n\n\n\n\nWe recently raised a $7M seed round led by Variant and joined by ecosystem partners such as StarkWare and Sandeep Nailwal (Polygon), as well as a stellar group of investors such as Thomas Bailey (Road Capital), Marc Bhagarva (Tagomi), Luke Pearson (Polychain), Max Kleiman-Weiner (Sequoia), Tekin Salimi (DAO5), Tarun Chitra (Gauntlet) and Robert Leshner (Compound).\n\n\n\n\nYou can read more at our docs and take a look at our open source code.\n\nWhat You’ll Do\n\nOwn the code for our frontend (React, Typescript), working with designers and business development to create a snappy frontend that helps people understand what Empiric Network stands for\nBuild additional data analysis tools that help users explore our price feeds and see the power of their robustness & transparency themselves firsthand\nHelp define the overall architecture of our solution and set up development processes that enable us to continue to iterate rapidly\nThink from first principles to tackle challenges at the cutting edge of cryptography, smart contracts and data - prioritizing safety and robustness\nHire the brightest and most ambitious technical talent to come work with you\n\n\n\nRequirements\n\nYou're living in NYC and willing to come to the office\nYou're looking for a full time role (no internship / freelance / part time work)\nYou're ambitious and take initiative. You can show off cool side projects with user traction, or past professional experience (e.g. internship)\nExperience as a frontend developer with some experience in data visualization\nExperience with React and Typescript\nPassionate about Web3. You've done at least a side project in Web3 and ideally have previous professional experience in the space.\nPlease share your LinkedIn and Github profiles\n\n\n\nOur Offer\n\nBe at the cutting edge of web3 and help build critical infrastructure for the future of Ethereum\nLearn together with a world-class team, and our friends at StarkWare and within the StarkNet ecosystem\nA fast-paced, no bullshit work environment that has high expectations and helps you achieve them\nWork on a project that is growing extremely quickly and has clear product-market fit in an existing market — while also pursuing moonshot opportunities to re-define trustless data fetching\nAbove-market compensation and meaningful equity\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","junior","entry","level","react"]},{"job":"Product Manager Web","company":"Bullish","location":"New York","post_date":"10d","link":"https://web3.career/product-manager-web-bullish/39716","key":"39716","details":"Focused on developing products and services for the digital assets sector, Bullish has rewired the traditional exchange to benefit asset holders, enable traders and increase market integrity. Supported by the group’s treasury, Bullish’s new breed of exchange combines deep liquidity, automated market making and industry-leading security and compliance to increase the accessibility of digital assets for investors. Bullish exchange is operated by Bullish (GI) Limited and is fully regulated in Gibraltar.\n\n\n\n\nMission: To build technology and tools that make earning, investing and transacting more rewarding.\n\n\n\n\nVision: A world where everyone is empowered to create a better financial future.\n\n\n\n\n\nReports to:\n\nHead of Product\n\n\n\n\n\nDescription:\n\nBullish is seeking an experienced, hybrid Project/Product Manager responsible for working with a cross-functional team to plan, build, deliver, and produce best-in-class web and digital experiences for our brand. We are a global, product-led company working in the crypto exchange space. You will coordinate and work closely with the creative marketing and web engineering teams, and will act as the main point of contact with stakeholders in Marketing, Product, Legal, Comms, Finance, and other departments. The right individual has an in-depth understanding of how impactful digital products can help achieve business goals, and will thrive with an adaptable, influential project management approach. Flexibility for working in a fast-paced team environment on a global level is a must. This is a great opportunity to be part of the emerging digital assets and DeFi ecosphere that is primed for next-level digital experiences.\n\n\n\n\n\nResponsibilities:\n\nDefine and manage the marketing web product roadmap, setting and continuously managing the right expectations with all relevant stakeholders\nCreate buy-in for the web product vision for our marketing site(s) and other digital brand products\nGather, synthesize, and prioritize requirements from key stakeholders across the company to implement business strategy\nWork closely with leadership and Product for seamless incorporation of product data, feature release updates, statuses, and customer flows into the site(s)\nManage overall web project organization, resources, and reporting\nTrack and actualize stakeholder feedback into actionable design/dev tasks\nRun and manage sprints in Jira for the web design team, while coordinating and communicating requirements and hand-offs for development\nDevelop use-cases, requirements and prototypes, working closely with design and engineering\nSupport marketing strategy to create customer-focused experiences and content\nSupport brand and creative goals to ship innovative digital experiences\nMonitor activities of project teams and ensure work is progressing as planned\nFacilitate discussion, review, debriefs, and planning sessions\nDefine & monitor product success metrics\nMotivate and generate enthusiasm within the team\nCultivate a culture of continuous improvement\nWork with teams in the US and globally\n\n\n\n\nRequirements:\n\n5+ years of experience managing the end-to-end production of website builds and digital products\nFormal qualifications in Computer Science, Engineering, Management, Business, Marketing or related field\nAgency or product studio experience is preferred\nExperience working with designers and engineers to iterate on digital products\nRigorous organization and management skills, conscientious and adept at problem-solving at all levels of a project\nPassion for collaboration, documentation, and communication\nExperience using agile and project management methodologies\nExperience with tools like Jira, Github, Trello, Clickup\nExperience with user data analytics tools\nExcellent spoken and written communication skills\nExceptional proactivity and attention to detail\nFamiliarity with Figma, Sketch, Webflow, or other design collaboration tools\nInterest in what digital assets and DeFi technology can bring to the financial industry as a whole\nAdaptable to fast changing requirements, project challenges, and deadlines\nAbility to work across time zones with teams in the US and globally\nGreat attitude!\n\n\n\n\nWe are committed to the health and safety of our employees amidst the COVID-19 pandemic and are compliant with official guidelines. This position may begin working remotely. However, the ability to work on-site is expected as official guidelines evolve. Certain geographic limitations for remote work may apply.\n\n\n\n\n\n\nBullish is proud to be an equal opportunity employer. We are fast evolving and striving towards being a globally-diverse community. With integrity at our core, our success is driven by a talented team of individuals and the different perspectives they are encouraged to bring to work every day.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech"]},{"job":"Front End Engineer","company":"Windranger Labs","location":"United States","post_date":"10d","link":"https://web3.career/front-end-engineer-windrangerlabs/39715","key":"39715","details":"Who we are\n\nWindranger is a product lab working on the BitDAO ecosystem, and other Web3 projects (protocols, DeFi, etc.). You can read more about us here: https://docs.windranger.io/\n\nWe’re looking for the next generation of leaders and doers who have a passion for crypto and are looking to influence the future of Web3. If you value a flexible work environment that’s low ego and is focused on pragmatism over perfection, then keep on scrolling.\n\nAbout This Team\n\nWindranger Labs are looking for a frontend developer to help support ongoing project work, maintain and build promotional landing pages, contribute to building awesome interactive web experiences and help drive a number of key initiatives around building community including open source contributions and hackathons. We are looking for a self starter who has the initiative to self educate and be part of a dynamic fast paced team in a highly collaborative environment. You have a curious mind who probes deeper into requirements and communicates clearly and efficiently with our globally diverse cohort of talented designers, engineers, content creators and product managers.\n\nAt Windranger we value individual contribution and results above all else. You will have the space and freedom to bring creative ideas to the table that help us achieve our goals.\n\nWindranger have an extremely high bar for excellence and hire people who are constantly pushing their personal limits.\n\nWhat you'll help us build\n\n\nSupport on-going maintenance of our growing ecosystem of landing pages and sites\nHelp write articles and blog posts\nContribute to open source projects and improve your public profile\nPotential to travel to events to represent the company\n\n\nYour craft\n\n1-3 years experience in a Front End Engineering role with the ability to show examples of websites, landing pages and components you have built\nExperience with React or NextJS frameworks\nVery strong core CSS/HTML skills\nAbility or desire to learn TypeScript\nFamiliarity with Tailwind\nYou have the initiative and motivation fix bugs or improve processes that you identify\nSeek clarification on requirements where needed\nYou enjoy supporting senior engineers in delivering work\nYou are a curious and pro active learner\nExcellent collaboration and communication skills\n\n\nExtra credit\n\nYou have side projects, open-source work\nWeb3 experience (Ethers, Infura, MetaMask, Wallet Connect)\nDesign System experience\nInteraction and or Animation experience\nFlexibility to travel\n\n\nIf you think you have valuable experience to bring to the organization, but don’t necessarily meet all of the criteria for the role, we still want to hear from you. We consider all applications.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","react"]},{"job":"Program Lead","company":"Gauntlet","location":"New York","post_date":"10d","link":"https://web3.career/program-lead-gauntlet/39713","key":"39713","details":"Gauntlet is DeFi’s risk manager. We drive capital efficiency while maintaining economic safety for some of the largest crypto protocols with our cutting-edge simulations. Gauntlet manages risk and incentives for over $40 Billion in assets.\nGauntlet continuously publishes cutting-edge research, making us the most cited in peer reviewed articles in the DeFi industry. We’re a Series B company with ~40 employees operating remote-first but primarily in New York City.\nGauntlet’s mission is to help make blockchain protocols and smart contracts safer and more trustworthy for users. Building decentralized systems creates new challenges for protocol developers, smart contract developers, and asset holders that are not seen in traditional development and investing. Gauntlet is building a blockchain simulation and testing platform that leverages battle-tested techniques from other industries to emulate interactions in crypto networks. Simulation provides transparency and greatly reduces the cost of experimentation so that teams can rapidly design, launch, and scale new decentralized systems.\nOur goal is to make building an agent-based simulation for blockchains and smart contracts as streamlined as possible. At the core of our infrastructure stack is a blazing fast C++ engine that allows us to simulate protocols, contracts, and network interactions millions of times faster than they run in reality.\nYou will be working as part of an experienced team that has developed simulation software for many other industries, including high-frequency trading, autonomous vehicles and ride-sharing, and the natural sciences.\nThe goal of a Program lead is simple - to manage Gauntlet’s client-facing team and maximize the value they get from our platform.\nResponsibilities\n\n\nEstablish elements for organization-wide program management.\nPlan and facilitate the continuous improvement and management of all Program and CX operations.\nDevelop systems that will assist in prioritization and transparency of resource needs.\nFacilitate and significantly contribute to product releases and roll-outs.\nNavigate governance, product, and go-to-market ambiguity.\nScale the team by identifying gaps, defining roles, and coaching.\nQualifications\n\n5+ years of demonstrated experience in similar roles, focusing on program management, customer success, account/community management, or similar\nExpertise in organizing and communicating both technical and non-technical requirements\nComfortable working with a high level of adaptability and flexibility in a fast-paced environment\nOutstanding project management, organizational, and interpersonal skills\nExcellent communication skills including presentation and executive management\nExceptional attention to detail and ability to prioritize\nDeFi, crypto, web3 or blockchain experience\nBonus Points\n\nStartup experience\nBenefits and Perks\n\nRemote first - work from anywhere!\nCompetitive packages with the added opportunity for incentive based compensation\nRegular in-person company retreats and cross-country \"office visit\" perk\n100% paid medical, dental and vision premiums for employees\nLaptop, monitor, keyboard and mouse setup provided\n$1,000 WFH stipend upon joining\n$100 per month reimbursement for fitness-related expenses\nMonthly reimbursement for home internet, phone, and cellular data\nUnlimited vacation policy\n100% paid parental leave of 12 weeks\nFertility benefits\nPlease note at this time our hiring is reserved for potential employees who are able to work within the contiguous United States and Canada. Should you need alternative accommodations, please note that in your application.\nThe national pay range for this role is $145,000 - $175,000 plus additional On Target Earnings potential by level and equity in the company. Individual compensation will be commensurate with the candidate's experience and local cost of labor.\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead"]},{"job":"Social Media Manager","company":"Zerion","location":"United States","post_date":"10d","link":"https://web3.career/social-media-manager-zerion/39712","key":"39712","details":"Zerion is a web3 smart, social wallet and investing tool that enables anyone with a mobile phone or computer to explore every corner of web3 from DeFi to NFTs - all in one place.\n🚜 What We Need\nThis high-growth role will require you to be community-facing and involve a high level of internal and external communication. You'll need to be comfortable multitasking and executing across the following broad areas:\nCommunity Management & Enablement. We're trusted by thousands of users every day who look to us as a voice through the noise in the wider crypto space. We need you to reflect this responsibility and apply community to data-driven decisions.\nBuild Engaging Social Campaigns. We anticipate scaling DeFi and NFTs to the next billion users. To help us reach our lofty goals, you would be responsible for building scalable community systems, identifying new opportunities for engagement, and help drive our social media roadmap.\nEstablish Positioning & Develop Relationships. Our product and ecosystem are constantly evolving. A large part of your role is to identify target audiences, drive engagement, and develop relationships with peers in partner organization to facilitate joint growth campaigns\n🏋️♀️ What You'll Do\n\n\nYou will be the primary owner of Zerion's community flows by adding meaningful value to our daily DeFi user interactions, increasing brand image, and converting users to lifetime loyal Zerion supporters\nWorking directly with our Growth team, you’ll be responsible for our social media, community management, engagement campaigns, and community calls\nYou will maintain insights from all our community platforms (chiefly Discord, with over 10k members) while spearheading a community calendar with various events and planned improvements\nWith a significant budget at your disposal, you will prioritize and manage new social media activation campaigns, AMAs, community events, visual content, and do whatever it takes to communicate a consistent brand image across all our platforms\nYou will take initiative on aligning and educating teams (internal and external) about the importance of community and stay updated on the latest community management practices in DeFi/Crypto\nThis is a unique hybrid role between the Community and Growth team with the main goal to provide a world-class community experience for Zerion's users and partners\nMemes. You'll be our Chief Vibes Officer and get a unique opportunity to grow your personal brand in the Web3 space!\n\n🤠 Who You Are\n\nYou're passionate about game-changing technology including DeFi, web3, the Metaverse, and NFTs\nYou have exceptional written and verbal communication skills\nYou like to work independently and be a champion of community members representing their voice with empathy\nYou have the ability to manage a community budget for in-person and virtual events, prioritizing high impact projects\nYou like to scale and iterate. We need someone ready to build a long-term scalable process for community at Zerion\nYou have strong working knowledge around community management, engineering serendipity through interaction design, tools to supercharge your productivity, and social platforms with a solid sense for social media and memes\nYou have a growth mindset. You know that growth is hardly ever a perfect process. You are unafraid to make mistakes, go back to the drawing board and proactively act on feedback\nPrior experience in Web3 preferred, ideally as a community manager/growth hacker\n\n👯Pro Tip\nShare the process on how you scaled an awesome community from the grassroots level and engaged your ecosystem with growth-hacks and awareness campaigns. Memes and stories are always a plus 🦄\nWhy You Should Join:\nPurpose: Working towards financial inclusion across the world. You’ll also be joining us at the beginning of a new chapter giving you the opportunity to have a major impact on the future of the company.\nCulture: You'll work in a thriving, friendly, startup environment that promotes open discussions, jokes, learning, video games, and lots of fun. High engagement and low turnover — we really do care about culture and it works: our retention rate is 95%.\nPeople: You'll work with some of the most driven and intelligent people in the crypto space\nSalary & benefits: Get a competitive salary, medical insurance, and other benefits, and compensation will be discussed during the interview process.\nUnlimited days off and flexible work schedule: We want our employees to recharge their batteries and explore who they are outside of the office. Stock options. Relocation is possible: Help with relocation to Portugal for you and your family.\nTravel: Join your colleagues on trips to industry festivals and events.\nDistributed Team: Zerion is a fully remote team with team members all over the world. We believe in asynchronous collaboration, finding your own work rhythm, and a healthy work-life balance. We also have a physical presence in several major cities around the world to make remote work seamless and fun.\nCompany Overview\nHighlights:\n400k Monthly Active Users.\nOne of the largest players in the mobile DeFi space.\n$1.5B transaction volume year to date.\n~100k Zerion NFTs claimed in recent campaigns.\nZerion helps to manage your DeFi and NFT portfolios, trade across 10+ networks and connect to any decentralized application with one wallet. Our mission is to empower more people around the world with efficient, permissionless and transparent financial services. We are fully remote, with team members from Europe, USA, South America, CIS, India, .\nZerion is one of the leading blockchain companies around the world and has been featured in TechCrunch, Forbes, Bloomberg,The Economist and other publications. We’ve already won two UX awards in 2019 and plan to continue pushing the DeFi and blockchain UX forward.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["social","media","non-tech","nft"]},{"job":"Director of Financial Planning and Analysis","company":"Zero Hash","location":"New York","post_date":"10d","link":"https://web3.career/director-of-financial-planning-and-analysis-zerohash/39711","key":"39711","details":"About the Role\n\n\n\n\nAs the Director of FP&A you will be responsible for building and scaling Zero Hash's FP&A function, systems and processes to support management, regulatory and investor reporting requirements. The Director of FP&A’s main duties consist of building the financial reporting models, dashboards and other reports, as well as scaling the team, in conjunction with the CFO.\n\n#LI-Remote\n\nThis fully remote role is open to candidates in any AMER timezone.\n\n\n\n\nResponsibilities\n\n\n\n\n● Build an understanding of business challenges, become a subject matter expert to provide additional insights and solutions to internal and external stakeholders.\n\n● Build a comprehensive FP&A reporting model to support the Company’s growth and international expansion.\n\n● Collaborate with global teams and cross-functional leadership.\n\n● Build or support accounting data interfaces to facilitate regular KPI reporting (internal and external).\n\n● Develop and maintain effective relationships with internal and external business partners and cross-functional teams throughout the Company.\n\n● Collaborate with the accounting team to continue to automate processes.\n\n● Provide insight and projection information to relevant parties.\n\n● Collaborate with the Product, Operations, Risk, and Data Governance teams.\n\n● Proactively identify and research variances to forecast, budget, and historical expenses for improvement.\n\n● Provide action-focused presentations to further Company strategy and initiatives.\n\n● Provide support on data integration activities, as requested.\n\nRequirements\n\n● Minimum 10-12-years FP&A experience, preferably in financial services.\n\n● Post-secondary degree in a business or finance discipline (MBA or CFA, a plus).\n\n● Experience building, leading and developing an FP&A team.\n\n● Experience building an automated FP&A model for forecasting and projections.\n\n● Experience presenting budgets and forecasts to senior management and external parties.\n\n● Experience in a high growth organization.\n\n● Demonstrated ability to effectively document and articulate business issues in a timely and professional manner.\n\n● Effective communicator, both written and oral.\n\n● Strong attention to detail in assessing financial information.\n\n● Ability to adapt and learn new processes and tasks.\n\n● Excellent organizational and prioritization skills.\n\n● Knowledge of a wide range of reporting software (ERPs, expense management tools, TMS, etc.).\n\n\n\n\nPreferred (Optional)\n\n\n\n\n● Minimum five years working in a SaaS, Crypto, Technology, or Financial Services Company.\n\n● Experience managing a remote team.\n\n● Coding and programming experience.\n\n\n\n\nBenefits Offered\n\n\n\n\nWe believe that the best way to succeed is by having a happy, motivated, and healthy team. We offer the following benefits:\n\n● Healthcare Insurance: Zero Hash covers roughly 100% of employee premiums as well as a portion of spouse/children\n\n● Vision & Dental Insurance\n\n● Mental Health and Wellness Program\n\n● Equity Ownership and Early Exercise\n\n● Maternity & Paternity Leave\n\n● Educational budget of $1000\n\n● WFH stipend of $500\n\n● WeWork All Access Membership\n\n● Visa Sponsorship\n\n● 401k\n\n\n\n\nAbout Zero Hash\n\nZero Hash is a B2B embedded infrastructure platform that allows any platform to integrate digital assets natively into their own customer experience quickly and easily (a matter of API endpoints). We power neo-banks, broker-dealers, and payment groups to offer digital asset trading and custody, crypto-backed rewards and round-ups programs as well as yield through staking and DeFi and NFTs.\n\nOur thesis is very simple: every financial services firm will offer digital assets within the next 2 years and will do so through platforms such as Zero Hash. Zero Hash is defining the new FinTech vertical of digital-assets-as-a-service.\n\nClients include MoneyLion, Wirex, Deserve, MoonPay, Tastytrade. Backed by Point72 Ventures, NYCA, Bain Capital, Tastytrade.\n\n\n\n\nThe Zero Hash Culture\n\nAll Zero Hash employees are guided by the following characteristics and core principles:\n\n● Independence/Ownership - An ability to work autonomously. Join Zero Hash, pitch ideas, and shape the work you do.\n\n● Passion - We are innovating quickly and challenging the status quo. We want you to think big, be creative and make a difference every day.\n\n● Collaborative - A good attitude and respect for others. We’re teammates, not co-workers. Everything we do is a shared success and equally a shared failure - we talk in terms of “we” not “me”.\n\n● Initiative - An ability and passion for learning and asking questions. We will champion you, challenge you and push you to achieve your best - and we expect you to do the same.\n\n● Empathy - An ability to listen, respect and understand your co-workers, customers and everyone you interact with no matter how different they are to you. We are proud of our diversity.\n\n● Adaptability - An ability to respond quickly. We are in a fast-paced industry and so we expect you to be creative when solving a new problem and comfortable under pressure.\n\n● Transparency - We believe that transparency is critical to empowering everyone to make the best decisions, both the company to its people and vice versa. Both as an organization and as individuals, we need to admit mistakes and learn from them.\n\n● Integrity - Integrity creates trust. As both an organization collectively and as individuals, it is our most valuable asset.\n\n\n\nFor candidates based in Colorado, please contact colorado-wages @zerohash.com to request compensation and benefits information regarding a particular role(s). Please include with you email the city you reside (or intend to reside in Colorado) and the title/link to the roles you're interested in.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","finance"]},{"job":"Staff Software Engineer Crypto Trading Infrastructure","company":"Ripple","location":"New York","post_date":"10d","link":"https://web3.career/staff-software-engineer-crypto-trading-infrastructure-ripple/39710","key":"39710","details":"This person can be located in our Toronto, Remote (US), New York City, San Francisco, or Miami office.\n\nRipple’s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of massive scale spanning $155 trillion in annual cross border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year.\n\nWe are looking for a software engineer to join our team building liquidity services at Ripple. Our liquidity platform and products enables businesses to offer crypto trading services to their end customers, and is a key part of Ripple’s strategy to simplify access to crypto liquidity for enterprises. In this role, you will mentor other software engineers, setting and demonstrating high standards and technical excellence. As a member of a new initiative, you must be passionate about inventing and delivering customer-focused solutions to ambitious and ambiguous challenges.\n\nWHAT YOU’LL DO:\n\nBe an entrepreneurial builder, working up and down the stack, mixing software engineering, data engineering, and knowledge of machine learning deployments to jumpstart this new initiative.\nDeliver reliable, high-throughput, low-latency (micro)services to power optimized decision-making at scale.\nParticipate in the full software development lifecycle, from sculpting technical vision and software design to unit and integration testing\nWork with teams across the organization, including product, design, marketing, integrations, ops, customer success, legal and more\nBe a technical subject matter expert, provide technical leadership and share your expertise with a growing team of engineers\nContinuously raise our standard of engineering excellence by implementing and driving best practices for coding, testing, and deployment\n\nWHAT WE’RE LOOKING FOR\n\n8+ years of hands-on Software Development experience on large scale distributed systems, with the last 5-7+ years in Java or similar (Go, Python) and 2+ years experience working as a tech lead\nExperience building and deploying containerized applications (e.g. Docker) into modern distributed computing environments such as Kubernetes\nExperience in building transactional systems (preferably in finance / banking / e-commerce domains) , backed by an scalable data stores and other cloud data services to manage large, structured event data sources such as tick data\nExperience with Agile development of distributed services, with a focus on robust software design, scalability and security\nEagerness to work openly and collaboratively with a diverse team\nAbility to encourage and drive engineering best practices\nA positive attitude and a passion for sharing knowledge\nBS in Computer Science or similar\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","crypto","java"]},{"job":"Senior Full Stack API Engineer Infura NFT","company":"MetaMask","location":"United States","post_date":"10d","link":"https://web3.career/senior-full-stack-api-engineer-infura-nft-metamask/39709","key":"39709","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society.\n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.\n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nAbout Infura\n\nInfura is the leading infrastructure platform providing scalable and easy-to-use APIs and cloud solutions for blockchain and decentralized application developers. Infura currently offers APIs for Ethereum, IPFS, and other leading decentralized networks, allowing developers to immediately begin building instead of spending time on architecting and maintaining their own infrastructure.\n\nInfura provides developers instant access to decentralized and blockchain networks without the need to sync or understand complicated peer to peer infrastructure. Similar to how one might access a cloud service to alleviate the friction of owning proprietary compute and storage, Infura lowers the barrier to entry for engineers to begin building.\n\nWe believe in a more equitable and decentralized future, and we know developers will be at the forefront of that progress. We want to empower developers to spend their time building, creating, and evolving by providing them with the best and easiest solution to their infrastructure needs.\n\nSome things to know about the Infura team, we are a remote first company, with team members all over the world. We strive to reduce meetings, respect work life balance, promote diversity, and generally be good people. We depend on each other not only to make an amazing product but to be a group that wants to succeed together.\n\nWhat you’ll do\n\nYou will be working on a product team that is developing a world class NFT API that provides developers a suite of tools to rapidly build their projects. You will interface with multiple chains to provide a consistent ergonomic API on which to interact with NFTs. You will use the experience you have building ReSTful APIs to iterate on features, harden, scale, and optimize our NFT offering. You will work directly with various blockchains to implement read and write features. You will also help scale this api to be a low latency, highly scalable, and highly performant API.\n\nWould be great if you brought this to the role\n\nYou understand full stack development. You understand how to produce an API that not only makes sense to a developer audience, but also makes it enjoyable to work with. You bring an understanding of how APIs fit into various technical projects (running server side or built into a web application). You have mastery over javascript and typescript and you understand nodejs. You have a deep understanding of various API formats (ReSTful, GraphQL, JSONRPC) and techniques of how to build features into them (Paging, session management, authentication, query interfaces, etc) This is a backend oriented role and having mastery over scalable server architectures will help you succeed in this role.\n\nIt would be beneficial to have experience in: performant nodejs, CDNs, caches, proxy technologies, blockchain knowledge (particularly in EVM related blockchains), CI/CD, Kubernetes, and operating cloud based systems (especially AWS).\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $104,000 - $247,00/year.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n#LI-JL1\n\nMetaMask focuses on Cryptocurrency, Blockchain / Cryptocurrency, and Web3. Their company has offices in San Francisco, London, Brooklyn, and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://metamask.io or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["api","dev","full","stack","senior","nft"]},{"job":"Head of Finance Comptroller","company":"Larson Maddox","location":"San Francisco","post_date":"10d","link":"https://web3.career/head-of-finance-comptroller-larsonmaddox/39707","key":"39707","details":"A crypto hedge fund is looking to add a driven, detailed, and engaging Head of Finance & Comptroller to its compliance and financial services department. A major focus of the role will be on tax, accounting, audit and compliance matters. In this role you will be offered the opportunity to work with a growing crypto firm that is excelling in the space. The position creates a path for professional growth and developmental opportunities in the financial services industry. The opportunity will sit in a remote setting, with their office out of the Bay Area.\n\n\n\n\nResponsibilities include…\n\nImplementation of the financial framework, monitoring of business processes, and ensure the integrity of the data\nManage the company's financial operations such as payroll, incoming and outgoing invoices, expense reports and receipts, and cryptocurrency transactions\nIdentify and address financial risks and opportunities to the company; conduct internal and external audits\nOversaw the legal and regulatory documents/forms are filed and monitor compliance with applicable laws and regulations\nConduct financial, compliance, and tax analysis and research\nCollaborate with the senior leadership team on data analysis, research, forecasting and validation of plans for the financial strategy of the company\n\n\n\nQualifications include…\n\n7+ years of experience in a senior finance leadership role\nExperience with crypto and crypto fund administrators\nAbility to communicate directly with all levels of the organization\nStrong knowledge and work experience background with tax, audit, and compliance matters for a finance company\n\n\n\nBenefits include...\n\nCompetitive salary\nFull Benefits (medical/dental/vision/401k)\nRemote work structure\n\n\n\nIf interested in this opportunity, feel free to click the above link for immediate consideration!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","finance"]},{"job":"Blockchain Developer","company":"Digital Insight Games (DIG)","location":"United States","post_date":"10d","link":"https://web3.career/blockchain-developer-digitalinsightgames-dig/39706","key":"39706","details":"About Digital Insight Games (DIG)\n\nWe are a team of experienced and passionate game developers that have worked on A LOT of titles. Among them are Might and Magic, Call of Duty, Tomb Raider, Gran Turismo, and Left 4 Dead, just to name a few. In fact, our co-founder Jon Van Caneghem is in the Computer Gaming World Hall of Fame and we’re deeply focused on creating compelling games for players around the world. Our tools and technology are state-of-the-art, we strive to maintain a happy and dedicated team, and work together each day to improve our games and company until we become the best in the world. All of it remotely…\n\n\n\n\nIf you would like to be part of this, we would love to hear from you.Please contact us at: apply@digitalinsightgames.com\n\n\n\n\nTo learn more about DIG, please visit www.digitalinsightgames.com\n\nBlockchain Developer\n\n\n\n\nResponsibilities:\n\nAuthor Solidity Smart Contracts\n\nWrite Test Plans for Smart Contracts\n\nParticipate in Smart Contract Audit Process\n\nAttend planning and status meetings as needed\n\nBuild web code to support blockchain functionality\n\nConduct research and report on options for blockchain related implementations\n\nProvide time estimates for tasks.\n\nRequirements:\n\nB.S. in computer science or equivalent experience.\n\n2 Years+ Solidity Development Experience\n\nBonus:\n\nExperienced making REST calls with curl and Postman, and general HTTP/REST type calls\n\nExperience in JavaScript/Typescript, writing front end code that interacts with browser based wallets and blockchains.\n\nFamiliar with general programming principals, design patterns.\n\nBenefits:\n\nHighly competitive compensation package that included equity and revenue share.\n\nBest in class healthcare and other insurance benefits.\n\nRemote work compatible.\n\nGenerous vacation.\n\nDigital Insight Games is an Equal Opportunity Employer. We recruit, interview, and hire people of all backgrounds, orientations, identities, and expressions.\n\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain","solidity","javascript"]},{"job":"Staff Software Engineer Crypto Trading Infrastructure","company":"Ripple","location":"Miami","post_date":"10d","link":"https://web3.career/staff-software-engineer-crypto-trading-infrastructure-ripple/39704","key":"39704","details":"This person can be located in our Toronto, Remote (US), New York City, San Francisco, or Miami office.\n\nRipple’s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of massive scale spanning $155 trillion in annual cross border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year.\n\nWe are looking for a software engineer to join our team building liquidity services at Ripple. Our liquidity platform and products enables businesses to offer crypto trading services to their end customers, and is a key part of Ripple’s strategy to simplify access to crypto liquidity for enterprises. In this role, you will mentor other software engineers, setting and demonstrating high standards and technical excellence. As a member of a new initiative, you must be passionate about inventing and delivering customer-focused solutions to ambitious and ambiguous challenges.\n\nWHAT YOU’LL DO:\n\nBe an entrepreneurial builder, working up and down the stack, mixing software engineering, data engineering, and knowledge of machine learning deployments to jumpstart this new initiative.\nDeliver reliable, high-throughput, low-latency (micro)services to power optimized decision-making at scale.\nParticipate in the full software development lifecycle, from sculpting technical vision and software design to unit and integration testing\nWork with teams across the organization, including product, design, marketing, integrations, ops, customer success, legal and more\nBe a technical subject matter expert, provide technical leadership and share your expertise with a growing team of engineers\nContinuously raise our standard of engineering excellence by implementing and driving best practices for coding, testing, and deployment\n\nWHAT WE’RE LOOKING FOR\n\n8+ years of hands-on Software Development experience on large scale distributed systems, with the last 5-7+ years in Java or similar (Go, Python) and 2+ years experience working as a tech lead\nExperience building and deploying containerized applications (e.g. Docker) into modern distributed computing environments such as Kubernetes\nExperience in building transactional systems (preferably in finance / banking / e-commerce domains) , backed by an scalable data stores and other cloud data services to manage large, structured event data sources such as tick data\nExperience with Agile development of distributed services, with a focus on robust software design, scalability and security\nEagerness to work openly and collaboratively with a diverse team\nAbility to encourage and drive engineering best practices\nA positive attitude and a passion for sharing knowledge\nBS in Computer Science or similar\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","crypto","java"]},{"job":"Marketing Specialist","company":"Ripple","location":"New York","post_date":"10d","link":"https://web3.career/marketing-specialist-ripple/39703","key":"39703","details":"Ripple’s Marketing team is growing and we are looking for a highly motivated and organized individual to coordinate and execute marketing initiatives for the Integrated Marketing team.\n\nThe ideal candidate is a positive self starter who can take on tasks and projects with minimal direction. This person should be comfortable managing their time day-to-day to meet deliverable deadlines while working cross-functionally with internal team members and external vendors in a highly collaborative environment,\n\nIf you have excellent communication skills, enjoy a fast-paced environment, and are eager to learn more about the crypto and blockchain industry, we want to meet you.\n\nWHAT YOU’LL DO:\n\nSupport teams across all integrated marketing areas including social, content, digital, events, ops, growth, corporate brand, and talent brand\nCollaborate with cross-functional and external teams to generate content, marketing assets, project plans and timelines\nManage calendar for programs to provide transparency, follow up on milestones and deliverables, and create alignment with key stakeholders\nSupport new vendors and agencies through contracting, invoicing and onboarding\nHelp track budgets and expenses across marketing programs\nProduce and support the upkeep of reports for marketing-related activities on a monthly/quarterly basis\nCollaborate with cross-functional teams to identify and drive areas for operational efficiencies\n\nWHAT WE’RE LOOKING FOR:\n\n2+ years experience in marketing\nOutstanding verbal and written communication skills with serious attention to detail and a commitment to excellence\nAbility to multitask, prioritize, and utilize resources to execute multiple projects and tasks within a deadline-oriented environment\nMust have strong organizational and project management skills\nMust have strong analytical skills to analyze metrics and report data\nProactive, energetic and a team player who is relentless in the pursuit of moving the needle\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech"]},{"job":"Senior Full Stack Blockchain Engineer","company":"QuarryChain","location":"UT Salt Lake City US","post_date":"10d","link":"https://web3.career/senior-full-stack-blockchain-engineer-quarrychain/39702","key":"39702","details":"Company Overview:\n\n\n\n\nQuarryChain is an advanced blockchain network that will provide an ecosystem of tools that enable developers to create and deploy smart contracts and decentralized applications (Dapps), freely own, and store data and other content at high speed, low cost, and with a minimal environmental impact, and with greater decentralization and governance over current blockchains.\n\n\n\n\nQuarryChain will also solve major roadblocks to the adoption of blockchain technology, enabling businesses and industries around the world to continue using, scaling, and reaping the benefits of this increasingly important technology.\n\n\n\n\nQuarryChain's core philosophy and key objective is to “Get Quality, with Quarry”. QuarryChain will be creating outstanding value and benefits worldwide for a variety of user groups and industries. Everything from Finance, Real Estate, Precious Metals, Collectibles, Health, Energy, Environment, Manufacturing, and intangible assets.\n\n\n\n\nRole Summary:\n\n\n\n\nWe are currently seeking a highly motivated and skilled full-stack engineer who is passionate about the applications of blockchain technology in Finance. We're looking to develop a three stack layer divided into a Storage Layer, Core Layer, and Application Layer. The consensus we are looking to develop is called “Delegated Proof of Stake”.\n\n\n\n\nRequirements:\n\n\n\nSenior-level engineering experience\nExperience in either Solidity, Python, Java, Rust, Go, CSS\nExperience in building & launching a blockchain network\nFamiliarity with basics of cryptography and cryptographic algorithms\nExcellent writing and communication skills\nExperience in working with diverse blockchain/distributed ledger implementations\nFamiliarity with DEX’s and/or yield farming\nProficient in English\nUS based (ideally Salt Lake City, but we are open to remote work)\n\n\n\nBenefits:\n\n\n\nYou will have the opportunity to work for a fast growing start-up and build a meaningful career that positively impacts people’s lives, including yours\nFlexible Work Environment\nRemote Work (US Based)\nCompetitive Pay + Equity (Tokens)\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","senior","blockchain","solidity"]},{"job":"Director of Engineering","company":"Transmute","location":"Austin","post_date":"10d","link":"https://web3.career/director-of-engineering-transmute/39701","key":"39701","details":"The Transmute team is looking to add a Director of Engineering with specific expertise in enterprise security software development, engineering management and technical product strategy. This is a senior role that reports directly to the CTO.\n\nYour primary responsibility will be to build and lead a high-performing team of engineers who can build enterprise-scale B2B products. Writing code regularly is not a requirement, but weighing in on architecture decisions, technical product direction, and software development lifecycle issues is.\n\nResponsibilities\n\n\nLead recruiting, interviewing and hiring of the engineers, with clear goals of of their areas of focus within Transmute and their growth trajectory\nOversee end-to-end development for the core product and contributions to open source community\nMonitor reliability and performance of all internal systems to suggest improvements\nWork with non-technical stakeholders and the product team to refine and prioritize the product roadmap for customers, investors, the internal engineering team and the open source technical community\nEngage with the product team to set engineering priorities and plan sprints and product delivery effectively\nSupport product, sales and marketing team in technical conversations with prospective and current customers\nCoordinate with external stakeholders for new integrations with 3rd-party products and enterprise systems\nLead technical innovation with development of experimental prototypes to test technologies, tools and development approaches\nDevelop and maintain security policies, procedures and documentation\nAttend technical conferences, publish blog posts, and develop corporate thought leadership in the areas of Enterprise Identity Access Management (IAM), Security Audit and Compliance, and Decentralized/Blockchain Technology\n\n\nRequirements\n\nDesired Experience\n\nAt Transmute we are looking for great people and are open to different education and professional experiences. Please apply if you believe you are a good fit!\n\nMinimum Experience...\n\nForce multiplier: a team player who makes everyone around them better.\nExperience managing and growing a team of more than 3 engineers for a period of longer than 2 years\nKnowledge of professional software engineering best practices for the full software development lifecycle, including coding standards, code reviews, source control management, build processes, testing, and operations\nFamiliarity with semantic web technologies and graph database technologies such as OntoText, Neo4j\nExperience defining and leading the delivery of an API portfolio that is consumable by both internal and external parties (including open source community)\nUnderstanding of microservices architecture and cloud infrastructure\nFamiliarity with Rest API Design, OpenAPI / Swagger, GraphQL, JSON and XML\nFamiliarity with standardized protocol for internet token-based authorization such as oAuth\nFamiliarity with tools such as Jira, Postman, Google Console Log\nSeveral years experience directly involved in the process of defining, designing, testing, deploying and maintaining production software applications in conjunction with technical teams\n\n\nBonus Experience & Skills...\n\nFoundational knowledge of Verifiable Credentials (VCs), and Decentralized Identifiers (DIDs)\nExperience managing an API-based product for an open source community\nExperience leading development of B2B products\nExperience leveraging the latest decentralized technologies (Ethereum, IPFS, etc.)\nExperience building complex software systems, successfully delivered to customers\nCI/CD background with architectural knowledge around how services are constructed\nExperience in communicating with users and other technical teams, managing requirements collection, feature definition, and technical designs\n\n\nBenefits\n\nOur Technology\n\nWe leverage emerging cryptography for legacy systems to drive cost savings and revenue for businesses. We use Jira to plan and manage two-week sprints with a goal of at least monthly minor releases.\n\nWhile we will continue to integrate new technologies into the Transmute Platform, our current tech stack includes:\n\nReact, Node.js, and JavaScript for middle-tier and front-end\nMongoDB for Database\nAuth0 for Authentication\nSolidity for our Ethereum Smart Contracts\nEthereum and IPFS for decentralized services\nGithub for version control and CI/CD\n\n\nOur Offer\n\nTransmute is a small and growing team backed by Techstars. We are headquartered in downtown Austin, TX, but are a remote-first company committed to adding the best talent to our team from around the world. We’re good at what we do and enjoy working on emerging technology.\n\nWe strongly believe in and adhere to our values including flexibility, mutual respect, and open-source innovation. We provide team members with the kind of commitment and support that only small, agile startups can. We value individual and professional growth and are committed to the long-term success of our team.\n\nPay is contingent on experience.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","react","solidity","ethereum","javascript"]},{"job":"Product Manager Digital Asset Security","company":"Ripple","location":"London","post_date":"10d","link":"https://web3.career/product-manager-digital-asset-security-ripple/39700","key":"39700","details":"Ripple is a crypto solutions company that is driving a new era in finance, doing for value what the internet did for information: enabling its instant and seamless flow around the world. We call this the Internet of Value, and in the short term its development will create powerful gains in financial efficiency, access and inclusion, using cryptocurrency as a universal asset. Long term it will launch - just as the original internet did - new industries that bring people and places closer together, and this time related to money, and every other kind of value as well: from stocks to art, scientific discoveries to commodities, votes to intellectual property, and more.\n\nTo get value to move like information moves today, we build on and support the development of one of the world’s fastest, most sustainable and reliable public blockchains. We build everything with both an inclusive vision and pragmatism, so while others are incrementally improving the digital economy through apps and technical workarounds, our team is fundamentally re-engineering the way value moves. It’s already driving new efficiencies to help businesses be more successful and diverse, helping people make the most of their money - and we’ve only begun to discover what it’s capable of doing.\n\nWith offices in San Francisco, New York, London, Mumbai, Singapore, São Paulo, Reykjavík, Washington D.C., and Dubai, we have more than 500 global employees and hundreds of customers (including some of the world’s biggest banks) in more than 55 countries and six continents.\n\nThe Role:\n\nThe Product Manager will be responsible for core functional aspects of defining our product strategy and development in the digital asset security space, including protection, access, support and functionality. The ideal candidate is data-driven, process oriented, technically adept and has a proven track record of achievement.\n\nResponsibilities include product expertise, the creation of product requirements, project schedules and supporting materials in partnership with engineering, design, legal, compliance, content and service teams. The product manager provides day-to-day cross-functional leadership to ensure the timely delivery of projects which meet established feature, usability, content and quality requirements.\n\nThe successful candidate should thrive in a fast-paced, collaborative, process-driven environment and be able to adapt and adjust plans on-the-fly. The position requires interaction with a wide variety of internal stakeholders at various levels of the organization. Candidates must possess the ability and willingness to balance client needs with business priorities and articulate the rationale behind decisions. They must also have exceptional project management skills.\n\nResponsibilities:\n\nCollaborate cross-functionally with engineering, design, legal, finance, marketing, compliance and other teams to develop and steer product strategy, roadmaps, and business plans\nExecute all phases of the product development lifecycle (e.g., lead the development of new product features and initiatives from ideation and MVP through to scale)\nPerform research and competitive analysis to gain market insights across the industry\nDefine and analyze metrics, and iterate quickly to deliver superior UX. Be the ultimate owner of product performance and business impact\nWrite technical PRDs, manage backlogs, and effectively prioritize new features vs. tech debt\nDevelop product documentation, specifications, wireframes, site-maps, and process flows\nEngage in extensive User Acceptance Testing, ensuring products are built to requirements\nFacilitate communication across all project phases and proactively alert management of changes to scope, timelines and resources\nEngage with customers to understand their problems and how best to solve them\n\nRequirements:\n\nExperienced product manager; preferably in crypto, tech, fintech or financial services\nSelf-described as some combination of the following: creative, humble, ambitious, detail oriented, hard working, trustworthy, eager to learn, methodical, action oriented, and tenacious\nStrong quantitative and analysis skills, including SQL and a language like Python\nStrong verbal and written communication skills\n\nDemonstrated ability to lead projects affecting many functions, including product, engineering, finance, legal, compliance, and support\nSolution oriented, highly-motivated and proactive self-starter that is outstanding at building relationships and collaborating with peers, senior leaders, and cross-functionally to prioritize and produce not only great results, but also great experiences doing the work\nStrong grasp of information architecture and user experience best practices, including:\nExperience writing specs, PRFAQs, PRDs and creating roadmaps with product and engineering team members\nExperience designing/documenting REST APIs with modern tools, e.g. OpenAPI\nDeep understanding of project management principles and best practices, including ticket management in tools like JIRA\nStrategic thinker who applies creativity to problem solving, and handily takes a big idea from thought through to execution with a track record of success breaking down and solving ambiguous problems\nProven success building product experiences\nDeep empathy about the end-user experience and creating business value\n\nPreferred Qualifications:\n\nExperience in either (or both) traditional finance and the digital asset / crypto space, including experience working in a regulated environment and collaborating with legal and compliance teams\nUnderstanding of custody, credit, and settlement mechanisms and networks\nFamiliarity with Multi-Party Computation (MPC), Hardware Security Modules (HSM's) and Role-based Access Controls (RBAC)\nBackground in computer science, software engineering or applied mathematics\nExperience building and leading teams\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","security"]},{"job":"Chief of Staff Engineering","company":"dYdX","location":"New York","post_date":"10d","link":"https://web3.career/chief-of-staff-engineering-dydx/39698","key":"39698","details":"Hi, I’m Kyle, the Head/VP of Engineering at dYdX 👋 I’m looking to hire a Chief of Staff\n\nAt dYdX Trading, you will have an opportunity to build state-of-the-art decentralized technology that will redefine global financial markets. By joining us at this early stage you will make fundamental decisions that will shape the course of dYdX.\n\n→ Learn more about working at dYdX\n\nABOUT dYdX:\n\ndYdX is founded by an ex-Coinbase, ex-Uber engineer, with a Princeton CS background. Our team has previous experience at Google, Bloomberg, Amazon, Facebook, Lyft, NerdWallet and other top companies\nWe're a world-class team with top backers and advisors, including Andreessen Horowitz, Polychain Capital, Paradigm, DeFiance Capital, Brian Armstrong, Fred Ehrsam, Naval Ravikant, Elad Gil and more\n\ndYdX is the world’s leading decentralized exchange by trading volume. We’ve raised $87m from the top investors in crypto, and I’m fortunate to have the best advisors & coach in the space. In the past year we’ve grown from 15→40 and have entered the growth stage of the company.\n\nThis Chief of Staff position is not an assistant role - you’ll have unlimited access to all my communications, interactions with the team, and thought process. You’ll be my partner in running the business and over time will take a large amount of responsibility for operating the company.\n\nTo learn more about the role, check out my coach Matt Mochary’s post and video on the Chief of Staff role.\n\nAs my Chief of Staff you’ll have the opportunity to supercharge your learning on operating startups and thinking like a founder. The experience should set you up well for success as a founder, executive, or whatever you’d like to do next!\n\nREQUIREMENTS:\n\nFamiliarity with coding languages and software engineering processes\nExcellent verbal and written communication skills\nExcellent culture fit. Get along with me and the team interpersonally very well\nHighly organized\nHigh initiative. Founder mentality\nGreat first principles thinker. You’ll be one of my main thought partners\n2+ years of full-time work experience\nA strong knowledge of and interest in tech startups\nStrong work ethic and willingness to take on any task\nYou will shadow me in the beginning, and then will take off of my plate all of the tasks that need to get done, but I don't want / have time to do\n\nPREFERRED:\n\nA strong interest or curiosity in crypto & web3\nEither a consulting or founder background. Ideally both\nComputer Science or Engineering background. Ability to understand complex technical blockchain topics\n\nSalary range for this role is $109K to $200K USD (CA, NY, or remote). Compensation subject to experience and location. Published salary bands pursuant to transparency laws, and do not include possible variable compensation such as annual merit increases, bonus eligibility, commission, or equity incentive.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","recruiter","non-tech"]},{"job":"Director Of Marketing Full time Remote","company":"Hike","location":"Delhi","post_date":"10d","link":"https://web3.career/director-of-marketing-full-time-remote-hike/39696","key":"39696","details":"At Hike, we’re building the Rush Gaming Universe 🎮 📲 💰\n\nTo know more, check out work.hike.in\n\nDirector of Marketing\n\nAs Director of Marketing at Hike, you will be responsible for planning and leading the marketing efforts, aimed at positioning RGU as a prominent Gaming Brand in the country.\n\nYou will be required to drive best-in-class creative campaigns to promote upcoming products/features and Social Marketing efforts to impact business growth.\n\nIn this role, we’re looking for a strategic leader who can take on ambiguous problems, bring definition and clarity to how to organise a diverse team to deliver exponential impact. You need to have exceptional written, visual and verbal communication skills, the ability to manage complex stakeholder environments and a passion for rallying people around a single unified plan.\n\n\nSkills & experience we're looking for 👨‍💻\n\n8+ years of full-stack marketing and senior leadership experience with business-to-consumer marketing, ideally in gaming and/or technology products, and strong consumer brand sensibilities\nPassionate about gaming and crypto.\nHave a deep appreciation for the romantic value of the products and is obsessed with inventing on the customer’s behalf.\nBelieves in first-principle and second-order thinking, and is obsessed with staying close to the core building blocks and keeping things incredibly simple\nExperience launching new AAA games or marketplace platforms to the public\nBest-in-class brand builder and storyteller; proven success crafting brands from the ground up and a track record of building brand engagement and generating business growth\nHistory of launching successful campaigns using components of guerrilla, grassroots, and viral marketing\nExperience building reporting dashboards and synthesising complex data points and KPIs to generate easy-to-understand executive reports\nYou have excellent spoken and written communication skills, allowing you to deliver complex information clearly to your colleagues and through marketing material\nDemonstrated effective leadership - people management experience is important\nBuild and evolve product positioning and key messaging for use in external communication, identify value propositions and key messages that bond the right players to our games\nHighly customer focused and data literate. Able to interrogate market, consumer and customer data and present recommendations on market and consumer\nDevelop consumer marketing strategies to successfully establish the Rush brand; driving awareness, growth and dedication through traditional media, digital, social, partnerships and owned channels\n\n\nYou will 📲\n\nDevelop and execute the vision and strategy to achieve RGU business targets through customer-focused and data-driven marketing campaigns across all performance channels, including search, display, social, video, sponsored content, affiliate, and others\nDesign brand positioning and messaging strategy across channels to drive market awareness, customer acquisition, and loyalty\nIdentify value proposition, product positioning, and key messages, and write creative briefs to ensure we produce best-in-class creative, which is consistent across all channels and resonates with consumers\nAssess upcoming product and feature launches to identify bigger stories or position multiple launches in a clear way for consumers\nPartner with your peers in Product Management, Community Management and Developer Relations to drive adoption, engagement and revenues\nCreate and direct market, competitive and user research\nDrive and optimize our SEO strategy to reach the most relevant audience at the best time to grow our audience\nAnalyse the performance of all marketing programs (including ad spend) to identify the best opportunities for optimisation, and regularly iterate to maximize performance\nWork with finance to plan and maintain a marketing & advertising budget that priorities low-spend/high-impact campaigns\n\n💰 Benefits → We have tremendous benefits & perks. Check out work.hike.in to know more\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","executive","full","time","marketing","non-tech"]},{"job":"Sales Director; Web3","company":"Halborn","location":"United States","post_date":"10d","link":"https://web3.career/sales-director-web3-halborn/39695","key":"39695","details":"Sales Director; Web3\n\n\nWe are looking to bring in a Sales Director focused on Web3 builders and enterprise fortune 500 customers to join our growing sales team. \n\nResponsibilities\n\nTenaciously sourcing and securing qualified sales opportunities through prospecting and proactive outreach. \n\nOwn all aspects of the  sale from aggressively prospecting and generating new business opportunities to navigating the legal review of a contract\n\nConduct well-informed and consultative meetings with client stakeholders up to the C suite level that demonstrates the value of Halborn through our innovative services and products.\n\nDevelop and execute account strategies that align the company resources to maximize sales volume and revenue.\n\nConduct deep discovery into the account’s business and link those needs to the Halborn solution.\n\nAct as a trusted advisor to the potential clients to build strong relationships and connection with Halborn\n\nNegotiating balanced initial deal terms, renewals and expansions that profit Halborn while benefiting the client.\n\nDevelop and execute on impactful close plans that ensure a high level of conversions from prospect to sale \n\nProvide up to date and accurate monthly forecasts as well as actively update all things in Salesforce\n\nLeverage and coordinate cross-functional internal teams to efficiently navigate complex sales cycles\n\nSecure or maintain legal docs including MSA’s and other strategic agreements to facilitate revenue.\n\nWhile responsible for assigned quota, account penetration and balanced sales growth are important performance measures.\n\nLeverage team members availability, roles, and strengths and weaknesses into virtual team effectiveness.\n\nSome account management includes establishing and maintaining current customer relationships by responding to customer requests and managing/resolving customer issues.\n\nUpdating, maintaining and improving our CRM process and your pipeline.  We use hubspot.\n\nParticipate in marketing events such as seminars and trade shows to represent Halborn and build both brand awareness and business pipeline.\n\nQualifications\n\n5-10 years demonstrated track record of winning new business in the technology space coupled with strong exposure to the cybersecurity industry. \n\nSome experience selling technology services to enterprises with blockchain, crypto or cybersecurity strongly preferred (but not required)\n\nConsistent and proven delivery of attaining revenue targets/goals and quota attainment as well as driving business growth.\n\nExtremely Well-versed in Retailer-specific marketing challenges and solutions landscape\n\nPassionate about forecast accuracy and sales hygiene. Dedicated follow up skills that allow nothing to fall through the cracks.\n\nStrong executive presence and great presentation skills along with high confidence in engaging with diverse decision makers. Prior experience selling directly to senior leaders and executives with the ability to influence.\n\nPowerful communication and interpersonal skills are critical. Highly articulate via phone, email and in person is a differentiator, along with a positive engaged approach to working collaboratively with internal and external  colleagues.\n\nOrganizational agility in navigating and partnering effectively and leading cross-functional teams towards a goal\n\nInspired by working in in a constantly changing and evolving work environment where growth is non-stop\n\nHigh self awareness and emotional intelligence\n\nWillingness to learn technical aspects of blockchain and cybersecurity\n\nAbility to travel up to 40%\n\n\n\n\nBonus Points:\n\n* Multi-lingual\n\n* Preexisting directory of contacts in the Web3 ecosystem\n\n* Knowledgeable of the latest trends in Blockchain and DeFi\n\n* Knowledge of Cybersecurity landscape and selling infosec services or products\n\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","sales","non-tech"]},{"job":"SOC Engineer SG","company":"Coins.ph","location":"Singapore","post_date":"10d","link":"https://web3.career/soc-engineer-sg-coins/39693","key":"39693","details":"SOC Engineer (SG)\nHybrid – Singapore /\nOperations – Security /\nFull-time Employee\n\nApply for this job\nJoin the leading Crypto exchange in Asia!\n\n\nCoins.ph is on a mission to create an open financial system by providing everyone easy access to Web3 and digital assets. A regulated entity, Coins is the most established crypto brand in the Philippines and has gained the trust of more than 16 million users. Through the easy-to-use mobile app, users can buy and sell a variety of different cryptocurrencies and also access a wide range of payment services.\nWhat you will do\nIntegrate various logs sources with SIEM / Data Platform;\nAutomate the detection and response tasks;\nSIEM / Data Platform content improvement;\nCommunicate with all levels of technology and operational staff, assist in the creation and follow methodologies, creating clear, concise deliverables.\nQualification and Skills\n3-5 years of experience in an Information Security role;\nScripting in Python, Bash, or any other scripting languages;\nSQL knowledge;\nExperience with automating incident detection and response;\nIntermediate knowledge of the English language.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev"]},{"job":"Solidity Instructor","company":"RareSkills","location":"United States","post_date":"10d","link":"https://web3.career/solidity-instructor-rareskills/39692","key":"39692","details":"If you are an exceptional smart contract developer with a passion for teaching others, this is the role for you.\n\nKnowing solidity is not enough. You must be comfortable programming in raw bytecode and parsing calldata and memory manually. You must be able to describe and implement design patterns such as proxies, diamond standard, and other patterns very few know about. You should be familiar with both the NFT and DeFi ecosystem.\n\nAlternatively, you are a Solana pro who can explain how compute units are determined in a calculation and can build an application without the aid of the Anchor Framework.\n\nIf you can program zero knowledge applications, all the better!\n\nProfesssional blockchain development experience is required.\n\nThis is a part time job that only requires a few hours per week. You will mostly be doing code reviews and sometimes holding an office hour.\n\nThe most important thing is that you are passionate about learning and understanding a subject thoroughly and can share that passion with others.\n\nHourly rate starts at $150 USD and goes up from there.\n\nCheck us out at RareSkills.io\n\nRareSkills focuses on Blockchains, Blockchain / Cryptocurrency, and Web3. Their company has offices in United States. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://rareskills.io or find them on Twitter and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["teaching","solidity","solana","nft"]},{"job":"Software Engineer","company":"Sopheon Corporation","location":"Remote","post_date":"10d","link":"https://web3.career/software-engineer-sopheon-corporation/38658","key":"38658","details":"Innovation is about getting your most powerful ideas to market.\n\n\nThat’s why we’re here. Sopheon sets the standard in developing the tools you need to capture the ideas in front of you that have the highest potential (value, adoption, impact), and capitalize on them by efficiently and effectively getting them into customers’ hands. Forever finding new ways forward is how even the most creative companies keep achieving sustainable, profitable futures.  Sopheon is an international supplier of leading-edge products in innovation and new product development. Sopheon has operating bases in the United States, the United Kingdom, and the Netherlands.\n\n\nA company can only be as forward-thinking as its people\n\n\nThat’s why Sopheon fosters a supportive and collaborative work environment that encourages our employees to be...\n\n\nInnovative\nEnthusiastic\nEmpowered\nSopheon is looking for a Software Engineer to design and implement value-based strategic products for our customers. We work with expert colleagues to combine design, business, and engineering skills to achieve high value end-to-end customer experience in everything we deliver. Team members utilize standards and best practices to assure the usability, quality, maintainability, performance, and scalability of our products developed through collaborative agile processes.\n\n\nSopheon offers a flexible work from home environment that fosters productivity and balance to ensure goals can be achieved. If you have been striving to truly make a difference for world class customers with industry leading products, this is your opportunity.\n\n\nDuties and Responsibilities\n\n\nWorking as a team:\n\n\nIndividual, team, and project goals are established and met to strategically deliver the product roadmap with consistency and quality using Agile processes.\nWorks to deliver consistent results in line with product roadmap expectations.\nCollaborates cross functionally and with subject matter experts to deliver high quality and high value products.\nResolution of technical hurdles to provide optimal solutions that meet or exceed solution and delivery expectations.\nCollaborates in the continuous improvement of our Agile development methods including metric definition, quality processes and our software development practice in general.\nImplementation of:\n\n\nEnterprise caliber software products through: \nRich web application UI development.\nObject Oriented Design\nEntity Framework (or other ORM)\nApplication program interfaces and user interfaces.\nRelational database technology.\nHighly scalable server components in a web application.\nInternational software, including multilingual UI’s and support for country specific standards.\nTechnical Skills \n\n\nJavaScript, JSON, HTML, CSS and cross browser development \njs\nReact\nAJAX, jQuery\njQuery UI or Telerik Kendo\nNET MVC\nC# programming on .NET platform\nT-SQL/MySQL/PostgreSQL programming\nApplication Profiling and Analysis, using tools like: \nBrowser development tools – Chrome, Edge, etc.\nRedgate ANTS\nDataDog\nSolarwinds DPA\nPersonal/Interpersonal Skills\n\n\nAbility to thrive in a highly agile, collaborative team environment.\nAbility to learn quickly and apply new technologies to solve problems practically.\nExcellent oral and written communication skills.\nStrong team player with a high degree of flexibility.\nSelf-starting individuals who take initiative to get things done.\nCan do attitude and approach.\nEducation\n\n\nBachelor’s degree or equivalent in Computer Science or engineering related discipline. \n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","css","javascript","react","sql"]},{"job":"Solidity Engineer","company":"Paraform","location":"United States","post_date":"10d","link":"https://web3.career/solidity-engineer-paraform/39691","key":"39691","details":"Solidity engineer with around 3 years of experience in solidity. Must know a lot about decentralized finance, like Uniswap, Aave, Compound.\n\nMust know about Openzeppelin contract, ERC20 token, ERC721, upgradeability, and DAO's (on-chain and off-chain)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity"]},{"job":"VP Associate Institutional Sales Business Development South America","company":"Hex Trust","location":"United States","post_date":"10d","link":"https://web3.career/vp-associate-institutional-sales-business-development-south-america-hextrust/39690","key":"39690","details":"About Hex Trust\n\n\n\nHex Trust is Asia's leading provider of digital asset custody solutions for Banks & Financial Institutions, using leading-edge Blockchain technology. Led by innovators from the financial services industry, Hex Trust has built a proprietary platform that delivers a new way for financial institutions, asset managers, and corporations to safely and efficiently operate in the Blockchain ecosystem. Institutional adoption of digital assets and DeFi requires a fundamental shift in the way banks and financial institutions operate. Hex Trust is the link that connects the traditional financial world to the digital assets ecosystem.\n\n\n\nPOSITION OBJECTIVE\n\n\n\nAt Hex Trust, we're building trust In the digital ecosystem and we'd like you to help us deliver that message to our prospects. Providing institutional custody services like ours takes in-depth industry knowledge, confidence, and persistence. We're seeing tremendous demand and growth in the space and we've created this role to partner with our Global Head of Sales. We're a small, but rapidly growing FinTech company looking for an energetic individual to work independently, build relationships, and help broaden our client base and take our business to the next level!\n\n\n\nDUTIES & RESPONSIBILITIES\n\n\n\nPartnering with our Global Head of Sales on client acquisition and retention efforts to achieve growth targets, particularly in Europe.\nOwn all elements of the business development, sales and partnership life cycles: initial scoping, framing of value, negotiation of term sheets and contracts, implementation and post sales.\nStrategize on plans for market engagement, client management, and be seen as a thought leader, across the digital asset ecosystem.\nLead sales pitches, contact prospects and clients, and handle enquiries, feedback and requests.\nAd hoc projects as needed.\n\n\n\nRequirements:\n\n\n\n3-7 years of sales or relationship management experience preferably from the financial services or technology sector.\nAbility to operate and excel in a fast-paced, entrepreneurial environment with minimal supervision.\nAbility to negotiate and create relationships with both FinTech companies and traditional financial institutions.\nBe an effective communicator and ability to collaborate across teams.\nDemonstrate a curiosity for and knowledge of the digital asset ecosystem.\nCommercial and business awareness and ability to stick to time constraints\nAble to work independently in an often ambiguous and fast-paced environment\nGood negotiation skills and the ability to develop strong working relationships\n\n\n\nPERFORMANCE STANDARDS\n\n\n\nCommercial and business awareness and ability to stick to time constraints\nAble to work independently in an often ambiguous and fast-paced environment\nGood negotiation skills and the ability to develop strong working relationships\n\n\n\nBenefits:\n\n\n\nMake a difference and get yourself noticed in a rapidly growing company, providing multiple opportunities for career and personal development. We are a dynamic, multi-cultural team of smart, motivated people based in offices across Hong Kong, Singapore and Vietnam. We'll give you tough challenges, while offering rewarding results to match, as well as regular team and social events and flexible working arrangements when needed.\n\n\n\n\n\n\nDiverse and inclusive team: A diverse and international team who come from over 15 countries with diversity of both thought and background on a mission to disrupt the digital asset industry. We support each other and take pride in our achievements. We attract talent from well known global multinational companies and institutions.\n\n\n\n\n\n\nOwnership & learning-curve: Opportunity to make an active contribution to the growth story of one of the leading disruptors in the FinTech industry.\n\n\n\n\n\n\nCommunication: We treat our staff like owners by being open, transparent, and providing regular communication about our direction and progress. We provide regular insight into decision making, strategy, and corporate-wide objectives and key results progress so that each of our employees is aligned and empowered. And we constantly strive to improve how we can communicate more effectively.\n\n\n\n\n\n\nOffice: We offer both the flexibility to work remotely or from our modern offices in the central business hubs of Hong Kong, Singapore, Vietnam and Dubai.\n\n\n\n\n\n\nHex Trust is an equal opportunity employer devoted to diversity and inclusion in the workplace. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability status.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","executive"]},{"job":"Head of DeFi Product","company":"Parallel Consulting","location":"United States","post_date":"10d","link":"https://web3.career/head-of-defi-product-parallelconsulting/39689","key":"39689","details":"HEAD OF PRODUCT MANAGEMENT\n\n\n\n\nInnovative unicorn startup offering tremendous room for growth, and the opportunity to own the product is seeking to hire a Head of Product within DeFi and Crypto. Offering an impressive compensation package estimating at 575k-700k. Firm currently comprised of of individuals from disrupters such as Coinbase, Alibaba, Robinhood, Apple, AMEX, Visa etc. professionals so I thought it was worth reaching out to you.\n\n\n\n\nThe ideal Head of Product will build the strategic vision and related roadmap for the company. They will build up their product expertise and work with the development team to share requirements, prioritize and deliver key features, functionality, and innovation. Assist as a central point of contact in the product organization for sales, development, marketing, and other cross functional groups and business units.\n\n\n\n\nThe role is 100% remote!!\n\n\n\n\nRole:\n\nDeveloping product vision & strategy for the pillar & champion it internally.\nBuild & implement a comprehensive & unified roadmap across product development teams.\n\n\n\nEssential skills:\n\n5+ years of experience in Product Management.\n3+ years experience with DeFi highly preferred.\nExpertise working with seeing a product through from ideation to shipping within marketplaces.\nHands on professional experience with DeFi products and blockchain development.\n\n\n\nBeneficial skills:\n\nExperience with cross border payments.\n\n\n\nCompensation:\n\nOur client is looking at a range of $145-190k on the base, impressive stock option/RSU plan with a highly competitive bonus play to bring this in-line with current market expectations.\n\n\n\n\nIf interested, please apply and follow it up with email to Samer Shaqour and a call to Parallel Consulting.\n\n\n\n\nE: samer.shaqour@parallelconsulting.com\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","defi"]},{"job":"Compliance Outreach Analyst","company":"Bitcoin Depot","location":"Atlanta","post_date":"10d","link":"https://web3.career/compliance-outreach-analyst-bitcoindepot/39682","key":"39682","details":"Bitcoin Depotis seeking a AML Compliance Outreach Analystwho will be responsible for an array of compliance activities, but will primarily be tasked to work effectively with multiple complex data sources and/or technical analytical tools/resources to identify potentially unusual, fraudulent, criminal or suspicious activity as defined by BSA / AML regulations and industry best practices for BSA / AML analysis.\n\nThe AML Compliance Outreach Analyst will be responsible for assisting the Compliance Officer with implementing and supporting the Company's regulatory compliance program including:\n\nBank Secrecy Act (BSA);\nAnti-Money Laundering (AML);\nOffice of Foreign Assets Control (OFAC) and sanctions;\nAnti-Bribery & Corruption (ABC) / Code of Ethics;\nConsumer; and\nPrivacy.\n\nBitcoin Depot is the largest multi-cryptocurrency ATM Networks in the world offering users the ability to buy and sell Bitcoin, Litecoin, and Ethereum instantly at 15000+ locations made up of BTMs and BDCheckout locations. Our mission is to bring cryptocurrency to the masses.\n\nWe are proud to be an Atlanta Journal-Constitution Top Work Place for 2021 and 2022, the inc 5000, and placing on the ACG Georgia Fast 40 list for two consecutive years. Additionally, we recently announced a definitive agreement for becoming a publicly listed compan\n\nResponsibilities\n\nThe AML Compliance Outreach Analyst will be responsible for contacting high dollar value customers to facilitate that the customer’s Enhanced Due Diligence (EDD) reviews are completed. Outreach will be through email, text, and telephone; so excellent verbal and communication skills are a prerequisite. The Customer Outreach Analyst will also be responsible for managing the EDD tracker to ensure that customer status is up-to-date and accurate. Tracking is completed via Excel so the ability to work effectively with multiple complex data sources and/or technical analytical tools/resources to manage workload including:\n\nInitiates and manages daily customer contact;\nMaintains organized and accurate record keeping with the ability to create understandable tracking for use by multiple parties;\nFacilitates EDD on customer accounts triggered by dollar value thresholds; and\nUnderstands to escalate fraudulent or suspicious activity to investigations.\n\nOther responsibilities to include:\n\nWorks a staggered shift to include one weekend day to support EDD efforts; and\nSupports Compliance Team projects, as needed.\n\nRequired Qualifications\n\nBachelor’s degree in Business, Finance, or related field;\nThree or more years of Customer Service experience, preferably in a cryptocurrency environment;\nExcellent oral, written, critical thinking, problem solving and interpersonal skills;\nAbility to grasp complex processes quickly and be able to identify risks and compensating controls;\nExcellent problem solving abilities and results oriented; able to make decisions independently; and\nExcellent organization skills and attention to detail.\n\nPreferred Qualifications\n\nFinancial crimes related experience (e.g.; anti-money laundering, fraud, investigations / SARs, economic sanctions, anti-corruption and bribery);\nDemonstrated knowledge of laws, regulations, regulatory guidance, and rules impacting the financial services and crypto currency industries;\nCertified Anti-Money Laundering Specialist.\n\nBenefits\n\nCompetitive Salary\n401K Matching\nGenerous PTO\nHealth benefits offered with a company contribution towards premiums\nWellness benefits\nRevenue Sharing Plan\nCasual dress environment when in office\nMonthly company celebrations\nAdvancement opportunities based on results\nWeekly catered lunches\nPremium coffee and tea provided by Buckhead Beans\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance","analyst","ethereum"]}]}