{"jobs":[{"job":"Senior Software Engineer NFT Marketplace","company":"GameStop","location":"United States","post_date":"4d","link":"https://web3.career/senior-software-engineer-nft-marketplace-gamestop/39975","key":"39975","details":"Job Description\n\nGameStop is looking for a Senior Software Engineer to join our Blockchain team. This role will be remote and will collaborate with a team of engineers, product managers, designers, and business partners distributed across North America. In this role, you will help design, build, and maintain highly scalable products and features that delight millions of GameStop customers. The ideal candidate will be customer-obsessed, highly collaborative, and passionate about creating experiences that are both frictionless and delightful. A passion for gaming, crypto and e-commerce are a plus!\n\nJob Responsibilities\n\n\n\nCollaborate with product managers, designers, and fellow engineers to build software solutions that power the experience across all platforms.\nArchitect, design, and implement highly-performant services.\nWork across scalable middle tier and back-end services.\nWrite scalable, performant, readable, and tested code.\nMonitor, track, and optimize performance on an ongoing basis.\nReview code and provide meaningful feedback to peers to help build better solutions.\nUse data to provide input to prioritization decisions.\nThrive in an ambiguous environment, be resourceful, and make tradeoffs to deliver customer impact.\nExhibit a bias for action, constantly looking for ways to improve performance and customer experience.\nEstablish strong working relationships across all levels and functions of the organization.\nBe results-oriented, data-driven, and passionate about building innovative customer experiences.\n\nJob Requirements\n\n\n\nBachelor's degree in computer science or related field, or equivalent relevant experience.\n5+ years of backend engineering experience building consumer products & scalable services (micro-services is a plus!).\nExperience working directly with AWS Infrastructure services such as S3, Lambda, DynamoDB, API Gateway etc\nIn-depth knowledge & experience working with Postgres / MySQL database in production.\nHands-on experience with NodeJS, Typescript\nExperience with deployment technologies like Docker, Kubernetes, Github Actions.\n\n\n\nNice to have\n\nKnowledge and understanding of L1 / L2 networks.\nExperience with Infrastructure as code like CDK, Terraform, CloudFormation etc\nHands on experience with smart contract & working with Solidity.\nExperience with event-driven architectures like Kafka, AWS SQS.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","nft","solidity"]},{"job":"Internal Tools Engineer Junior","company":"Crossmint.io | Making NFTs Accessible to Everyone","location":"Argentina","post_date":"4d","link":"https://web3.career/internal-tools-engineer-junior-crossmint/39974","key":"39974","details":"🌎Location\n\n\t\nMadrid, Spain or EU (Remote)\n\n\n🕐Employment type\n\t\nFull-Time\n\n\n🎓Seniority\n\t\nEntry level (0-2 yrs exp)\n\n\n📝Modality\n\t\nFull Stack\nAbout Crossmint 🍀\n\nAt Crossmint, we are creating the infrastructure layer to make NFTs mainstream. We are trusted by 5,000+ creators and marketplaces, like Magic Eden, Kevin Hart, and Sylvester Stallone.\n\nOur core product is the leadingfiat on-ramp for NFTs. It enables anyone to buy them in 1 minute, even if they don't have wallets or crypto. ****Check it out here!\n\nWe have a broader suite of NFT APIs and developer tools for enterprises, including minting APIs, and custodial wallets as a service.\n\nWe’re backed by Tier 1 investment firms, have strong PMF, many many years of runway and have a very small technical and product team.\n\nResponsibilities 💪🏽\nMake everyone else in the company more productive by building tools and automations that allow them to do 10x more work\nYou’ll work closely with Engineering, Customer Support, GTM and Fraud teams on the development of internal tools, dashboards, etc., to support their processes\nWork in a truly agile environment, able to gather and understand requirements, propose solutions for those and build them\nAbout you 🤟🏽\nScrappy and independent, but a team player\nBachelor’s degree in Computer Science or related field, or equivalent knowledge and skills and industry experience\nSuperb analytical, problem-solving, and critical thinking skills.\nGood product and design sense — you’re able to build tools that are usable by other people without much guidance / support from designers\nExperience with software engineering best practices, such as design and code reviews, source control management, or build, testing and operations processes\nA+ English\nBonus:\nExperience working with APIs, javascript/typescript and querying data (graphQL, SQL, etc)\nExperience with Zapier, retool, Google Apps Script, MongoDB\nInterview steps 🛠\nApplication Review - CV screening\nHiring Manager Interview (45mins)\nTake-Home Coding Challenge (2-4 hours, 1 week to complete)\nTechnical Interview (45mins)\nFounder Interview (30mins)\n\nOur team will help you navigate through the interview process and resolve any doubts that you might have.\n\nBenefits 💎\nWe follow location based compensation. We pay at the p90th percentile of salaries and equity from wherever you live 📈\nFlexible PTO 🏝\nCompany laptop plus allowance of $300/quarter for any necessary home equipment 🏡💻\nWorking in a disruptive and fast-growing industry where the possibilities are endless 🚀\nCompany-paid trips for off-sites and team bonding ✈️🥥🌴🌈\nFlexible work schedule 🕗\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","junior","entry","level","nft","javascript"]},{"job":"Solana Full Stack Developer","company":"Metacrafters","location":"Remote","post_date":"5d","link":"https://web3.career/solana-full-stack-developer-metacrafters/39972","key":"39972","details":"As the platform for developers to learn from blockchain experts, earn creds, and get hired, Metacrafters partners with companies of all sizes, across the globe, who are searching for web3 talent. These partners, our clients, are looking for developers with varying levels of fullstack web3 experience.\n \nInterested in learning more? Apply via the link below!\n\nThe Role\nOur clients are looking for full-stack developer to be a contributing member of their engineering team.  Some things you’ll be working on:\nSmart Contracts: Building on-chain Solana programs using Rust and Anchor, with a focus on security, simplicity and composability\nProtocol Architecture: Designing and building key technical components for the protocol\nBack-End Applications and Infrastructure: Build out SDKs to backend Solana contracts. Maintain off-chain infrastructure and services\nFront-End Applications: Build out frontend interfaces for web and mobile applications\nRequirements\nPassion for blockchain, DeFi, and Web3 (prior work experience not required)\nExperience with Typescript/Javascript and Rust\nConfidence in writing secure and high quality code\nExcited to work in a fast pace environment\nEager to learn new technologies\nExceptional follow through and commitment\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","defi","javascript","rust"]},{"job":"Marketing Operations Manager","company":"Cash App","location":"San Francisco","post_date":"5d","link":"https://web3.career/marketing-operations-manager-cashapp/39971","key":"39971","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nCash is looking for a Marketing Operations Manager to join our growing Marketing Operations & Strategy team. If you’re data-driven, have a passion for process and organization, are always seeking ways to execute work seamlessly and love the world of marketing infrastructure and systems, then this might just be the job for you. This role will work closely with the Cash Marketing and Finance & Strategy teams to lead and drive strategic outcomes. The primary focus of this role will be budget management, leading annual and quarterly planning, having a pulse on priorities and challenges across the team and finding creative solutions, as well as the ability to lead complex projects with multiple stakeholders, end-to-end.\n\nThis is a highly cross-functional role requiring both strategic and tactical execution as well as strong program management. You have developed processes for high growth marketing organizations with exceptional problem-solving skills and have the ability to work closely with marketing, product, finance and analytical stakeholders. You are a growth driver, someone who not only supports the needs of the team, but a person who thrives on identifying and chasing opportunities to accelerate the business. Simply put- you organize the chaos.\n\nYou Will\n\n\nWork with the Marketing Operations Lead and wider marketing team - brand, product marketing, paid, partnerships, creative, social, etc. to develop best-in-class operations strategy that supports Marketing’s performance goals and execute on that strategy\nWill work as the conduit between Finance, Business Operations, Analytics and the marketing team to help facilitate planning, process development and iteration and measurement.\nPartner with the marketing team as well as key external partners, to identify opportunities for continuous improvement in campaign execution, measurement and optimisation.\nIdentify, design and execute new processes that enable marketers to be more effective in their day to day work, including executional excellence, overall efficiency and measurement.\nChampion process and drive change management\nDesign and implement the quarterly planning rhythm across Marketing\nPartner with marketing leads, business operations and finance teams to forecast quarterly goals to determine monthly and quarterly targets for the business to reach its goals.\nCollect information from team leads for quarterly business reporting\nWork with Finance, Business Operations, and Analytics to create, maintain and evolve dashboards to report on marketing investment, activities, effectiveness and business impact\nDevelop and implement a budget management process and system with Finance\nWork with Finance to manage the marketing budget, including month-end tracking budgets to actuals and cross function dependencies\nPrepare reports and translate complex results into presentations for leadership as needed\nPartner with IT, Tech and Analytics teams to identify, evaluate, implement and enable marketers with tools & technology to improve and optimize marketing team performance\n\nYou Have\n\nQualifications\n\n6+ years experience in marketing / operations / analytics / business operations roles\nStrong strategic mindset and outstanding stakeholder management skills\nExperience managing marketing operations processes including planning, budgets and measurement\nExperience working with project management software\nStrong analytical skills - love working with data\nAbility to manage multiple projects at the same time in a fast-paced environment\nTechnically capable, excellent communicator, and a desire to improve processes\nEffective, clear, and concise communication skills, verbal and written\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $152,100 - USD $185,900\n\nZone B: USD $141,500 - USD $172,900\n\nZone C: USD $133,800 - USD $163,600\n\nZone D: USD $121,700 - USD $148,700\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","operations"]},{"job":"Head of People Culture US","company":"Virtually Human Studio","location":"United States","post_date":"5d","link":"https://web3.career/head-of-people-culture-us-vhslab/39968","key":"39968","details":"Head of People & Culture (US)\nUNITED STATES /\nVHS – PEOPLE & CULTURE /\nFULL TIME\n/ Remote\n\nApply for this job\nWho we are\nVirtually Human Studio is creating the future of entertainment. We are a gaming and entertainment startup crafting the next generation of games and digital experiences on the blockchain. In 2019, VHS launched our flagship, NFT horse racing game — ZED RUN. We quickly established ZED RUN as a leading web3 game, which opened the doors to executing partnerships with some of the world’s most innovative and leading brands including Atari, Budweiser, and Netflix.\n\n\nThe role \nWe are seeking our very first Head of People and Culture to come on board to provide leadership and strategic direction in the management of employee related matters. The Head of People and Culture will work closely with our leaders on how best to navigate through our scale up journey, reporting to the Chief Operating Officer. The role will help embed strong values across the company and help execute the key foundations to help our people thrive at VHS. You are an experienced HR professional with 5+ years experience in a Senior Human Resources role within a hyper growth start-up environment. You have experience across the core functions of HR and you are comfortable with rolling up your sleeves in the beginning of our journey to build out the company’s people strategy globally. You are experienced in working with legal and regulatory requirements across global jurisdictions for employment relations (in particular Australia and the US).\n\nRole Requirements\nTertiary qualifications in Human Resources Management (essential)\nQualifications in Organisational Development or Coaching (desirable)\nStrong communication skills and business insight necessary to interact with employees, hiring managers and senior leaders within the organisation\nExperience and knowledge of legal and regulatory requirements across global jurisdictions for employment relations (in particular Australia and USA)\nExperience driving a culture of high performance\nStrong leadership capacity, with proven experience building a team from the ground up\nExtensive experience and proven track record in HR strategy development, execution and delivery\nDemonstrated experience in organisational and leadership development\nExperience handling legal risk, including leading on investigations into grievances and complaints;\nA personal >\nAble to confidently advise executive and leadership teams on broad-ranging people related issues;\nHigh level knowledge of all facets of HR related functions\nDemonstrated experience working with sporting and gaming start-up (desirable)\nExperience working with multi-located and remote teams (desirable)\nWhy Work For VHS?\nA supportive friendly environment of dedicated and passionate co-workers\nRemote First - Flexible work from home arrangement\nExposure to the new aged world of Blockchain and NFT’s\nUnlimited leave\nMaternity/Paternity Leave\n$1000 USD Remote work allowance\nBrand new work laptop\nEmployee referral program ($4000 USD for each employee who is successfully referred to the company)\nTo be considered for this position please provide a copy of your resume and cover letter and/or digital video resume outlining and addressing the selection criteria.\n\n\nVHS values transparency, accountability, support, simplicity, and courage. We look forward to working with someone who embraces these traits and our start-up culture. Join VHS today and take the next step in your career.\n\n\nVHS is committed too employing a diverse workforce. Qualified applicants will receive consideration without regard to race, colour, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability. Only shortlisted candidates will be contacted to move forward in the process.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","nft"]},{"job":"Lead Frontend Engineer","company":"Biconomy","location":"Remote","post_date":"5d","link":"https://web3.career/lead-frontend-engineer-biconomy/39967","key":"39967","details":"Lead Frontend Engineer\nDubai, Remote /\nEngineering /\nFull-time - Remote\n/ Remote\n\nApply for this job\nNote to all applicants: Biconomy are a fully remote company with a team dispersed all over the Globe, so we welcome applications from all candidates, regardless of your location.\n\n\nJoin a leading Web 3 company that’s enabling and powering the builders of the new internet!\n\n\nBiconomy’s foundations were built on making Web 3 accessible and simple to all. We do this by making blockchain transactions seamless, and by doing so, we are accelerating the mainstream adoption of Web 3.\n\n\nThat’s why ease and accessibility are imperative to our innovations and solutions. While we build for developers, our work radically simplifies the overall user experience on Web 3. By abstracting away blockchain complexities, the end user enjoys the benefits of Web 3 with the familiarity of Web 2.\n\n\nWe are already solving for some of the leading players in the blockchain space & are emerging as the default transaction stack for Web 3. Some of our numbers:\n\n\n- Processed 22 million transactions\n- Facilitating over $233 million of transfer volume\n- Saving users over $4.7 million in gas fees!\n\n\nWhat are we looking for?\n\n\nAs our Lead Frontend Engineer, you will build user-facing applications, manage workflows, and take charge of a dynamic and ever-growing team of front-end developers. You will build a scalable and robust frontend infrastructure while ensuring that our products are of the highest quality possible.\n\n\nBiconomy is growing at a rapid pace. To enable further growth, we need you to come in and build our frontend team from the ground up. We will rely on you to build top-quality UIs for our Web3 and Web2 products across a wide spectrum.\nWhat will you be doing?\nGaining ownership over our existing products, as well as the ability to influence the ideation, and design of future products\nTranslate wireframes into functional requirements, and write well-abstracted, reusable, high-performance code for UI components\nCreate and implement fully functional client dashboard designs\nResponsible for ensuring consistent, high-quality user experience across all UI interfaces you design\nCollaborate with the rest of the engineering team to design, develop and launch or maintain features\nConducting appropriate unit and module testing; detect, report, investigate and fix defects in the application (production support)\nBuild reusable components and front-end libraries for future use. E.g., plug-and-play widgets to be used by clients in their UI\nSuggest continuous improvements in the user interface, software architecture, or new technologies\nBuild reusable components and front-end libraries for future use. E.g., create custom controls using D3.js\nYour experience should include:\n4+ years of strong JavaScript knowledge\nWe use React on our UI, so a minimum of 3+ years of experience building production-based applications is required\nExcellent HTML and CSS skills. Using these, you should be able to translate user and business needs into functional frontend design\nYou have experience designing and building high-performance and scalable applications in a Web3 environment\nYou have a strong design aesthetic and a passion for the nitty-gritty details of creating great user experiences\nUnderstanding of design patterns, API design, and development\nDeep knowledge of UX and UI development processes\nAbility to independently analyze requirements based on a given specification and come up with a sound and balanced algorithmic design\nStrong experience in managing User Interfaces for data-intensive applications\nExperience in managing the deployments and building frameworks\nFamiliarity with cross-browser compatibility issues and demonstrating design and user interface/user experience skills\nFamiliarity with using Scrum/Agile development methodologies.\nWhat’s in it for you?\n\n\nIn this growing Web 3 industry with collaborative and feedback-driven culture, you will get to know behind the scenes of a crypto project from a business & technical perceptive. You will get to work with a talented team of diverse individuals worldwide, driven by our mission of enabling Web3 to be frictionless and accessible to the mainstream of users.\n\n\nFurther, you will be using your skills to build amazing products and steer a team of frontend developers towards the ground braking landscape of Web3 products and services.\n\n\nWhat we offer:\n\n\n- Work from anywhere (Remote first)\n- Flexible working hours\n- Flexible vacation policy\n- Competitive Salary\n- Token Allocation\n- Opportunity to grow. The sky's the limit if you're hungry to succeed\n- Be an integral part of building the narrative for the digital economies of the future\n- Game nights, virtual celebrations, and work retreats\n\n\nBiconomy is committed to a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","lead","remote","react"]},{"job":"Head of Operations","company":"Mino Games","location":"United States","post_date":"5d","link":"https://web3.career/head-of-operations-minogames/39965","key":"39965","details":"Mino Games is on a mission to bring the world together through gaming by building the next 100b franchise.\n\n\n\n\nIn the late 2000's, the gaming industry went through a tectonic shift with the release of the App Store. Mino Games was started in 2011 to take advantage of this explosive growth and build the next mega franchise. Since those early days, we’ve built four successful games - Mino Monsters 1 & 2, Cat Game and Dog Game – with each of them generating tens of millions in revenue. Our mega-hit Cat Game has achieved more than 13 Million downloads and is universally loved by our players. We have also built an amazing team along the way.\n\n\n\n\nA Decade later, we see a new tectonic shift happening in gaming. Blockchain and AI promises to change the industry far more than mobile games did – it has unlocked the potential to acquire customers and retain them at low to no costs by connecting developers directly with their community. In 2022, we raised $15 million to double down on our mission from some of the biggest names in gaming and crypto, including Bing Gordon, Don Mattrick,\n\n\n\n\n\nOne of the most important roles we are hiring for right now is a Head of Operations to join our team. You assist with the operations at Mino while working directly alongside the executive team to help drive strategy, oversee all ongoing procedures, and ensure full operational efficiency.\n\n\n\n\n🛠 You will:\n\nBusiness Processes Optimization:\nIdentifying AOR across teams and assigning DRI and Backup to AOR\nIdentifying & removing inefficiencies\nDesigning and implementing protocols, SOPs and establishing policies that are aligned with company culture and vision\n\n\nManage new tech acquisition and vendor relationships:\nIdentify needs for new tools in the organization\nSetup, organize & manage platforms and tools across departments\nMonitor tool usage and adherence to SOPs\n\n\nReporting:\nCreate clear reporting structure for teams, and manage structured reporting of KPIs and progress in these teams to executives\nWork closely with the executive team to drive priorities and execute against quarterly/annual roadmaps\n\n\nStrategy, change management, and internal communications:\nRunning strategic sessions and workshops to create buy in and alignment with stakeholders\nIncorporating industry best practices\nCreating change strategy with CEO & VP of Operations\nRolling out change and effectively communicating to all stakeholders\nProject management\nMeasuring and monitoring success of the rollout\nPreparing decks and presentations for internal comms, executives and the board\nFacilitate strategic sessions and workshops with executives\n\n🌟You Are:\n\nProcess & Documentation Wizard: Writing SOP’s and other documentation is like your second language, it comes naturally to you and you love it.\nFanatically detail oriented: There is no detail in the org that gets missed under your watch. You have a strong purview of all company activities and hold them to high standards\nRelentlessly Resourceful: You accomplish in a day what would take an average person a month, even when your tasks are seemingly impossible.\nExtremely Organized: While you're around things just run smoothly. You build a simple process and the team marches in lock step because they always know what to do.\nHighly Analytical: You're extremely data driven, using excel is as natural as speaking english. You use models, forecasts, and analysis to augment your thinking at all times.\nCommunication - You simply communicate the right information to the right people at the right time so everyone always has context.\n\n\n\nYou have\n\n5+ years of professional experience\nBachelor’s degree in Business Administration or Operations Management or related field\nExperience working in a scaling remote startup in an ops role\nPast/current experience in management consulting (Nice to Have)\n\n\n\n💫We Offer:\n\nFully Remote: We’re fully remote and offer flexible hours.\nPaid Vacations: We offer 20 days of PTO a year.\nPaid Winter Break: Additional time off at the end of the year for rest and relaxation.\nHolidays: We follow local holidays in Canada. Our international employees get to enjoy those days as holidays as well.\nFlexible Personal & Sick days: Feeling unwell? Not to worry, we got your back!\nHealth Insurance: We provide health insurance for all associates no matter where they are.\nMental Health & Wellness Perks: We provide access to general wellness & mental health products.\nTraining: We offer learning and development opportunities to help you continue leveling up.\nIndependent Creativity: Mino Games is independent, which means we can be as creative as we want without being limited by client demands!\nActivities: Our Office Happiness Task Force will always surprise you with the team and company-wide surprises and activities.\n\n\n\nMino Games hires on the basis of merit and is strongly committed to equity and diversity. We welcome applications from all qualified candidates. If you’re curious and would like to know more, apply!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","operations"]},{"job":"Manager Mid Market Sales EMEA","company":"Chainalysis","location":"London","post_date":"5d","link":"https://web3.career/manager-mid-market-sales-emea-chainalysis/39964","key":"39964","details":"Our Representatives are expert storytellers and problem-solvers and are passionate about web3, cryptocurrency, and building trust in blockchain. . At the cutting edge of the cryptocurrency industry, our team understands the latest market developments and business models that are building the future of finance. Our goal is to help crypto related businesses understand the value of implementing our solutions.\n\nMid-Market Managers have been in the trenches of high-volume sales environments and are masters at coaching, inspiring, and building teams as well as accurate and predictable forecasting. We measure success by tracking pipeline growth, capturing new logos, and developing a motivated and engaged team.\n\nIn one year you’ll know you were successful if…\n\nThe Mid-Market team is exceeding quota and managing deals from inception to close.\nYou’re having regular and meaningful meetings with your team members to help them develop the skills needed to grow into an Account Executive role.\nYou’ve created a strategy for market-mapping and strategic outreach through market research and data analysis that has uncovered more product demand and you’ve strategically hired additional reps to leverage that growth.\nThe Mid-Market Team are seen as the lynchpin between Account Executives and Sales Development Representatives, flexing up and down as needed to support the overall success of the team.\nYou’ve set clear metrics and expectations around productivity, conversation and quota attainment for your team to work toward and provide guidance and coaching according to those goals.\nThe Sales Leadership team can rely on you to provide accurate revenue forecasts based on updated and accurate Salesforce data.\nThe culture on your team is equal parts team collaboration and individual ambition, supporting both personal development and a “win as a team” mentality.\n\nA background like this helps:\n\nYou’ve led a team of Sales Development Representatives, Inside Sales Representatives, Mid-Market or a similar outbound sales team at a high-growth B2B SaaS startup before.\nYou’re high energy, resilient, and love motivating teams.\nYou thrive in ambiguity and enjoy building solutions and processes where there are none.\nYou feel comfortable presenting regularly to executives on pipeline and revenue forecasts.\n\n#LI-Remote #LI-AM1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Senior Product Designer","company":"Chaos Labs","location":"Tel Aviv","post_date":"5d","link":"https://web3.career/senior-product-designer-chaoslabs/39962","key":"39962","details":"Senior Product Designer\nTel Aviv, Israel /\nDesign /\nFull-time\n\nApply for this job\nWe're hiring a Senior Product Designer!\n\n\nChaos Labs' mission is to secure the future of finance. We're looking for a Senior Product Designer to join us in the mission of securing blockchain and protocols!\n\n\nAt Chaos Labs, we’re developing a cloud security platform for DeFi (Decentralized Finance) protocols through run-time simulations. We work with protocols to automate economic security, risk management, parameter selection optimization, and battle test protocols through the most chaotic (🤗) market conditions. Our platform and tools are used by leading protocols, helping them manage and secure over 50 Billion in assets.\n\n\nChaos Labs was founded by ex-Facebook, Apple, Instagram, Amazon, and Microsoft engineers, being 8200 (Israeli Cyber Intelligence) and Technion alumni. We’re looking for curious, hungry engineers to join the team and help define the security and risk stack of the future.\nResponsibilities\nDesign, improve and determine the product experience, user journey, and all end-to-end flows of our products.\nEvolve and build the visual design system of our core platform analytics tools, dashboards, and website.\nWork with Product Managers and Front End developers to define and ship intuitive products with great user experience.\nRequirements\n5 years of hands-on design experience in a startup or a tech company\nStrong visual design skills, Pro active and self-driven\nExperience in designing data visualisations, dashboards or analytic tools.\nExperience with web3, crypto, DeFi and blockchain applications - a great plus.\nPreferred Qualifications\nYou love working in small, dynamic, fast-paced teams that encourage you to learn and grow.\nYou are passionate about using your experience and expertise to inspire the group.\nLet's connect!\n\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","senior"]},{"job":"Head of People Culture AUS","company":"Virtually Human Studio","location":"United States","post_date":"5d","link":"https://web3.career/head-of-people-culture-aus-vhslab/39959","key":"39959","details":"Head of People & Culture (AUS)\nUNITED STATES /\nVHS – PEOPLE & CULTURE /\nFULL TIME\n/ Remote\n\nApply for this job\nWho we are\nVirtually Human Studio is creating the future of entertainment. We are a gaming and entertainment startup crafting the next generation of games and digital experiences on the blockchain. In 2019, VHS launched our flagship, NFT horse racing game — ZED RUN. We quickly established ZED RUN as a leading web3 game, which opened the doors to executing partnerships with some of the world’s most innovative and leading brands including Atari, Budweiser, and Netflix.\n\n\nThe role \nWe are seeking our very first Head of People and Culture to come on board to provide leadership and strategic direction in the management of employee related matters. The Head of People and Culture will work closely with our leaders on how best to navigate through our scale up journey, reporting to the Chief Operating Officer. The role will help embed strong values across the company and help execute the key foundations to help our people thrive at VHS. You are an experienced HR professional with 5+ years experience in a Senior Human Resources role within a hyper growth start-up environment. You have experience across the core functions of HR and you are comfortable with rolling up your sleeves in the beginning of our journey to build out the company’s people strategy globally. You are experienced in working with legal and regulatory requirements across global jurisdictions for employment relations (in particular Australia and the US).\n\nRole Requirements\nTertiary qualifications in Human Resources Management (essential)\nQualifications in Organisational Development or Coaching (desirable)\nStrong communication skills and business insight necessary to interact with employees, hiring managers and senior leaders within the organisation\nExperience and knowledge of legal and regulatory requirements across global jurisdictions for employment relations (in particular Australia and USA)\nExperience driving a culture of high performance\nStrong leadership capacity, with proven experience building a team from the ground up\nExtensive experience and proven track record in HR strategy development, execution and delivery\nDemonstrated experience in organisational and leadership development\nExperience handling legal risk, including leading on investigations into grievances and complaints;\nA personal >\nAble to confidently advise executive and leadership teams on broad-ranging people related issues;\nHigh level knowledge of all facets of HR related functions\nDemonstrated experience working with sporting and gaming start-up (desirable)\nExperience working with multi-located and remote teams (desirable)\nWhy Work For VHS?\nA supportive friendly environment of dedicated and passionate co-workers\nRemote First - Flexible work from home arrangement\nExposure to the new aged world of Blockchain and NFT’s\nUnlimited leave\nMaternity/Paternity Leave\n$1000 USD Remote work allowance\nBrand new work laptop\nEmployee referral program ($4000 USD for each employee who is successfully referred to the company)\nTo be considered for this position please provide a copy of your resume and cover letter and/or digital video resume outlining and addressing the selection criteria.\n\n\nVHS values transparency, accountability, support, simplicity, and courage. We look forward to working with someone who embraces these traits and our start-up culture. Join VHS today and take the next step in your career.\n\n\nVHS is committed too employing a diverse workforce. Qualified applicants will receive consideration without regard to race, colour, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability. Only shortlisted candidates will be contacted to move forward in the process.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","nft"]},{"job":"Client Solutions Director","company":"Ripple","location":"New York","post_date":"5d","link":"https://web3.career/client-solutions-director-ripple/39957","key":"39957","details":"Ripple is growing and we’re looking to hire a new team member to focus on Client Solutions for our Sales team based out of our NYC office. This is a great opportunity to work with cross-functional departments such as Product, Engineering, and Integration to deliver enterprise solutions to our Financial and Non-Financial client prospects across the Americas region.\nWhat You’ll Do\n\n\nWork alongside the Sales Directors to build credible business relationships with our prospects\nCapture business requirements, define scope, create designs and specifications\nDetermine business efforts in terms of duration and cost\nWork with clients to understand where and how our technology can assist them in meeting their objectives\nWork with clients, internal and external teams to construct solution designs, cost estimates and implementation plans spanning all aspects of the payments flow\nField queries, acting as the single point of contact for the new system, across the client and internal teams for future designs, enhancements and strategic direction\nMinimum 30% - 50% travel required\nContribute to our growth in a fast-paced working environment\n\nWhat We’re Looking For\n\nAt least 5 years of functional and technical knowledge of payments and funds settlement systems within a software or services enterprise\nExperience of leading and architecting enterprise-level payment solutions consistent with our product vision\nExcellent written and verbal communication skills\nKnowledge and experience working with industry standards in banking and payments (e.g. ACH, SWIFT, SEPA)\nSolution architect experience that applies both banking and technical knowledge to meet client requirements in a disruptive and innovative environment\nAn out-of-the-box thinker and client advocate with a proactive ‘can do’ attitude\nInterest and experience in championing and driving the development of product software features and extensions by working in conjunction with internal and external stakeholders\n\nWho We Are\nRipple is doing for value what the internet did for information: enabling its instant and seamless flow around the world. We call this the Internet of Value (IoV). Using blockchain and cryptocurrency technology, Ripple is dedicated to creating powerful gains in financial efficiency, equity and inclusion. In addition, Ripple is developing and enabling the future use cases that will catalyze the new digital economy for governments, businesses and consumers.\nRipple has offices in San Francisco (HQ), New York, London, Mumbai, Singapore, São Paulo, Toronto, Reykjavík, Washington D.C. and Dubai.\nWHAT WE OFFER – The resources and support to be your best at work and beyond:\nDo Your Best Work\n\nThe opportunity to build in a fast-paced start-up environment with experienced industry leaders\nA learning environment where you can dive deep into the latest technologies and make an impact. A professional development budget to support other modes of learning.\nThrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team.\nRipple is Flexible First: you have the option to work remotely, from our offices, or a combination of the two within the 11 countries we are located around the world.\nWeekly all-company meeting - business updates and ask me anything >\nWe come together for moments that matter which include team off-sites, team bonding activities, happy hours and more!\n\nTake Control of Your Finances\n\nCompetitive salary, bonuses, and equity\nBonus Flexibility Program: Participants in the Corporate Bonus Plan have the option to elect to receive their annual bonus in cash, equity or XRP, or a combination.\n100% paid medical and dental and 95% paid vision insurance for employees starting on your first day\n401k (with match)\nCommuter benefits\nEmployee giving match\nMobile phone stipend\n\nTake Care of Yourself\n\nTwice a quarter R&R days so you can rest and recharge\nGenerous wellness reimbursement and weekly onsite & virtual programming\nFlexible vacation policy - work with your manager to take time off when you need it\nIndustry-leading parental leave policies. Family planning benefits.\nCatered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events\n\nBenefits listed above are for full-time employees. Interns - please discuss benefits with your recruiter.\nRipple is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.\nPlease find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Senior Full Stack Software Engineer","company":"Winter","location":"San Francisco","post_date":"5d","link":"https://web3.career/senior-full-stack-software-engineer-winter/39956","key":"39956","details":"About us\n\n❄️ Winter is a seed-stage, venture-backed (YC W22, backed by funds with LPs like Marc Andreessen, Andrew Chen, and Chris Dixon) startup that makes it easy for anyone to buy NFTs.\n\nOur mission is to onboard the next billion users into web3, starting with NFTs! We believe web3 & NFTs are too complicated for the average user (like my mom) - we want to radically simplify the experience.\n\nOur first product is an embeddable widget for businesses & NFT projects to sell NFTs via credit card. On top of that, we also help store & manage NFTs on behalf of users if they don’t have their own wallet!\n\nAbout the role\n\nYou will collaborate with product, design, and other engineers on building out our core checkout experience product. You will be responsible for leading and scoping out feature work across the stack and will help leadership prioritize features on the roadmap.\n\n⛴ Ship fast, ship often\n♻️ Participate in all aspects of product development life cycle including requirement/design\n❓Estimate engineering effort, plan implementation, and rollout system changes\n🚨 Identify project risks and work effectively to mitigate them\n🤝 Help customers succeed with integration support\n🛠 Find and fix stability/scalability issues in a very time critical environment\n\nAbout you\n\nGot a personal project? We love that! Tell us all about it!\nStrong programming background — 1+ years of experience shipping as a full-stack web developer\nDesire to learn new technologies on the job (i.e. React, Node.js, blockchain, etc)\nMotivated to work on the highest priority feature no matter where in the stack\nEnglish proficiency\nNOT required to have any web3/blockchain experience!\nPreferably based in SF/Bay area. We prefer in-person collaboration for our early team! Hybrid options available also\n\nNice to haves\n\nExperience working with data infra (i.e. Databricks, etc)\nExperience with blockchain development (i.e. Rust, Solidity, etc)\nScalable & distributed systems experience\nBenefits\nHealth Care Plan (Medical, Dental & Vision)\nUnlimited PTO\nOne-time Work From Home Office Stipend\nMonthly Food & Snack Stipend (Free lunch when in the office!)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","senior","react","solidity"]},{"job":"VP Engineering","company":"Biconomy","location":"Remote","post_date":"5d","link":"https://web3.career/vp-engineering-biconomy/39954","key":"39954","details":"VP Engineering\nDubai, Remote /\nEngineering /\nFull-time - Remote\n/ Remote\n\nApply for this job\nNote to all applicants: Biconomy are a fully remote company with a team dispersed all over the Globe, so we welcome applications from all candidates, regardless of your location.\n\n\nJoin a leading Web 3 company that’s enabling and powering the builders of the new internet!\n\n\nBiconomy’s foundations were built on making Web 3 accessible and simple to all. We do this by making blockchain transactions seamless, and by doing so, we are accelerating the mainstream adoption of Web 3.\n\n\nThat’s why ease and accessibility are imperative to our innovations and solutions. While we build for developers, our work radically simplifies the overall user experience on Web 3. By abstracting away blockchain complexities, the end user enjoys the benefits of Web 3 with the familiarity of Web 2.\n\n\nWe are already solving for some of the leading players in the blockchain space & are emerging as the default transaction stack for Web 3. Some of our numbers:\n\n\n- Processed 22 million transactions\n- Facilitating over $233 million of transfer volume\n- Saving users over $4.7 million in gas fees!\n\n\nWhat are we looking for?\n\n\nWe’re looking for a highly technical, strategic and capable VP Engineering who will play a critical role in managing, developing and building out Biconomy’s tech stack. The individual will also have a strong passion for Web3 UX (both developer UX as well as end user UX) and will work directly with the Founders and CTO on technical strategy and engineering delivery. You will also manage and lead a team of engineers to build products as well as setting up team members for success.\nWhat will you be doing?\nTake ownership/lead across the tech stack including but not limited to architecture, dev ops, in-house developer resourcing, product expansion and feature development\nMake architecture decisions to ensure a strong, stable, and scalable product\nIdentify internal tech team needs and help craft our engineering/product team hiring roadmap\nConduct screenings of engineering/product candidates as part of the hiring process\nWork with engineering team to increase their expertise and understanding of best development practices\nLead our product and developer teams to ensure we maintain standards for documentation, code quality, and testing\nWorking closely with the founding team in continuously setting the technological roadmap and vision \nWorking closely with the CTO to plan and drive the technical build out strategy for current and future needs, in particular with our goals of decentralising and open sourcing our stack\nYour experience should include:\nA proven background of 7+ years in software engineering or computer science\n3+ years experience leading engineering teams in blockchain, crypto, or Web3\nHigh level of experience with the JavaScript (ReactJS / NodeJS) programming language\nDemonstrated experience facilitating remote-first, distributed software engineering teams\nA passion for decentralized, peer-to-peer systems and web3 technologies\nExperience with smart contract development, full-stack decentralized application development, or blockchain infrastructure & dev tooling\nTrack record of successfully building and shipping web3 products at scale\nStrong interpersonal acumen and the ability to deeply collaborate with peers\nWhat's in it for you?\n\n\nYou’ll be able to see what it's like to work in the growing Web 3 industry, what it takes to run a crypto project, and work with a talented team of diverse individuals driven by our mission of enabling Web 3 to be frictionless and accessible to the mainstream.\n\n\nWe will give you full trust and autonomy in your role, working closely with the founding team to set the technical strategy of our product, as we expand into new areas. You will be a key member of the team, who is central to our success as we continue to accelerate the mainstream adoption of Web 3.\n\n\nMore importantly, you will have the opportunity to assemble your own team of 10x engineers from around the globe to help you design and build industry-leading decentralized network infrastructure.\n\n\nWhat we offer:\n\n\n- Work from anywhere (Remote first)\n- Flexible working hours\n- Flexible vacation policy\n- Competitive Salary\n- Token Allocation\n- Opportunity to grow. The sky's the limit if you're hungry to succeed\n- Be an integral part of building the narrative for the digital economies of the future\n- Game nights, virtual celebrations, and work retreats\n\n\nBiconomy is committed to a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","remote","javascript"]},{"job":"Senior Blockchain Engineer","company":"Atrae, Inc.","location":"Remote","post_date":"5d","link":"https://web3.career/senior-blockchain-engineer-atrae-inc/39953","key":"39953","details":"What we do\nWe are creating a web3 well-being service that allows users to own and control their data while still being able to put data into well-being services to enhance their well-being.\nWe pay particular focus on relationships well-being and social capital.\n\nWe are an HRtech company by nature.\nUltimately, the purpose of people's working lives is to enhance the well-being of the individual and the well-being of society.\nHowever, such services using the power of data do not exist in the world.\nWe believe that data and social well-being should be public goods, even though individuals are the owners.\nPublic goods are always local (dependent on a community's shared context and value system), not universal.\nMoreover, public goods arise from a shared understanding of what is in the public interest (what makes life meaningful) in the context of contingent and culturally complex relationships among each other.\nThus, it is necessary to design not only for universality but also for adaptability.\nThis requires both macro-level structure and micro-level diversity.\nFurthermore, public goods must have positive externalities, and if we see ourselves as beneficiaries of the public goods of past societies, this includes the people of the future.\nThus, at the macro level, it is necessary to create a platform that utilizes web3 tech stacks to create a governance structure for DAOs and a structure that allows for the participation of a variety of stakeholders.\n\nBy doing so, our goal is to achieve the following:\nto a society where good relationships cultivate well-being.\nTo a pluralistic, coexisting society where everyone can contribute to well-being\n\n\nResponsibilities\nYou will be responsible for designing and implementing smart contracts and decentralized infrastructure for a data-centric well-being platform using Blockchain technology. This role is ideal for someone with a strong track record in open-source projects and an interest in decentralized, self-sovereign identity, Decentralized Autonomous Organization (DAO), or NFT. \n\n\nDesign and implementation of highly available and performant solutions. \nWriting reusable, testable, and efficient code. \nImplementation of security and data protection protocols.\nDocumenting and presenting open-source solutions. \nInteracting with and contributing to standards groups.\nDocument and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code \nDirecting the development team in the design, development, coding, testing and debugging of applications \nParticipate in code reviews, education and mentorship.\n\n\nQualifications/Experience\nProven work experience as a Software Engineer or Software Developer\nAbility to develop software in Solidity (OpenZepplin, Truffle or hardhat)\nExperience in DAO development. \nAt least 5 years of experience in smart contract development in either DeFi, NFT, Digital ID or Zero-knowledge proof (zk proof) solutions\nCan work with high autonomy. \nStrong communication and problem-solving skills. \nExpert-level experience in JavaScript, ES6+. \nStrong experience in type-safe languages. \nExperience with private EVM or Decentralized Exchange (DEX) is a plus.\nExperience maintaining Open-Source projects. \nExperience working with Scrum and Kanban, preferably in a distributed team. \nStrong grounding in Data security. \nExperience with Git. \nOur Team and workstyle\nTotal of 20 people. Of these, all of whom are contract employees. 7 are full-time members.\nOur members live in Canada, Vietnam, Japan, and Singapore.\nCurrently, our team's main time zone is the Asia-Pacific time zone.\nWe operate our team on the premise of full remote, online, asynchronous, low-context communication so that all people can work towards equality, fairness, and contribution to society while maximizing the well-being of each person's life.\n\nOur Tech Stack\nJavaScript\nFlutter\nBlockchain: Solidity, Quorum, IPFS, Hardhat and Foundry \nServerless: AWS Lambda, API Gateway, Kinesis, DynamoDB, Neptune etc. \niOS & Android \nHow to apply and process\nPlease share any documents or links that will help us understand you.\n\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","blockchain","dao","javascript"]},{"job":"Senior Accountant","company":"Myria","location":"","post_date":"5d","link":"https://web3.career/senior-accountant-myria/39948","key":"39948","details":"Myria is an Ethereum Layer 2 scaling solution, built to bring digital assets, NFTs, and blockchain gaming to life. Our mission is to empower digital asset ownership for people and businesses. If you get excited by the thought of joining a highly experienced, fast-paced global team that is building the future, this role may be for you.\n\nWe are looking for a Senior Accountant to operate taxes and external audits activities at Myria. You will report to the Chief Accountant.\n\nResponsibilities\n\nGeneral Accounting\n\nProduce the monthly, quarterly and annual consolidation of financial statements forMyria Group companies and ensure the financial reports complied with accepted accounting principles and financial reporting standards\n\nAssist Chief Accountant to establish internal controls and guidelines for accounting transactions\n\nProactively identify integration areas for improvement and take these opportunities to collaborate in designing solutions and updating our toolset and processes\n\nEnsure GL accuracy and fully supporting documents\n\nMaintain vendors and clients’ database in accounting system\n\nSuggest accounting improvements (Chart of Accounts, tools, etc.)\n\nCash Accounting\n\nReconcile and post transactions according to bank and crypto statements, credit card statement on daily basis\n\nCompute realized FX gain/loss from foreign currencies difference\n\nRevaluate foreign currencies balances at end of month\n\nAccount Receivables and Taxes\n\nPerform VAT/GST/FCWT returns for companies within group\n\nLiaise with the tax agent to review of local corporate tax returns and related work papers\n\nProvide ad hoc country or regional indirect/direct tax advice to the sales, purchases, accounts payable, credit and operations departments\n\nIssue and book AR invoices\n\nIdentify and track slow-paying customers and suggest DSO improvement solutions\n\nPrepare weekly AR aging report, highlight major collection problems and take actions for overdue amounts\n\nVerify discrepancies by and resolve client billing issues\n\nPerform revenue recognition and reconciliations\n\nAccount Payables and Payroll\n\nCollaborate with People’s Team to implements, maintains, and reviews payroll processing. Accounting timely the payroll related transactions including salaries, benefits, taxes, and other deductions\n\nSchedule and post business transactions, verify and process invoices, verify financial data for use in maintaining accounts payable records\n\nEnsure invoices posted are aligned with the accounting SOPs: Approved Purchase Requests, goods / services received, Approved Payment Requests, etc.\n\nPractice effective monitoring to ensure payments are made to vendors in a timely manner\n\nCollaborate with the Treasury team for disbursements, collections and reconciliations\n\nAd-hoc requests\n\nPrepare other reports and participate in other special projects as requested\n\nRequirements\n\nExperienced with consolidation process, multi-currency and multi-international organization\n\nExperienced in cryptocurrencies is a plus\n\nBachelors’ Degree in Accounting and Finance or equivalent. Professional accounting designation (CPA, CA, CMA) is a plus\n\nUnderstanding of accounting principles and current financial legislation especially Singapore Accounting Standard and familiar with IRAS\n\nExceptional time management, communication, and problem-solving skills\n\nStrong math and research skills\n\nOrganized and detail-oriented\n\nCan do attitude\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["accounting","senior","ethereum"]},{"job":"Visual Designer Marketing","company":"Consensys","location":"Remote","post_date":"5d","link":"https://web3.career/visual-designer-marketing-consensys/39946","key":"39946","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout our Design Team\nDesigners at ConsenSys make work that moves the crypto industry forward, spreading the gospel of WAGMI and pushing for the adoption of web3 technology. We’re ambitious, using our unique point of view to create work that infiltrates crypto culture and changes mindsets.\n\nWhat you’ll do\nAs a Visual Designer, Marketing, you will be responsible for designing and iterating upon the execution of ConsenSys’s marketing initiatives across its suite of products. Working closely with your counterparts in the marketing team and product design community across ConsenSys, you’ll raise the bar for the creative quality of our marketing efforts including efforts such as brand identities, digital experiences, events and swag design. And to do so, you'll bring with you a wealth of experience and be curious, creative and intuitive with a deep commitment to creating work that resonates with the highly-engaged crypto community.\n\nWould be great if you brought this to the role\n\nConceptualizing, designing and iterating on marketing executions to create engaging moments for our users across media channels\nCollaborating with the creative, design, product and marketing teams to deliver experiences that achieve brand and messaging goals\nEnsuring brand design systems are adhered to throughout the development of marketing initiatives\nWorking on new forms of interaction through the use of NFTs and web3 technology\nThinking strategically and empathetically about user outcomes\n\nWe’re looking for someone with\n\n3-5 years relevant experience, preferably at a design firm or advertising agency\nExpertise and/or formal education in design and creative direction and its process of ideation, creation and production\nExperience working across various media placements, including video, digital, physical and social platforms\nA strong portfolio demonstrating a passion for the creative craft through effective marketing campaigns\n\nThe ideal candidate\n\nThrives within a cross-discipline team in a remote-first environment\nUnderstands video, digital, physical and social media in all of their many forms\nHas extensive experience with creative tools like Adobe Creative Suite and Figma\nIs passionate about creative work and sweats the details\nIs driven by curiosity and pursuing new ways to engage\nIs a lifelong learner, always honing their craft, and eager to participate beyond their role\nIs eager to participate beyond their role with a can-do attitude\nGets excited about web-based and technology experiences\nWorks well in a fast-paced, agile environment\nIs a motivated self-starter who communicates clearly and effectively\nHas knowledge and experience in the blockchain/web3 space\n\nIt’s a bonus to have\n\nExperience in website and app design\nExperience in motion design\nExperience with remote work tools like Slack, Google suite and JIRA\nKnowledge of full-funnel marketing strategies\nInternational experience or experience working with global teams\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $78,000-140,000.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n \n\n#LI-KB1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","marketing","remote","ethereum"]},{"job":"Data Analyst","company":"Magic","location":"San Francisco","post_date":"5d","link":"https://web3.career/data-analyst-magic/39945","key":"39945","details":"About\n\nFounded by the creators of Fortmatic, Magic is a Web3 infrastructure company that empowers developers to create seamless and secure user onboarding experiences, abstracting away the complexities of blockchain technology. We are backed by top investors such as Tiger Global, Lightspeed Ventures, SV Angel, Social Capital, Northzone, Placeholder, Naval Ravikant, Alexis Ohanian, and Balaji Srinivasan.\n\nTo date, Magic has enabled more than 110K developers and enterprises to onboard over 10 million users to the Web3 ecosystem — and we continue to grow rapidly. We are trusted by leading NFT marketplaces such as Immutable, Niftys, OpenSea, Decentraland and major enterprise Web2 companies alike.\n\nIf you are excited to make Web3 accessible and help onboard the next billion users, let’s chat!\n\nThe Role\n\nMagic is hiring its first GTM Data Analyst, a pivotal role on our Revenue Operations team as we scale! You will leverage business intelligence, data engineering, analytics, and data science, working nimbly throughout the data tech stack to help us maintain and develop a world class suite of analytics solutions that increase revenue efficiency and intelligence. Examples may include leveraging ML predictions to create an opportunity scoring pipeline, designing tooling to track sales performance metrics, and implementing an automated system to measure incremental lift of AEs & CSMs.\n\nYou will:\n\n\nLeverage data to identify problem areas, propose solutions, and shape the long term strategy of our GTM organization\nCreate foundational predictive models to help drive key GTM decisions relating to Finance, Sales, and Marketing\nDevelop creative tools, features, and reports to empower self-service data access, augment business intelligence, and increase operational efficiency\nAdvocate for the GTM data ecosystem, and apply a diverse set of skills in business intelligence, analytics, and data science to support business growth\nOwn, coordinate, and tackle problems spanning across Sales, Marketing, Finance, Product, Engineering, and more\nCommunicate analyses and recommendations to executive stakeholders in verbal, visual, and written formats (we are in a fully remote environment!)\n\n\nWho You Are\n\nYou’re excited about how web3 can change the Web and world at large and want to see how the world’s biggest brands will pioneer paths forward\n4+ years of analytical experience in consulting, data analytics, revenue operations, data science, or machine learning and predictive analytics\nAdvanced to expert level SQL skills and familiarity with concepts beyond querying (schema and ETL design, and query optimization)\nExpert at reporting, dashboarding and visualizing data to tell compelling stories\nUnderstanding of key GTM motions, including customer targeting, segmentation, sales processes, and demand generation\nExperience in providing data driven solutions across the business intelligence and data layer\nExperience in applying data-backed heuristics to solve practical product problems all with the objective of increasing our top-line revenue\nStrong written and verbal communication skills, and ability to build relationships to influence across the organization\n\n\nBenefits\n\nFully remote team and flexible working hours\nCompetitive salary and stock options\n10% minimum performance-based annual bonus\nUnlimited paid time off\nPlatinum-level Health, Vision, and Dental insurance – Magic covers 99%\n401(k) program\nTop of the line equipment\n$300 monthly budget for personal wellness, professional development, and home office needs\nAnnual team meetups\n\n\nAt Magic, we believe building a team full of diverse perspectives and experiences is vital to success. We strongly encourage anyone who has been historically under-represented in tech to apply for this role. Magic does not discriminate on the basis of gender, sexual orientation, race, religion, citizenship status, age or physical ability. Empathy, authenticity, and inclusivity are at the core of all we do.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","data","science","nft"]},{"job":"Compliance Analyst","company":"Gemini","location":"United States","post_date":"5d","link":"https://web3.career/compliance-analyst-gemini/39944","key":"39944","details":"Empower the Individual Through Crypto\n\nGemini is a crypto exchange and custodian that allows customers to buy, sell, store, and earn more than 30 cryptocurrencies like bitcoin, bitcoin cash, ether, litecoin, and Zcash. Gemini is a New York trust company that is subject to the capital reserve requirements, cybersecurity requirements, and banking compliance standards set forth by the New York State Department of Financial Services and the New York Banking Law. Gemini was founded in 2014 by twin brothers Cameron and Tyler Winklevoss to empower the individual through crypto.\n\nCrypto is about giving you greater choice, independence, and opportunity. We are here to help you on your journey. We build crypto products that are simple, elegant, and secure. Whether you are an individual or an institution, we want to help you buy, sell, and store your bitcoin and cryptocurrency. Crypto is not just a technology, it's a movement.\n\nThe Department: Compliance\n\nCompliance at Gemini is a team dedicated to managing the next generation of financial and regulatory compliance in a complex and evolving regulatory environment. We are a diverse group of technology, legal, and operational professionals who develop new approaches to solving classic problems using cutting edge tools and processes\n\nThe Role: Compliance Analyst\n\nIn this role, you will be responsible for executing several functions within the Compliance Program Governance team to help Gemini uphold its high standards in the uncharted territory of digital assets, cryptocurrency, and blockchain technology. The Program Governance team comprises a team of Compliance professionals with responsibility for Compliance policies and procedures; annual risk assessment; quality assurance and testing programs; regulatory exams and audits; customer complaint process; and metrics across all facets of the Compliance program. Working alongside the Head of Program Governance and the rest of the Governance team, you will partner closely with key internal stakeholders (including C-level personnel) across Compliance, Risk, Corporate Development, Account Management, Engineering, Financial & Treasury Operations, Fraud and Operations as we work to enhance Gemini’s high standards in this groundbreaking territory.\n\nResponsibilities:\n\nReview, track, monitor, investigate, and help resolve customer complaints. Assist with responses to various regulatory bodies related to customer complaints\n\nConduct quality assurance reviews of various AML processes to ensure compliance with regulatory requirements and internal policies and procedures\nHelp develop and produce monthly and quarterly Compliance metrics\nAssist with the drafting and maintenance of relevant Compliance policies and procedures\nAssist with performing BSA/AML and Sanctions Risk Assessments\n\nQualifications:\n\nBA/BS degree\n1-3 years of relevant work experience within the financial services, digital asset or management consulting space (Big 4 or similar FCC/Financial Services Advisory/Assurance experience is desirable.)\nStrong attention to detail and organization\nSuperior written and verbal communication skills\nProficient with Google Slides and Excel/Google Sheets\nDemonstrated ability to manage several projects simultaneously\nAuthorization to work in the United States and fluency in English\n\nPreferred Qualifications:\n\nBasic knowledge of regulatory expectations and industry standards in relation to AML/BSA/Sanctions regulations\nGeneral understanding of AML and/or other Compliance related processes a plus\nExperience and comfort working with large datasets\nIntermediate-level expertise in Microsoft Excel\nInquisitive mind and a passion for problem solving\n\nIt Pays to Work Here\n\nWe take a holistic approach to compensation at Gemini, which includes:\n\nCompetitive Compensation and Profit-Sharing Equity\nFlexible vacation policy\nRetirement Plan Matching\nGenerous Parental leave\nComprehensive health plans\nTraining and professional development\n\nSalary Range: In compliance with Colorado's Equal Pay for Equal Work Act and the New York City Pay Transparency Law, the base salary range for this role is between $66,000 - 83,000 in Colorado and $83,000 - 92,000 in New York City. This range is not inclusive of our discretionary bonus or equity package. When determining a candidate’s compensation, we consider a number of factors including skillset, experience, job scope, and current market data.\n\nAt Gemini, we strive to build diverse teams that reflect the people we want to empower through our products, and we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. Equal Opportunity is the Law, and Gemini is proud to be an equal opportunity workplace. If you have a specific need that requires accommodation, please let a member of the People Team know.\n\n#LI-\n\n#LI-REMOTE\n\nGemini focuses on Financial Services, Virtual Currency, Bitcoin, and Cryptocurrency. Their company has offices in New York City and New York. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://gemini.com/ or find them on Twitter, Facebook, LinkedIn, and Product Hunt.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance","analyst"]},{"job":"Staff Mobile Engineer","company":"Gemini","location":"United States","post_date":"5d","link":"https://web3.career/staff-mobile-engineer-gemini/39943","key":"39943","details":"Empower the Individual Through Crypto\n\nGemini is a crypto exchange and custodian that allows customers to buy, sell, store, and earn more than 30 cryptocurrencies like bitcoin, bitcoin cash, ether, litecoin, and Zcash. Gemini is a New York trust company that is subject to the capital reserve requirements, cybersecurity requirements, and banking compliance standards set forth by the New York State Department of Financial Services and the New York Banking Law. Gemini was founded in 2014 by twin brothers Cameron and Tyler Winklevoss to empower the individual through crypto.\n\nCrypto is about giving you greater choice, independence, and opportunity. We are here to help you on your journey. We build crypto products that are simple, elegant, and secure. Whether you are an individual or an institution, we want to help you buy, sell, and store your bitcoin and cryptocurrency. Crypto is not just a technology, it's a movement.\n\nThe Department: Trading and Core Experience\n\nThe Role: Staff Mobile Engineer\n\nAs a Staff Mobile Engineer on the Trading & Core Experience team you’ll be leading a cross-functional team of web, mobile, and backend engineers who build the consumer products and trading experiences that users love within the Gemini ecosystem. You’ll build our product roadmap alongside your product partners, help the team quickly ship features and test multiple iterations, and steward our world-class engineering culture.\n\nResponsibilities:\n\nCollaborate with product managers, designers, and other engineers to design and deliver high-quality products on iOS and Android\nBuild efficient and reusable UI components and architect reliable, performant, and maintainable solutions\nLead teams that continuously build, ship, learn, and iterate.\nDrive technical innovation, processes, and best practices required to deliver best-in-class mobile applications\nMentor and develop a high-performing team of engineers\n\nQualifications:\n\nYou have at least 4 years of experience building mobile applications, and at least 8 years of total software engineering experience\nYou have at least 2 years experience using React Native to build cross-platform mobile applications\nYou are comfortable working with JavaScript/Typescript, but also not afraid to jump into Swift or Kotlin as needed\nYou have knowledge of mobile best practices and stay informed about innovations in the mobile industry\nYou have a strong understanding of UX/UI concepts and a demonstrated record of design and product sensibility\n\nPreferred Qualifications:\n\nExpertise in unit and integration testing\nExperience working with performance analysis tooling\nExperience working with Fastlane and/or build automation tooling\nExperience influencing product decisions with data\nExperience working autonomously with distributed teams\n\nIt Pays to Work Here\n\nWe take a holistic approach to compensation at Gemini, which includes:\n\nCompetitive Compensation and Profit-Sharing Equity\nFlexible vacation policy\nRetirement Plan Matching\nGenerous Parental leave\nComprehensive health plans\nTraining and professional development\n\nSalary Range: In compliance with Colorado's Equal Pay for Equal Work Act and the New York City Pay Transparency Law, the base salary range for this role is between $155,000 - $194,000 in Colorado and $172,000 - $241,000 in New York City. This range is not inclusive of our discretionary bonus or equity package. When determining a candidate’s compensation, we consider a number of factors including skillset, experience, job scope, and current market data.\n\nAt Gemini, we strive to build diverse teams that reflect the people we want to empower through our products, and we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. Equal Opportunity is the Law, and Gemini is proud to be an equal opportunity workplace. If you have a specific need that requires accommodation, please let a member of the People Team know.\n\n#LI-\n\nGemini focuses on Financial Services, Virtual Currency, Bitcoin, and Cryptocurrency. Their company has offices in New York City and New York. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://gemini.com/ or find them on Twitter, Facebook, LinkedIn, and Product Hunt.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","mobile","react","react","native","javascript"]},{"job":"Web3 Systems Architect","company":"Curve Labs","location":"New York","post_date":"5d","link":"https://web3.career/web3-systems-architect-curve-labs/39942","key":"39942","details":"How to apply\n\nOnly applications through this link will be considered https://forms.gle/jXpycmn8LAimwXKr5\n\nAbout Us\n\nCurve Labs is a team of design and development interventionists architecting distributed solutions for the future economy. We tackle systemic challenges of the Anthropocene by creating, combining, and integrating modular open-source technologies to form organizations more than the sum of their parts.\n\nThe Lab, which launched early 2020, is a registered German limited liability company (GmbH) headquartered in Berlin. Our work currently covers three domains:\n\nWe are a design and development agency that works with organizational web3 primitives to create blockchain-native organizations, a.k.a. “DAOs.” Our clients include an activist coop, a decentralized finance application, and a sustainable development network.\nWe are social activists, creating and advocating for web3 solutions in regenerative finance, data sovereignty, and distributed energy systems. We aim to build holistic cyberphysical systems that simultaneously address social and ecological crises.\nWe are hands-on technologists who create infrastructural web3 building blocks, such as identity and reputation modules, smart wallets, and version control systems. We understand that these primitives are crucial for mass distributed technology adoption.\nAltogether, Curve Labs is an exciting and diverse collaborative network of passionate domain experts navigating the razor edge of innovation. Join us.\n\nWhat we’re looking for\n2+ years of experience with Web3/decentralized systems; ideally in production. Candidates must be Web3-native.\nSolid conceptual understanding of full stack software development including system architecture, web infrastructure, and database design.\nFormal education, such as a Master’s degree, in economics, econometrics, mathematics, systems engineering, finance, or similar fields.\nExperience with modeling software, e.g. a python-based simulator like cadCAD or a lo-fi modeling tool like Machinations.\nGreat interpersonal and communication skills and comfort working across different cross-functional teams in a fast-growing ecosystem. Highly responsive to system-related communications.\nAbility to independently propose, plan and execute on a project given a loosely defined scope and roadmap\nExcellent communication and presentation skills. Can explain complex technical concepts in understandable terms to downstream resources, such as product designers or developer staff.\nStrong writing skills — proof of LaTeX and schematic/diagramming experience. Bonus: contributor to at least one journal-published paper.\nIdeally based in Berlin, or close to the CET timezone. Candidates more than six hours away from CET will not be considered.\nWhat you’ll do\nYou’ll be situated between the research team (upstream) and designers/developers (downstream). As such, you’ll translate high-level theory to low-level implementation by providing architectural specifications downstream. You will formalize and own this process, speaking the language of different domain specialists in both directions.\nYou are the central node for all systems related inquiries, ensuring knowledge flow to rest of the team. You present Web3 system designs in a timely, understandable fashion, minimizing back and forth.\nYou model and communicate about dynamic systems thereby working closely with engineers, product managers, and designers to help define business logic, protocol/product requirements and problems. You support the hard work of economic modeling associated with technology or financing innovations with analytical, experimental, or model-based assessment\nYou collaborate with designers on User Stories.\nYou actively learn and research various fields related to Web3 technologies\nBonus: Experience writing blockchain smart contracts (e.g. Solidity) or other coding languages and tools.\nThis job is a great fit if...\nYou can work autonomously. You love proposing ideas and bouncing them off of people, and you’re comfortable working in a loosely structured team.\nYou want to work with people that care. Working at the labs is a vibe. We’re not just looking for someone to fill a role; we’re looking for someone who wants to vibe with us.\nYou care about developer handoff. You love going the extra mile to make sure that files handed off to developers are deliberate, consistent, and well documented.\nYou are organized. You are a fan of solid documentation and keeping your files tidy in a way that makes sense for designers and developers.\nYou love experimenting. Web3 is an emerging field, and programming patterns haven’t converged into best practices yet. Best practices are great, but the willingness to experiment goes a long way. Embrace your hacker spirit.\nYou love learning. We’re building new markets and economies with fundamentally different technology. The best designers are good storytellers, and curiosity about economics, blockchain, and regenerative finance will help you craft better narratives.\nWhat you’ll get\nA competitive salary.\nA unique and creative office space in Berlin for creating and hacking.\nA leadership team that embraces creativity and gives you space to explore and grow.\nCoaching in blockchain, web3, economics, regenerative finance.\nA welcoming and inclusive culture where team members can collaborate, unite around a common goal, and take pride in doing the best work of their careers.\n\nCurve Labs focuses on Governance, Cooperative, Economics, Blockchain / Cryptocurrency, and Web3. Their company has offices in Berlin. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://www.curvelabs.eu/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["architecture","remote","solidity","node"]},{"job":"Head of Studio","company":"Myria","location":"","post_date":"5d","link":"https://web3.career/head-of-studio-myria/39941","key":"39941","details":"\nMyria is an Ethereum Layer 2 scaling solution, built to bring digital assets, NFTs and blockchain gaming to life. Our mission is to empower digital asset ownership for people and businesses. Myria is an all-remote company hiring top gaming/web3/blockchain/fintech talent located across the world. If you get excited by the thought of joining a highly experienced, fast-paced global team that is building the future, this role may be for you.\n\nOur Myria Studios creates a range of free-to-play blockchain games spanning across an entire interconnected ecosystem. Our latest game lineup includes Metarush, obstacle battle racer and AB de Villiers cricket game by Myria Studios and Moonville, a simulation game in development in collaboration with our partner studio.\n\nAs a Head of Studio, you will guarantee the development of high quality video games in line with the Myria roadmap and the players’ expectations. This is a senior leadership position reporting to our Co-CEOs - We are looking for an experienced, visionary and motivated leader of our Myria Studio who will manage and elevate our superstar teams of Game Design, Art, and Production.\n\nYou will define and implement a sustainable development strategy and ensure the team’s performance and company growth. You should have a deep understanding of launch strategy, operations and the importance of cultivating superfans throughout the product lifecycle and around the games.\n\nResponsibilities\n\nDevelop and manage the business plans required to grow the studio\nDefine the most effective organisation, managing both production and G&A teams and train Myria Studio’s leadership to ensure effective and efficient delivery\nCollaborate efficiently with editorial teams and partner studios, define for your team's objectives of quality to reach for all mandates and games developed by your studio\nExercise strong judgement and be the final point of escalation\nImplement best practice methodologies, production processes and efficient tools to promote and foster a gamer-centric culture, an innovation mindset and effective collaboration with other studios associated with the projects.\nRecruit the best skills around you and foster a culture that promotes the constant development of expertise across the studio.\n\nQualifications\n\n10 or more years of studios management experience is required\nYour strong production know-how (AAA experience), your strong co-development mindset, in addition your entrepreneurial skills are key to implementing a sustainable development strategy\nIdentified as a leader, you foster team motivation and build trusting relationships with your partners\nCrisp communicator at the executive level\nHighly analytical, preference for financial and priority decisions based on data & research\nGamer and consumer oriented, you have a deep knowledge of video games market\n\nEmployee benefits\n\n100% remote roles\nUnlimited time-off (for full-time Employees)\nFlexible working hours\nCompetitive salaries\n\nDiversity & Inclusion\n\nMyria is an equal opportunity employer which brings people from all origins and backgrounds together. Our highly diverse team is one of our strongest assets and we have a zero-tolerance approach to any type of discrimination (ethnicity, age, disability, gender identity, sexual orientation, religion or belief).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","ethereum"]},{"job":"Product Owner","company":"Myria","location":"","post_date":"5d","link":"https://web3.career/product-owner-myria/39940","key":"39940","details":"Myria is an Ethereum Layer 2 scaling solution, built to bring digital assets, NFTs and blockchain gaming to life. Our mission is to empower digital asset ownership for people and businesses. If you get excited by the thought of joining a highly experienced, fast-paced global team that is building the future, this role may be for you.\n\nWe are looking for an experienced Product Owner with deep knowledge of agile methodologies and best practices to ensure maximum value is delivered from our Product squads. You will closely collaborate with Product Managers, Scrum Masters, UI/UX Designers, and the Engineering team to deliver on our ambitious roadmap of products and services that will revolutionize the burgeoning web3 industry.\n\nResponsibilities\n\nLead agile delivery teams as a Product Owner to prioritize backlog items, owning the product roadmap on behalf of business and technology stakeholders and planning for sprints with your squad\n\nKeep up with the latest technological advances in web3 and blockchain gaming and assess and analyze competitor products to further develop our suite of products and services\n\nDelivering and contributing to the overarching product roadmap based on our business objectives\n\nManage product and technology delivery expectations and status reporting to project stakeholders\n\nLeading agile delivery teams as Product Owner to prioritize product backlog items, owning the product\n\nEffectively manage and work with numerous delivery partners to deliver great outcomes to the business and our users\n\nAnalyze and assess technical problems and work with your team to come up with strategic solutions\n\nOwning ongoing product reiteration and support to ensure services are evolving to meet market and customer needs\n\nMentor and lead the tech product owner capabilities in both their product craft and their agile mindset\n\nEmbeds agile methodologies and continuous improvements practices in the team\n\n\n\nQualifications\n\n3+ years of previous Product Owner experience, preferably gained in gaming or technology industries, and a degree in a technology coupled with technical project delivery\n\nHighly motivated and with strong attention to detail working in a fast-paced, distributed agile environment\n\nStrong communication, stakeholder management and problem-solving skills\n\nAbility to drive product and delivery schedules and ensure we deliver the best experience for our superfans\n\nPrevious project/product experience and experience in the web3 space will be considered an advantage\n\nEmployee benefits\n\n100% remote roles\nUnlimited time-off (for full-time Employees)\nFlexible working hours\nCompetitive salaries\n\nDiversity & Inclusion\n\nMyria is an equal opportunity employer which brings people from all origins and backgrounds together. Our highly diverse team is one of our strongest assets and we have a zero-tolerance approach to any type of discrimination (ethnicity, age, disability, gender identity, sexual orientation, religion or belief).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","ethereum"]},{"job":"Devops Engineer Remote","company":"Myria","location":"","post_date":"5d","link":"https://web3.career/devops-engineer-remote-myria/39939","key":"39939","details":"About Myria\n\nMyria is building a blockchain gaming ecosystem powered by the Myria blockchain. Our mission is to enhance the power of play through blockchain, enable economic access and ownership, and drive a new era of opportunity, exploration and freedom for every human on Earth. If you get excited by the thought of joining a highly experienced, fast-paced global team and get excited about building the future, this role may be the one for you.\nAbout the role\nMyria is looking for a highly reliable and autonomous DevOps Engineer who will be involved in many different phases of the software application lifecycle including Web Apps and Web Services, Games as well as blockchains & NFT's in the near future.\nResponsibilities\nWork in a fast-paced DevSecOps environment and deliver our products to market quickly and efficiently\nImplement and maintain CI/CD pipeline for deployment and test automation\nMonitor application health and performance and be proactive in anticipating production issues such as outages, slowness, processing delays, errors and failures, and take corrective action to prevent them\nProvide continued improvement to the platform infrastructure through automation and standardisation\nRequirements\nHands-on experience with AWS services (Lambda, ECS, EC2, ALB, ASGs, CW, RDS, SNS, VPC, SG, IAM, SQL/NoSQL, etc but you don't need to know all!)\nHands-on experience with Infra as Code (CloudFormation, Pulumi, CDK, or Terraform)\nHands-on experience with Docker\nExperience with monitoring and reliability (this role is more SRE than Sys engineering)\nAbility to build complete CI/CD workflows - GitLab is preferred\nFamiliarity with GitOps and DevSecOps\nBasic knowledge in any programming languages: Shell, Bash, Typescript, Go, Python, etc\nBasic knowledge in popular public & enterprise blockchains, cryptocurrency, smart contract (Solidity), NFTs.\n\nEmployee benefits\n\n100% remote roles\nUnlimited time-off (for full-time Employees)\nFlexible working hours\nCompetitive salaries\n\nDiversity & Inclusion\n\nMyria is an equal opportunity employer which brings people from all origins and backgrounds together. Our highly diverse team is one of our strongest assets and we have a zero-tolerance approach to any type of discrimination (ethnicity, age, disability, gender identity, sexual orientation, religion or belief).\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","devops","dev","solidity","nft"]},{"job":"Investment Analyst","company":"Myria","location":"","post_date":"5d","link":"https://web3.career/investment-analyst-myria/39938","key":"39938","details":"Myria is an Ethereum Layer 2 scaling solution, built to bring digital assets, NFTs, and blockchain gaming to life. Our mission is to empower digital asset ownership for people and businesses. If you get excited by the thought of joining a highly experienced, fast-paced global team that is building the future, this role may be for you.\n\nWe are looking for an Investment Analyst to source, review and assess investment opportunities. As an Investment Analyst you will work closely with the Investment Director across a range of interesting opportunities. You will be given the relevant training and development, while having autonomy the shine in your role.\n\nResponsibilities\n\nDevelop clear opinions on investment opportunities including games and protocols based on analysis within Myria’s research framework.\n\nGenerate investment ideas, approach investment targets and drive the investment process throughout the lifecycle with support from the Investment Director.\n\nPrepare long form detailed analysis into investment opportunities and market themes to share publicly and internally.\n\nSupport the project management of a transaction from inception to completion.\n\nSupport the due diligence process regarding potential investments and acquisitions.\n\nWork with portfolio companies to improve internal processes and explore areas where Myria can add value.\n\nWork across Myria with internal teams to provide support as required.\n\nQualifications\n\nDemonstrated experience and passion in investing, whether that be in a professional setting or through your own account.\n\nStrong analytical, mathematical and English writing skills.\n\nAbility to analyze inputs from multiple/complex data sources on a qualitative and quantitative basis.\n\nStrong attention to detail and ability to communicate clearly and effectively with all seniority levels of professionals internally and externally.\n\nBachelor’s degree preferably with a focus on Finance, Business or Economics or some financial qualification such as IMC / CFA / CAIA.\n\nPassionate about gaming and web3 (maybe not both, but certainly an interest and curiosity will be required).\n\nResults oriented, and enthusiastic attitude and not afraid of long hours, sometimes with tedious tasks.\n\nAvailability through all hours – due to the global nature of the business this will not be a 9-5 role.\n\nAbility to travel globally would be preferable.\n\nBenefits:\n\nTraining and continuous development, fully remote working, great team culture.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","finance","ethereum"]},{"job":"Metaverse Web3 Creative Strategist a Berlin based Fashion Brand","company":"Children of Time","location":"","post_date":"5d","link":"https://web3.career/metaverse-web3-creative-strategist-for-a-berlin-based-fashion-brand-patuclothing/39937","key":"39937","details":"COT is a Berlin-based brand with physical roots.\n\nWe stand out for the story we transport and are in the middle of a vibrant and digital city.\n\nWe are already connected in the digital world and have already dealt with how to build the bridge from the physical to the digital world.\n\nIf you want to become part of the core team as a web3 specialist and expand the brand further into web3, then get in touch.\n\nAufgaben\n\nWhich ways and technologies are available to us to bridge the gap between physical and digital? Tokens, Poaps, community building, digital experiences, the use of AR and VR and co-creation are just a few keywords you have dealt with or would like to deal with.\n\nQualifikation\n\nPassionate about web3/metaverse\n\nBenefits\n\nWorkplace at Factory Berlin. Become part of the founding team of COT.\n\nThis is not a conventional job ad, I am looking for someone who can support us in the web3 strategy and creative direction in the metaverse and help build the brand.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","metaverse"]},{"job":"PACT Smart Contract Developer","company":"Kalend Finance","location":"United States","post_date":"5d","link":"https://web3.career/pact-smart-contract-developer-kalend-finance/39936","key":"39936","details":"We are looking for an experienced protocol developer to join our team, who is excite dabout our mission to bring Defi primitives to Millions of users. They will be responsible for helping the Kalend team in building the most secure, seamless, and high performance protocol that offers our customers an easy-to-use application for lending and borrowing in the Kadena ecosystem.\n\nThis is one of Kalend’s early hires and a unique opportunity to drive deep impact and shape one of the most anticipated startups building the future of finance. Join a talented team of builders passionate about helping investors across all levels weathers the storms of crypto Nearly uncapped upward mobility, room for improvement, and increased accountability. The team behind this initiative consists of the serial entrepreneurs from Stanford Blockchain Network, ex-Apple, and ex-Google engineers. We are growing at a breakneck pace and are looking for hungry and humble builders to join us.\n\nResponsibilities\n\nYou will work directly with the core team, where your experience will complement our coverage of knowledge of best practices in designing main net deployments and finishing off our Smart Contracts. You’re mature and experienced in systems design and engineering, and have the right way of thinking about design and implementation challenges. You will be our lead engineer on the protocol and smart contract implementation. Research and drive high-level decisions about protocol architecture, incentive structures, and features. Spec, implement, test, and audit protocol upgrades and additions. Work effectively with a high degree of autonomy, within a collaboratively minded team. Keep up to date with new blockchain technologies that can drive Smart Contract Developer to meaningful product results for our users. Collaborate with the official team at Kadena, including engineering and product management.\n\n‍\nRequirements\n\nBachelor's degree or nothing, we don’t care about your degree\nExperience writing high-quality, well-tested Smart Contract code on any L1 platform.\nKnowledge of the blockchain technology, and crypto-economic protocols\nStrong communication, ownership, and collaboration skills\nThe ability to learn and adapt to a rapidly evolving tech stack\n\nPassion for the benefits of decentralization\n‍\nNice to Haves\n\nPrior development experience with Kadena or Pact/any functional programming language.\n\nExperience in or knowledge of financial markets, trading, and investing\n\nDeep passion for emerging technologies and understanding their implications\n\nBenefits\n\nCompetitive Salary\nOpportunity to impact the next 100M users in crypto\nAn open and collaborative work culture with a flat structure\nFlexible working hours and vacation policy\nTalented peers and a great working environment\n\nHiring Process\n\nPrescreening interview: A quick video call so we can learn more about each other and discuss experience and project scope\nTechnical task: We assign an offline technical task\nLive technical round: A meeting with our core team members were you will go through a live coding exercise related to the scope of work, this may be follwed by another interview with another core team member\nOnboarding\n\nKalend Finance focuses on Blockchain / Cryptocurrency and Web3. Their company has offices in United States. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://www.kalend.finance/ or find them on Twitter and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract"]},{"job":"Lead Visual Designer earlystage Crypto Startup","company":"Klink Finance","location":"","post_date":"5d","link":"https://web3.career/lead-visual-designer-for-early-stage-crypto-startup-klinkfinance/39935","key":"39935","details":"Location: Berlin with remote availability. Your team is based in Berlin, working in the CET time zone.\n\nWorking Language: English\n\nAbout the project\n\nWe are hiring a Marketing Designer who has a balance of great visual design coupled with the ability for storytelling in different formats. As a visual designer at Klink, you will partner with our senior leaders to conceptualize, conceive, adapt and execute designs in different forms, for branding collateral, internal presentations, product demos, market launches, and much more.\n\nWe are an emerging personal finance platform rewarding positive behaviour through win-win incentives and our mission is to reward the next generation for developing healthy financial habits while also enabling the chance of winning significant wealth each week through digital assets.\n\nTasks\n\nWhat are the role responsibilities?\n\nWork independently and collaboratively with Product and Marketing teams on projects to create experiences, campaigns, graphic concepts, assets, and visual treatments\nProduce brand and campaign standards & templates\nElevate brand aesthetics while supporting the overall brand direction\nWork with partners across Klink to guarantee an integrated brand experience\nDevelop compelling visions, stories, concepts, visual designs, and prototypes\nHelp to formulate our internal visual design strategy, and ensure visual design excellence\nCreate presentation decks for executives\nWork closely with Product Design on UI Mockups, UI Click-through demos, and GIFs or Simple Animated Screens\nExecute layouts, typography, iconography, color theory, and compositions to design with artistry, creativity, and mastery\nRequirements\n\nWhat skills do you bring?\n\n5+ years of professional experience as a visual designer\nAn outstanding portfolio, showcasing a foundation in storytelling, illustration, typography, visual, UI design and motion\nExpertise in Figma, Powerpoint/Keynote, Illustrator and image editing software such as Photoshop\nBasic understanding or ability to manage contract workers focused on motion and animation software such as After Effects, Keynote’s animation capabilities or other\nUnderstanding of UI principles for desktop and mobile applications\nExperience working and collaborating with diverse teams in a dynamic, rapid-growth environment\nAbility to execute high-quality work in a fast-paced environment – strong adaptability\nExperience with prototyping as a means to explore and convey design solutions\nBenefits\n\nWhy you should join us\n\nJoin at an executive level and be involved in decisions that shape the company’s brand and feel\nWork from our Berlin office or remotely and enjoy regular team events and occasional travel across Europe\nBrand new equipment (Macbook/Laptop, headphones, etc.) as needed\nYou will receive a competitive salary and meaningful equity stake in the business\nTake a trip with a forming team of highly skilled individuals who will always support you on this journey\n\nHow to become part of the team\n\nIf you want to know more about this opportunity please complete this application with your most recent work profile and we will get back to you ASAP. We are excited to meet you!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","lead","crypto"]},{"job":"L1 Support Specialist Lykke Crypto Exchange","company":"Lykke Business AG","location":"","post_date":"5d","link":"https://web3.career/l1-support-specialist-for-lykke-crypto-exchange-lykke-business/39934","key":"39934","details":"As a follow-up to OANDA, Richard Olsen founded Lykke Corp in 2015 intending to reinvent financial markets through innovative financial engineering.\n\nLykke’s modular and scalable open-source approach fuses deep financial expertise with white-label platforms and rapid customization to accelerate the development of transformational solutions. This, combined with our trusted Swiss heritage and careful adherence to the legislative landscape make Lykke Corp an ideal partner for leading businesses looking to embrace the power of the blockchain and beyond and for retail users looking for cost-efficient solutions.\n\nTasks\n\nSupport part:\n\nEnsure customer satisfaction and provide professional customer support: respond promptly to inquiries, acknowledge and resolve customer complaints, and escalate the issues if necessary;\nKeep records of customer interactions, transactions, feedback, and complaints;\nPrepare users' activity statistics reports;\nGather and review information for Corporate Clients' onboarding;\nUpdate the Lykke website Status page in case of maintenance or technical issues.\n\nCompliance part:\n\nReview Proof of Funds documents and decide on a limit increase for the account;\nReview and resolve KYT cases.\n\nFinance part (through Lykke Exchange Back Office System):\n\nReview and process FIAT deposits & high-volume withdrawals;\nPerform funds migration in case of a change in the user’s account.\nRequirements\nAt least a Bachelor's Degree in Finance / Economics/ Law / Business Administration Or at least 2 years of experience in the financial sector\nFull work proficiency in English, both written and verbal\nUnderstanding of crypto/blockchain products and Defi space\nAbility to multitask, prioritize based on urgency\nGood self-management, proactiveness and responsibility for the result\nStrong teamwork ethic whilst also having the ability to function without explicit direction, challenge yourself to learn new things and continually improve\nKnowledge of SQL as a Plus\n\nIf you are ready to contribute to a fast-growing company in an exciting industry that has a transformative impact on society, we encourage you to apply today!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["customer","support","crypto"]},{"job":"Business Development Lead Remote US","company":"Polygon","location":"United States","post_date":"5d","link":"https://web3.career/business-development-lead-remote-us-polygon/39933","key":"39933","details":"Business Development Lead (Remote - US)\nUnited States /\nBusiness Development / Partnership – Business Development /\nRemote Full-time\n/ Remote\n\nApply for this job\nWhat is Polygon?\n\n\nPolygon is the leading platform for Ethereum scaling and infrastructure development. Its growing suite of products offers developers easy access to all major scaling and infrastructure solutions: L2 solutions (ZK Rollups and Optimistic Rollups), sidechains, hybrid solutions, stand-alone and enterprise chains, data availability solutions, and more. Polygon’s scaling solutions have seen widespread adoption with 37,000+ applications hosted, 1B+ total transactions processed, 140M+ unique user addresses, and $5B+ in assets secured.\n\n\n\n\nAbout The Team Polygon Business Enterprise works to implement different Polygon Solutions to a wide range of industries, offering cutting-edge solutions to enterprises’ pain points, starting from exploration to deployment with full ownership.\n\nResponsibilities\nDevelop commercial and strategic relationships with enterprises: providing them blockchain infrastructure and applications.  Understand industry best practices and trends: and advise how we can interact with Enterprises to grow the Polygon ecosystem.\nGrow and maintain relationships with Enterprises in the industry: exploring synergies and possibilities of growth with the services offered by Polygon, including identifying the most adequate business model and type of integration.\nAccount and project management to coordinate integration to Polygon and engagement of different Polygon internal business units.\nManage projects with external implementation partners (software development studios, agencies, etc.)Build a pipeline of projects from both inbound and outbound lead generation.\nConduct advanced negotiations with enterprises; providing the different solutions from the Polygon Ecosystem.\nLeverage your industry connections to engage and advise on web3 and self-sovereign identity trends and knowledge to move to web3.\nWork closely with the multiple teams to grow adoption and deploy resources.\nBasic Qualifications\nMinimum of a bachelor's degree\n10+ years of experience in sales / business development in enterprise organizations.\n2+ years (ideal) experience in Sales or BD in the Blockchain and cryptocurrency space\nPreferred Qualifications\nBusiness- and partnerships development experience in the corporate sector as well as a good understanding of the Ethereum and wider blockchain ecosystem\nProven track record of establishing and leveraging high-level relationships and presenting creative solutions to generate growth.\nSelf Driven / Entrepreneurial mindset\nGood knowledge of Blockchain technology & the crypto space - NFT, DeFi ecosystem\nGood at understanding and explaining technical concepts\nGreat presentation & communication skills Great at building & leveraging relationships\nPreferable: Pre-existing knowledge about Digital Identity solutions, ZK technology, NFTs and Web3 concepts.\nAbility to leverage industry connections to grow business for Polygon Business Enterprise.\nOther Job Details\nLocation: USA \nTravel: Domestic and international up to 10% of the year\n\n\n#li-remote\nBenefits\n\n\nWork from anywhere (Remote first)\nFlexible working hours\nFlexible vacation policy\nCompetitive Salary\n\n\nPolygon is committed to a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\n\n\nLearn More about Polygon\n\n\nWebsite | Twitter |  Ecosystem Twitter | Developer Twitter | Studios Twitter | Telegram | Reddit | Discord | Instagram | Facebook | LinkedIn\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","sales","non-tech","lead","ethereum"]},{"job":"Counsel or Senior Counsel Regulatory Compliance","company":"OpenSea","location":"New York","post_date":"5d","link":"https://web3.career/counsel-or-senior-counsel-regulatory-compliance-opensea/39932","key":"39932","details":"Counsel or Senior Counsel, Regulatory & Compliance\nSan Francisco or New York City /\nLegal /\nFull Time\n/ Hybrid\n\nApply for this job\nOpenSea is the first and largest marketplace for non-fungible tokens, or NFTs. Applications for NFTs include collectibles, gaming items, domain names, digital art, and many other items backed by a blockchain. OpenSea is an open, inclusive web3 platform, where individuals can come to explore NFTs and connect with each other to purchase and sell NFTs. At OpenSea, we're excited about building a platform that supports a brand new economy based on true digital ownership and are proud to be recognized as Y Combinator's #4 ranked top private company.\n\n\nWhen hiring candidates, we look for signals that a candidate will thrive in our culture, where we default to trust, embrace feedback, grow rapidly, and love our work. We also know how critical it is to celebrate and support our differences. Employing a team rich in diverse thoughts, experiences and opinions enables our employees, our product and our community to flourish. We are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. To help facilitate this, we support remote, hybrid or onsite work at either New York City, San Francisco or the Silicon Valley for the majority of our opportunities.\n\n\nWe are looking for someone who is scrappy, flexible, able to problem solve and get things done, and has a love of learning.  You will be an early member of our Legal team and will have key roles in regulatory counseling and compliance matters.  The ideal candidate is a collaborative team player who is passionate about NFTs and blockchain technology and happiest in a fast-paced, action-oriented environment.\n\n\nWe are open to candidates who are based in (or willing to relocate to) San Francisco or New York.\nResponsibilities\nHelp assess and respond to complex regulatory inquiries, as well as help identify and execute (through our partners in Trust & Safety, Product, ENG, or directly in Legal) solutions to help mitigate key areas of legal risk\nProvide legal and compliance advice on the development, improvement, and maintenance of risk management programs, particularly in the areas of securities, sanctions, and money laundering\nAssist with law enforcement matters\nProvide product, operations, and community teams guidance on day-to-day issues, as well as foundational legal issues without clear solutions\nKeep abreast of quickly developing legal landscape to forecast and head off challenges for rapidly scaling business\n\n\nIf you don't think you meet all of the criteria below but still are interested in the job, please apply. Nobody checks every box, and we're looking for someone excited to join the team.\n\nDesired Experience\n5+ years of legal experience\nExperience with crypto or web3 products or platforms\nExperience providing legal and compliance advice across a variety of legal issues (securities, sanctions, and/or anti-money laundering experience a plus)\nExperience devising or implementing processes and controls designed to mitigate legal risk\nStrong risk assessment and execution skills\nTrack record of collaborative partnership with lawyers and non-lawyers to solve problems and get things done\nJuris doctor from an accredited law school\nMember of a US state bar in good standing\n(Nice to have) In-house experience at high-growth, technology, or web3 company\n(Nice to have) Relevant government or regulatory experience \nThe base salary for this full-time position, which spans across multiple internal levels depending on qualifications, ranges between $200,000 to $285,000 plus benefits & equity.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance","legal","senior"]},{"job":"Community Manager Web3 Metaverse","company":"Quotacom","location":"New York","post_date":"5d","link":"https://web3.career/community-manager-web3-metaverse-quotacom/39931","key":"39931","details":"Quotacom are proud to be partnered with a leading global sports marketing agency who are shaping the future of sports entertainment by leveraging new emerging Web3 technologies across the Metaverse/ NFTs/Tokenization and Blockchain.\n\n\n\n\nFuelled by continued success they are seeking a Community Manager to develop innovative, strategically thoughtful digital platforms and social media channels on behalf of brands and renowned clients from the sports & entertainment world.\n\n\n\n\nYou will execute engaging digital campaigns on Discord, Twitter, and Instagram that solve client business challenges through creative content-driven storytelling and partner with high-profile brands to accelerate their audience engagement through Web3 adoption.\n\n\n\n\nThis is an exciting opportunity to join a multi-billion dollar business and spearhead their initiatives to bring the transformative power of blockchain to the world of entertainment.\n\n\n\n\nThe ideal profile will have the following:\n\n2-4 years experience in high-paced, challenging environments within the social media and content creation space, preferably at a creative agency\nStrong interest in the Web3, blockchain, metaverse environment with previous private and/or professional experience in this space\nProven experience in developing fan / consumer engagement solutions and driving performance, e.g., by successfully growing and managing communities on Discord channels\n\n\n\nAt Quotacom, we take the security and privacy of your personal data very seriously, any data we hold will be in accordance with data protection legislation. Full details of our privacy notice can be found at www.quotacom.com/privacy-notice/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","metaverse"]},{"job":"Content Community Manager","company":"Neural","location":"United States","post_date":"5d","link":"https://web3.career/content-community-manager-neural/39929","key":"39929","details":"Company Introduction\n\n\n\n\n🌐 Neural is building the world’s first health and wellness ecosystem that empowers people to collect, share and monetize their most valuable health and wellness information, empowering people to change the world.We are backed by healthcare execs, professional and Olympic athletes, aerospace engineers, technology innovators, and disruptors.\n\n\n\n\nWe are assembling a team of individuals who refuse to accept the status quo or stay inside the lines, but those who want to create, collaborate, and share our desire to foster individual governance over humanity’s information. At Neural, your work truly matters and you will have the opportunity to build an ecosystem that will advance humanity into the next era of innovation.\n\n\n\n\nSummary of Position\n\n\n\n\nAre you looking for a team at a rapidly growing company where your perspective is valued? Neural is looking for a high performing Content and Community Manager that can work with limited oversight.This role will assist the Marketing function with community management, content creation, execution and reporting while supporting the execution of strategic social media marketing plans.\n\n\n\n\nThis a full-time, remote position.\n\n\n\n\nRole and Responsibilities\n\n\n\nManage all Neural social platforms\nDevelop content for a variety of social channels including but not limited to Facebook, Instagram, TikTok, YouTube, Pinterest and Twitter\nCreate and maintain a comprehensive editorial calendar\nGenerate audience conversations and strengthens the social communities for brand channels\nRespond to comments in order to foster a positive community and add value to the user’s experience\nCreate social media reports on a weekly/monthly basis that include an analysis of current social activity and future marketing recommendations based on trend data\nIdentify & collaborate with thought leaders to create value for the community\nEstablish and monitor KPIs (reporting/dashboard); communicate KPI results to key stakeholders, translating data into insights with clear summaries of the implications and recommended actions\nOversee SEO, SEM, and optimization efforts\nCollaborate with Marketing Director to plan and manage media budgets\nCollaborate with agencies, cross-functional team members, and various partners\nPartner with CRM manager to extract insights into digital platform requirements / evolution\nEnsure work produced meets quality standards with adhesion to strategic direction\nPerform other related duties as assigned\n\n\n\nQualifications and Educational Requirements\n\n\n\nBachelor’s Degree in Business, Marketing, or related field is preferred or equivalent experience\n3+ years Marketing experience\nExperience building and managing successful social media communities is required\nExperience in working within and defining social media strategies, KPIs, and goals to grow audience and engagementis required (Facebook, Twitter, Pinterest, Instagram, Snapchat, TikTok, YouTube, LinkedIn, etc.)\nStrong keyword & SEO skills\nStrong understanding of how content is written for social platforms\nKnowledge of all forms of social media interactions (blogs, forums, communities, etc.), basic principles for paid social programs and social media marketing tools\nTeam player; ability to receive direct feedback and provide immediate reaction\nDedicated and driven work ethic\nExcellent verbal and written communication skills\nExcellent organizational skills and attention to detail\nWorking knowledge of Microsoft Office Suite, GSuite or similar tools\nHealth and wellness industry product experience is highly preferred\nBonus points for Blockchain and Crypto experience\n\nTravel\n\nUp to 30%\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech"]},{"job":"Data Analyst Remote","company":"Horizon Blockchain Games","location":"Toronto","post_date":"5d","link":"https://web3.career/data-analyst-remote-horizon/39928","key":"39928","details":"Data Analyst - Remote\nRemote – Toronto, ON /\nProduct /\nRemote\n\nApply for this job\nWho we're looking for\n\n\nWe're looking for an experienced Data Analyst who can present insights with data in a presentable, readable, and actionable way.\n\n\nWe value attention to detail, and the ability to apply critical thought to how data is queried, and structured.\n\n\nOur team is small, and self-driven analysts who enjoy the opportunity to work closely alongside talented colleagues will thrive best in this role.\n\n\nThis role will focus mainly on analyzing data from our blockchain game, Skyweaver, but will likely expand over time to include Sequence, Horizon's blockchain infrastructure platform. So on the whole, you will be exposed to a large area of web3 data, spanning player game data, blockchain transactions, NFT marketplaces, crypto wallets, and more. You will have a front-row seat into web3, working alongside some of the best web3 engineers and thinkers in the space. \nResponsibilities\nDrive impact across the company through visual charts and dashboards using SQL\nAbility to optimize SQL queries to run efficiently, with strong working knowledge of the language\nUnderstand how to meaningfully segment data, and run cohort analysis\nDeep knowledge of the various ways to present data visually, the pros and cons\nWork cross-functionally with our product, finance, marketing, and biz dev teams\nBring a critical eye and thought to how graphs and charts can drive impact to teams\nNice-to-have: Strong understanding of the Ethereum blockchain and related sidechains, their data structures, meta-data, and technical workings\nRequirements\nExpert knowledge of SQL\nDeep familiarity with at least one BI tool like Tableau, Looker, Sigma, etc.\nTechnical expertise with SQL optimization\nAn interest in Web3, and blockchain technologies\nExperience with a scripting language like Python or R\nWhy Horizon?\n\n\n·       A chance to deliver massive impact at a small and quickly growing company \n·       Competitive salary and equity package\n·       Accelerate your career by joining at the early stages\n·       Be part of defining Web3, the next generation of the Internet, and creating symbiotic economies where both users and creators share in the value generated by networks\n·       Work with an outstanding team made of wonderful people who have built and sold successful companies, launched amazing products, and have rich experience in infrastructure, architecture, blockchain, games, finance, investing, strategy, consulting, design, marketing, community, and more.\n·       Work life balance unlike the “crunch” culture you find at larger studios\n·       New PC, and generous allowance for work-from-home setup\n·       Health, dental, and vision benefits\n·       We’re conscious about mental health and have modern vacation policies\n·       We invest in everyone’s personal development and subsidize courses, books, and conferences, so you never stop learning\n·       Work on hard, big, meaningful problems that can shift markets\n·       Learn more about our values and the traits we embody at https://careers.horizon.io/\n\n\n\n\nWe are committed to diversity and encourage applicants from all backgrounds, genders and faiths. While we're building incredible products, we also want to add to our wonderful team and company. The best way to do that is to attract talented folks from all areas and to have their experiences inform their work.\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","analyst","data","science","ethereum","nft"]},{"job":"DeFi Analyst","company":"ICEO - Venture Builder","location":"Remote","post_date":"3mo","link":"https://web3.career/defi-analyst-iceo-venture-builder/34284","key":"34284","details":"About us\n\n\n\nNorion is a startup, built from scratch by the ICEO team. It is an innovative organization in which we help entrepreneurs enter the world of blockchain and Web3. As Norion, we believe that by providing the best blockchain solutions, we are able to improve the functioning of the economy and contribute to the success of many innovative projects.\n\nOur clients are companies from the traditional market and blockchain start-ups that want to create and publish their own token. We are known for providing individual tools for issuing and handling digital tokens. In addition to technology, we have ready-made legal solutions and access to investors and business angels, thanks to which we comprehensively support entrepreneurs and enable them to take their first steps in the world of Web3, DeFi and Metaverse.\n\nOur Consulting department is responsible for creating a tokenization strategy and designing tokenomy. It is made up of pioneers in the field of business consulting in the blockchain environment. Due to the growing interest in tokenization and the increasing number of orders, we are looking for another member of the Norion team!\n\nAbout a role\n\n\n\nWe are looking for a DeFi Analyst, a person who is deeply immersed in the topic of DeFi. By joining our team, you will work with enthusiasts and specialists in DeFi, NFT, and Blockchain. This is an opportunity to deepen your knowledge and see how completely new solutions are created on their basis and co-create ecosystems for innovative projects.\n\nFor us, nothing is impossible to \"tokenize\"! Therefore, if you have been passionate about cryptocurrencies for a long time, you understand the idea of ​​decentralization and would like to contribute to the great change that the world needs now - Norion is a place where you will find yourself perfectly!\n\nYour responsibilities will include:\n\n\ncreating and introducing the innovative market projects based on tokens,\ndesigning tokenomy for both clients and Norion's projects,\ndeveloping concepts related to innovations that can be adapted to tokens,\ndesigning ecosystems for the token,\ncreating a design for the innovative features and support in its implementation,\ncontrolling the token after its launch (including strategic consulting in development),\npreparing analyzes and calculations of introduced mechanisms with the use of a token,\nanalyzing competitive solutions, specific protocols, and ecosystems,\nbuilding a project development roadmap,\nparticipating in the process of Whitepaper creation and other strategic documents;\nparticipating in the internal crypto community:\nsharing & discussing news in an internal \"news channel\",\nsharing & discussing knowledge, and market solutions in an internal \"knowledge compendium\",\nconstant self-development in DeFi and crypto knowledge,\nstrategic consulting for existing crypto projects (clients),\ndeveloping a token operation model, its application, and usability,\ndefining problems on both the crypto market and the client-side, and solving them by developing solutions,\nbuilding a token entry strategy on the secondary market (CEX, DEX),\nperforming daily exploration of the cryptocurrency market,\nsearching for new products in this market and informing the team about it on the company's channel,\ntaking part in team meetings and creative work on innovative solutions for clients,\nconducting workshops with the client (different specialists from Norion will be available to help),\nconsulting on possible technical solutions and the method of blockchain operation with other members of the project team,\nconducting a verification of the possibility of implementing specific technical solutions for the development and product departments.\n\nWhat we expect from you:\n\n\nability to work in the European timezone\nminimum 1 year experience in one of the projects below is a must:\nlaunchpad (with understanding how to incubate startups);\ncrypto venture capital fund;\nDeFi service that provided earn service (strategies to provide interest rate on clients cryptocurrency holdings);\nCeFi service hat provided earn service (strategies to provide interest rate on clients cryptocurrency holdings);\nstrong attraction to self-development in the crypto, especially deep dive in DeFi,\nexperience in using multiple DeFi services:\nefficient use of blockchain environment (understanding cryptocurrency wallet - seed / private key / public, performing transactions, DEX operation, loan protocols, impermanent loss, gas war, interesting hacks and tricks),\ngood understanding of moving across different bridges,\nfluent navigation between different ecosystems,\nactive DeFi user - AMMs, MMs, Bridges and other protocols,\nyield farming experience:\nLPs,\nMining,\nMoneylegos,\nparticipation in the project that introduced tokenization,\nknowledge of at least one ecosystem at an advanced level (e.g. Ethereum [including Polygon, Binance Smart Chain], PolkaDot),\nability to seek information that provides solutions to most questions that arise in ecosystem building and tokenization,\ngood command of written and spoken English, to be able to:\nactively participate in Team and Client calls,\ncreate documents,\nsearch for information,\ndiligence in performing tasks, high level of organization.\n\nWelcome:\n\n\nknowledge of Jira and Confluence,\nexperience in working with Agile methodology.\n\nBenefits and perks:\n\n\n26 paid days off in case of B2B contract,\nthe possibility of employment on the basis of a permanent employment contract,\nMedicover Premium private medical care package,\nMultiSport Plus package,\nequipment - desktop computer / laptop, monitors and office accessories,\nfull-time employment,\nthe possibility of adjusting working hours,\nwork in remote mode or from our office in Krakow,\nthe opportunity to participate in an internal training program,\na career path that allows for continual advancement and reaching C-level position,\nparticipation in business and integration meetings.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","defi","remote"]},{"job":"Blockchain Lead","company":"Pay3","location":"India","post_date":"5d","link":"https://web3.career/blockchain-lead-pay3-1/39926","key":"39926","details":"About Pay3:\n\nAt Pay3, we are building instant payout infrastructure leveraging digital currency networks. Pay3 provides the operating layer for a plug and play digital currency payment solution to power payment providers across fiat and Web3. We are a well funded company looking to disrupt how payments are made globally.\nWith Pay3, you will get to build in the intersection of large scale distributed systems, fault tolerant robust payment systems and Web3/blockchain.\n\nWhat you’ll do:\n\nDesign, deploy, and run smart contracts in Solidity, Go or Rust\nArchitect systems; comfortable designing backend schemas, APIs, storage and retrieval layers\nCreate prototypes and proof-of-concepts for iterative development\nTake ownership of developing and releasing new features\nCollaborate with technical team members and interview new ones\nConstantly explore ways to improve our systems and drive implementation\n\nWhat makes you a great fit:\n\nBachelor’s degree in Computer Science or equivalent\n3 to 5 years of relevant experience at a tech, product-driven company with examples of shipping product expeditiously\n2 years of experience in blockchain technology and architectures (Ethereum, Solana, Cosmos, etc.)\nThrive in a 0 to 1 environment at an early stage startup\nCan be autonomous - you can juggle a lot of different things and manage your time well\nComfortable with ambiguity - startups are unpredictable\nDetail-oriented - you're known to think through every possible scenario\nFamiliarity with building distributed systems; Docker, Kubernetes\nExpertise in Node.js or Django\nHave a keen interest in Web 3.0, NFTs, and the role these technologies will play in the years to come\n\nPay3 focuses on Payments. Their company has offices in Bangalore Urban. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://pay3.money\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead","blockchain","solidity","solana","ethereum"]}]}