{"jobs":[{"job":"Global Business Operations Manager Binance Card Pay","company":"Binance","location":"Remote","post_date":"4d","link":"https://web3.career/global-business-operations-manager-binance-card-pay-binance/40023","key":"40023","details":"Global Business Operations Manager - Binance Card/Pay\nGlobal /\nOperations, Strategy & Project Management – Project Management /\nFull-time Onsite or Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\n\n\nResponsibilities :\nLead crypto card launches in new markets and end-to-end project management/implementation/expansion through close collaboration with internal and external stakeholders\nNegotiate and manage contracting efforts with partners \nCo-develop and execute card lifecycle management and GTM strategies\nManage external partner relationships and business plans (e.g. processors, bin sponsors, card networks) to drive project success\nIdentify opportunities to increase operational efficiency and work with internal/external stakeholders to solutionize and improvise business operations implementation\nDrive business assessment and project management for new strategic card/pay projects\nAccount manage and provide operational support to Binance Pay customers (PSPs, payment gateways, merchants) on pre/post implementation initiatives (onboarding, marketing campaigns, expansion plans, troubleshooting etc.)\nWork with internal and external stakeholders to identify and implement solutions to improve customers’ experience\nManage OKRs/KPIs, success metrics and performance tracking across projects to optimize success\nRequirements:\nMinimum 7 years of payments or fintech experience\nExperience in at least one or a combination of project management, account management, strategy and business operations roles\nGood knowledge of the card payment industry\nGood knowledge in merchant operations and account management\nSelf-starter, problem solver, results-oriented and able to execute fast\nDemonstrated ability to work as a team player, strong interpersonal skills\nEffective communicator to engage with external and internal stakeholders\nCritical thinking and analytical skills to generate insights with data\nFluent in English; Good command of Chinese will be considered as an asset\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["operations","remote"]},{"job":"Editor Consensus Magazine","company":"CoinDesk","location":"New York","post_date":"4d","link":"https://web3.career/editor-consensus-magazine-coindesk/40020","key":"40020","details":"CoinDesk is the leading digital media, events, data and research company in this rapidly growing blockchain and digital asset world. We are driven by the mission to be the media platform for the next generation of global investors\n\nThe team of subject matter experts at CoinDesk delivers reliable and relevant content to both individuals and businesses, enabling them to make impactful decisions and stay current on this evolving industry.\n\nCoinDesk is a quickly growing company with incredible ambition. Our global presence has grown exponentially through top quality journalism and event production, creating a community for millions of members. We are all excited to continue on this journey and take pride in the opportunity we have to make a long lasting impact. We’d love for you to join us if you’re willing to take on new challenges and immerse yourself in a world of intelligent, forward thinking people.\n\nABOUT THE ROLE\n\nWe are seeking an entrepreneurial editor to push forward CoinDesk’s Consensus Magazine. The candidate will have at least three years experience as a reporter/ editor, with a background in crypto media or a related financial/business topic.\n\nShe/he has a proven ability to think creatively about modern media, working across departments including editorial, marketing, social media and administration. She/he will be proactive about developing stories, sources and writers, both for features and opinion pieces. She/he must have an interest in the commercial side of the media, understanding that journalism is both a public service and a business.\n\nThis individual will report directly to Ben Schiller, head of Consensus Magazine at CoinDesk.\n\nThe ideal candidate is ambitious, a good communicator, collaborative and ready to roll up their sleeves as CoinDesk continues to scale.\n\nRESPONSIBILITIES\n\nManage the workflow of op-eds both for the daily Opinion section and for theme weeks, staying on top of emails with contributors and keeping the Airtable updated at all times; hiring, pitching and managing contributors.\nDevelop relationships with writers inside and outside CoinDesk particularly for Magazine “theme weeks” and during peak news periods (e.g. when a story like the fall of FTX breaks) when we need additional commentary.\nManage projects independently: eg a new newsletter or new format type.\nPitch new ideas and work cross-functionally to collaborate with podcasts/events/CDTV to develop innovative story ideas that have broad appeal.\nBuild brand awareness by working through other news outlets, bringing in citations that establish CoinDesk as an authority on the crypto industry and the future of money.\nWork collaboratively across CoinDesk, understanding that success is a team sport requiring input from across CoinDesk departments: events, news, marketing, PR, CDTV, audience development, analytics, and so on.\n\nABOUT YOU\n\nMust have at least three years journalism experience at a recognized and professional institution, preferably in business, finance or tech.\nMust be organized, hard-working, detail-oriented and enthusiastic about working in crypto media and for CoinDesk.\nMust have the ability to develop sources and helpful relationships across the blockchain/crypto industry and beyond.\nMust have the ability to develop storylines and angles, and to handle projects independently of senior management supervision.\nPossesses a pithy, conversational writing >\nAbility to edit the work of CoinDesk staff, so the content is factually sound while easy to digest.\nRemote candidates are considered but they must be prepared to work collaboratively, communicate fully, and make an effort to build relationships across the company. They should be prepared to work New York hours starting at 9 a.m. daily or earlier.\n\n~~\n\nIn compliance with the New York City salary transparency requirements, the potential salary for this position is from $85,000.00 to $100,000.00. This range is not inclusive of any potential bonus amounts. Factors that may impact the agreed upon base salary for a particular candidate include years of experience, skill set, and other external factors.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":[""]},{"job":"Founding Engineer","company":"Spirals","location":"San Francisco","post_date":"4d","link":"https://web3.career/founding-engineer-spirals/40019","key":"40019","details":"Full-stack + product-mindedness 🪄\n- Experience with smart contract / Solidity (optional) 🦄\n- But nothing else matters more than finding someone who is hungry, curious and willing to go the extra mile. If that describes you and you'd like to work alongside others like that on a big problem, reach out!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity"]},{"job":"Data Scientist Intern Risk Management","company":"Binance","location":"Asia","post_date":"4d","link":"https://web3.career/data-scientist-intern-risk-management-binance/40018","key":"40018","details":"Data Scientist Intern (Risk Management)\nAsia /\nInternships – Internships /\nIntern\n/ Hybrid\n\nApply for this job\nData driven based business is the core in helping  to use cloud native platform to serve tens of millions of crypto-currency users. Engineers and Data Scientists across the company use the data platform to do interesting and impactful analysis for continuous innovations.\n\n\nAs a data scientist, you will have the opportunity to leverage rich data (PB-level scalability) and state-of-art machine learning infrastructure to develop data products which are used by our tens of millions of crypto-currency users.\n\n\nYou will collaborate with a strong team of engineers, data analysts, business operation and product/marketing managers to define and build solutions, features, algorithms and products based off our rich data and cutting-edge machine learning technology.\nResponsibilities:\nLeverage of our PB-scale data warehouse to perform in-depth analysis to build personalized services and provide abnormal user automated recognitionDigital data asset\nObtain the blockchain based data to perform chain-based data analysis, prediction and recommendations\nData driven customer feedback and satisfaction analysis: leverage of machine learning techniques to understand customer’s feedback and satisfaction with proven data evidence and analysis\nRequirements:\nProject experience with developing machine learning models at scale,\nDeep understanding of modern machine learning techniques and mathematical underpinning, such as classifications, recommendation systems, optimization and etc.\nGood experience with processing large size data is preferred\nGood experience with Python, Java and/or Scala is preferred\nMaster’s or above is preferred \nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["scientist","data","science","intern","entry","level","scala"]},{"job":"Product Lead Big Data","company":"Binance","location":"Remote","post_date":"4d","link":"https://web3.career/product-lead-big-data-binance/40015","key":"40015","details":"Product Lead (Big Data)\nGlobal /\nProduct & Design – Product /\nFull-time: Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nBinance has an exciting role as part of our Big Data team. We're looking for a Product Lead to manage a team of consolidated PM's in a new, centralised Product team.\n \nThis role will contribute to developing new product offerings across internal and customer facing products across Web/App. You'll be managing a team of 9 PM's and the various products they work on.\n\n\nWe are looking for a strategic and hands-on Product Management Lead with FinTech or Blockchain experience.\nResponsibilities:\nResponsible for the App or Web product experience.\nConduct competitor analysis, learn from the market and differentiate from competitors.\nCollect and analyze feedback from customers, stakeholders and other teams, consolidate them into requirements, features and end productsProduce and review product requirements documents (PRD).\nEnsure products and releases are launched correctly and on schedule.\nTrack and push development and testing progress.\nTrack and analyze key user metrics in order to form feedback loop to improve our products and services.\nRequirements:\nMinimum 8 years of proven experience as an App or Web Product Manager.\nBlockchain, Fintech experience is a plus. \nExperience in global facing products is preferred.\nExperience in internationally renowned Internet companies, or experience in product development for large Internet platform products are great bonus.\nExperience in product lifecycle management, preferably in agile framework.\nExcellent communication skills, Mandarin is nice to have.\nExcellent English listening, speaking, reading and writing skills.\nGood skills in PRD.\nData driven experience is a plus.\nProblem-solving aptitude.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["big","data","lead","remote"]},{"job":"Senior Product Manager Trading","company":"Binance","location":"Asia","post_date":"4d","link":"https://web3.career/senior-product-manager-trading-binance/40014","key":"40014","details":"Senior Product Manager, Trading\nAsia /\nProduct & Design – Product /\nFull-time Onsite or Remote\n/ Hybrid\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nOur Finance Product Group leads the design of all the products on Binance's derivatives trading exchange, including spot trading, spot margin, futures, leveraged tokens, trading options etc.\n\n\nYou’ll transform ideas into strategy and product features, following agile development practices to deliver the final product from start to finish. To succeed in this role, you should be a data driven, creative leader and problem-solver with a passion for the crypto industry.\nResponsibilities:\nResponsible for core derivative trading product management, specifically spot margin\nCreate and maintain product roadmaps, feature backlogs and product documentation such PRDs, user stories, use cases, user flows, logic flows, and functional specifications\nPrioritise development activities with engineering teams, assist in determining the best technical implementation methods, work closely with QA on acceptance testing and lead product launches\nConduct market research and competitor analysis to deliver best-in-class trading solutions and products\nManage cross-functional and cross-department communication and coordination to ensure product quality and progress, and completion of product milestones\nRequirements:\nMinimum 5 years of proven experience as a product manager coupled with a good understanding of financial trading systems\nSound knowledge on financial products (especially on margin and futures product) and trading experience\nQuick learner, can pick up new concepts quickly\nHigh degree of initiative to work collaboratively across the team and independently\nFamiliarity with Agile workflow and ability to work within an Agile environment\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","senior"]},{"job":"Solidity Smart Contract Engineer","company":"illiquid","location":"Lisbon","post_date":"4d","link":"https://web3.career/solidity-smart-contract-engineer-illiquid/40013","key":"40013","details":"illiquid.xyz is looking for an Ethereum Solidity Developer to help us build our NFT discovery engine, beta version launched Q4 2022. The product aggregates millions of NFTs from over 125,000 creators, minted and traded on 15+ marketplaces across 3 blockchains.\n\nKnowledge and experience developing Solidity smart contracts and deploying them on Ethereum mainnet is required. Familiarity with specific Non Fungible Token standards like ERC721, ERC1155 is a plus.\n\nYou will be working in a team of 4 technical members, who will support you on all aspects of the product learning curve. The startup team is currently less than 10 people total, and the founders have 5+ years of experience building different companies and products in the Ethereum ecosystem.\n\nPlease reach out to jobs@illiquid.xyz if you’re interested or have any questions - thank you!\n\nilliquid focuses on Blockchain / Cryptocurrency. Their company has offices in Lisbon and Madrid. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://illiquid.xyz or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","solidity","ethereum","nft"]},{"job":"Senior Software Engineer C++ Cryptocurrency Trading London","company":"GSR","location":"London","post_date":"4d","link":"https://web3.career/senior-software-engineer-c-cryptocurrency-trading-london-gsr/40012","key":"40012","details":"Senior Software Engineer (C++) - Cryptocurrency Trading - London\nMayfair, Greater London /\nEngineering – Software Engineering /\nFull time\n/ Hybrid\n\nApply for this job\nAbout us:\nFounded in 2013, GSR is a crypto market maker with more than 300 employees in 5 countries. We provide billions of dollars of liquidity to cryptocurrency protocols and exchanges on a daily basis. We build long-term relationships with cryptocurrency communities and traditional investors by offering exceptional service, expertise and trading capabilities tailored to their specific needs.\n\n\nGSR works with token issuers, traders, investors, miners, and more than 60 cryptocurrency exchanges around the world. In volatile markets we are a trusted partner to crypto native builders and to those exploring the industry for the first time. \n\n\nOur team of veteran finance and technology executives from Goldman Sachs, Two Sigma, Citadel, and Tower Research among others, has developed one of the world’s fastest and most robust trading platforms designed to navigate issues unique to the digital asset markets. We have continuously improved our technology throughout our history, allowing for our clients to scale and execute their strategies with the highest level of efficiency.\n\n\nWorking at GSR is an opportunity to be deeply embedded in every major sector of the cryptocurrency ecosystem.\n\n\nYou will help shape and build the cutting-edge tools used for real-time programmatic trading including market making, risk management and proprietary trading strategies.\n\n\nOur Software Engineers are involved in everything from product development to production support and work closely with the business teams to develop the firm’s service offering.\nAs part of the team, your responsibilities will be:\nEnhance our strategy/execution framework, used by quant researchers and traders.\nImprove and support our simulation framework to allow fast backtest and strategy prototyping.\nSupport and enhance our risk/quant library, with an eye on performance improvement.\nDesign, build, test and enhance our in-house trading software.\nDeveloping new Greenfield products.\nWork with the development team to build applications for the cryptocurrency trading platform with ultra low latency. \nDeliver high-quality code and technical documentation.\nSupport and deliver multiple releases in production each day.\nWork to ensure high performance, security, and scalability of the trading applications.\nParticipate in product design, implementation, and quality assurance.\nProvide ad-hoc technical support to the trading, business development, and operational teams.\n\n\nYour profile:\nSignificant experience of C++ programming within a front office trading environment.\nStrong programming skills: C++ 17/20, Python.\nExperience of databases (MySQL, Mongo, Influx, etc.).\nExperience with AWS or Google Cloud.\nExperience of Linux, Docker a plus.\nExperience of a DevOps environment.\nExperience in web application technologies (React JS, etc.) a plus.\nBachelor’s degree in Computer Science or related field.\nStrong interest in the cryptocurrency market.\nExperience in the financial services industry, specialising in e-Trading / High Frequency Trading / Derivatives Trading support. \nWhat we offer: \nA collaborative and transparent company culture founded on Integrity, Innovation and Performance.  Competitive Salary with two discretionary bonus’ payments a year. Benefits include Healthcare, Dental, Vision, Retirement Planning, 30 days holiday and free lunches when in the office. \n\n\nHybrid working pattern in all of our offices from London, New York, Singapore, Zug and Malaga.\nRegular Town Halls and off-sites, team lunches and drinks. \n\n\nComprehensive Corporate and Social Responsibility programs including matching charity fundraising and volunteer days.   \n\n\nGSR is proudly an Equal Employment Opportunity employer. We do not discriminate based upon any applicable legally protected characteristics such as race, religion, colour, country of origin, sexual orientation, gender, gender identity, gender expression or age. We operate a meritocracy, all aspects of people engagement from the decision to hire or promote as well as our performance management process will be based on the business needs and individual merit, competence in the role.\n\n\nLearn more about us at www.gsr.io.\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["c","c","plus","plus","dev","senior","crypto"]},{"job":"Senior Golang Engineer APAC","company":"Zero Hash","location":"Australia","post_date":"3mo","link":"https://web3.career/senior-golang-engineer-apac-zero-hash/34337","key":"34337","details":"**About the Role**\nZero Hash is looking for a Senior Software Engineer to help architect and build new features, as well as scaling the gateway to Finance 2.0. We are a high performing team looking for an equally ambitious and driven teammate.\n\n\nThe right candidate for this position is detail oriented, deeply technical, and driven. You are eager to learn new technologies and complex systems. You build resiliency and scalability into the platform at every step.\n\n\nIf you're looking to have a massive impact in a high-growth startup in one of the most exciting markets in decades, you will find this role challenging and rewarding in equal measure.\n\n\nThis fully remote role is open to candidates in any APAC timezone.\n\n\n#LI-Remote\n\n\n**Responsibilities**\n* Support the company’s vital business by contributing to the design and  \n  development of software in an event-driven microservices environment\n* Develop microservices in Golang and Python\n* Work with platform engineers to setup new services\n* Respond to production issues and alerts\n* When necessary, communicate directly with client technical teams\n\n\n**Requirements**\n* 5+ years of experience, preferably in the FinTech space\n* A humble and scrappy get-it-done mindset; you’re resourceful and in your     \n  element going from 0 to 1\n* Excellent problem solving skills - can troubleshoot complex systems\n* Deep Proficiency with at least one of Python and Golang and experience with  \n  the other.\n* Understanding of SQL and database schema design\n* Comfort with ambiguity; the ability to independently lay out and test clear  \n  hypotheses and solve problems without well-defined direction\n* Excellent verbal and written communication skills\n\n\n**Preferred**\n* Bachelors in computer science or equivalent experience\n* Experience with the SciPy stack, specifically Pandas\n* Experience at a banking-as-a-service, brokerage-as a service, payment-as-a-   service business\n* An understanding around financial services reconciliation tools\n* Experience with digital assets\n* Experience with yield-generating products\n\n\n**Benefits Offered**\nWe believe that the best way to succeed is by having a happy, motivated and healthy team. We offer the following benefits:\n\n\n* Healthcare Insurance: Zero Hash covers roughly 100% of employee premiums as well as a portion of spouse/children\n* Vision & Dental Insurance\n* Mental Health and Wellness Program\n* Work equipment\n* Equity Ownership and Early Exercise\n* Maternity & Paternity Leave\n* Educational budget of $1000\n* WFH stipend of $500\n* WeWork All Access Membership\n* Visa Sponsorship\n* 401k\n\n\n**About Zero Hash**\nZero Hash is a B2B embedded infrastructure platform that allows any platform to integrate digital assets natively into their own customer experience quickly and easily (a matter of API endpoints). We power neo-banks, broker-dealers, and payment groups to offer digital asset trading and custody, crypto-backed rewards and round-ups programs as well as yield through staking and DeFi and NFTs.\n\n\nOur thesis is very simple: every financial services firm will offer digital assets within the next 2 years and will do so through platforms such as Zero Hash. Zero Hash is defining the new FinTech vertical of digital-assets-as-a-service.\n\n\nClients include MoneyLion, Wirex, Deserve, MoonPay, Tastytrade. Backed by Point72 Ventures, NYCA, Bain Capital, Tastytrade.\n\n\n**The Zero Hash Culture**\nAll Zero Hash employees are guided by the following characteristics and core principles:\n\n\n* Independence/Ownership - An ability to work autonomously. Join Zero Hash, pitch ideas, and shape the work you do.\n* Passion - We are innovating quickly and challenging the status quo. We want you to think big, be creative and ​make a difference every day.\n* Collaborative - A good attitude and respect for others. We’re teammates, not co-workers. Everything we do is a shared success and equally a shared failure - we talk in terms of “we” not “me”.\n* Initiative - An ability and passion for learning and asking questions. We will champion you, challenge you and push you to achieve your best - and we expect you to do the same.\n* Empathy - An ability to listen, respect, and understand your co-workers, customers, and everyone you interact with no matter how different they are to you.\n* Adaptability - An ability to respond quickly. We are in a fast-paced industry and so we expect you to be creative when solving a new problem and comfortable under pressure.\n* Transparency - We believe that transparency is critical to empowering everyone to make the best decisions, both the company to its people and vice versa.\n* Integrity - Integrity creates trust. As both an organization collectively and as individuals, it is our most valuable asset.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","golang","senior"]},{"job":"Director of Marketing MetaJuice Crypto Web3","company":"Together Labs","location":"United States","post_date":"4d","link":"https://web3.career/director-of-marketing-metajuice-crypto-web3-togetherlabs/40007","key":"40007","details":"Director Marketing, MetaJuice (Crypto/Web3)\n\nMetaJuice is building blockchain-driven assets that unlock the value of the metaverse where everyone can create, earn, own and shape the future. We are looking for a director of marketing to oversee the brand, community, social and PR around MetaJuice.\n\nWe are looking for an experienced, high-level Director of Marketing to manage all marketing efforts to support the brand and core products in the market. This person must have a deep understanding of marketing - ideally in the technology, gaming and/or blockchain industries - to deploy best practices and the most effective marketing and content campaigns. This role will be charged with leading marketing programs that increase awareness among key targets and drive interest, brand and enterprise value.\n\nResponsibilities\n\n\nLead and oversee the day-to-day execution of marketing programs, strategies and multi-channel digital marketing execution\nOrganize podcasts, blog posts, conferences, positioning, messaging, digital advertising, market research, naming, identity, content development, website, collateral\nDrive out deliverables from the team and extended marketing team\nCollaborate with product managers, commercial leads, and the broader marketing team to execute effective go-to-market plans and craft persuasive materials\nBe an expert by researching industry trends, staying up to date on regulatory matters, and continually exploring ways to enhance industry knowledge and expertise\nConduct competitive analysis to understand industry trends, curate competitive intel, and develop and share key insights\nDevelop presentations and training materials to corporate development and brand presentations\nProvide direct PR oversight and direction internally and with agencies\nPartner with external vendors and creative agencies to develop ad assets, landing pages, email copy, etc. for content syndication and demand gen programs\nCreate compelling content for social and community forums\n\nRequirements\n\n8+ years of Director-level marketing experience\nStrong analytical skills and business acumen\nExperience leading marketing growth strategies\nDemonstrates a strong understanding of social media, social media platforms, search, digital marketing and metrics.\nExperience analyzing and optimizing marketing programs and growth initiatives\nSelf-starter\nAbility to manage multiple priorities effectively.\nAdept at working cross-functionally to meet aggressive deadlines while maintaining professionalism and poise.\nStrong presence with senior executives and exceptional verbal and written communication skills\nExperience in software and technology, gaming and crypto is a plus.\n\nAbout Us\n\nMetaJuice (www.MetaJuice.com) builds blockchain-driven assets that unlock the value of the metaverse where users can create, earn, own and shape the future. Through meta tokens such as VCORE and VCOIN, and NFTs, MetaJuice will realize its vision; creating a world where everyone can participate and share in its success. MetaJuice is the blockchain subsidiary of Together Labs.\n\nTogether Labs innovates technologies that empower people worldwide to connect, create and earn in virtual worlds. Our mission is to redefine social media as a catalyst for authentic human connection through the development of a family of products grounded in this core value. These include: IMVU, the world's largest friendship discovery and social platform; VCOIN, the first regulatory-approved transferable digital currency; and WithMe, an upcoming mobile platform built on insights from the science of friendship. For more information, please visit https://togetherlabs.com/\n\nFounded in 2004 and based in the heart of Silicon Valley, Together Labs is led by a team that's dedicated to pioneering in virtual worlds. Together Labs is backed by venture investors Menlo Ventures, Allegis Capital, Bridgescale Partners and Best Buy Capital.\n\nTogether Labs (formerly IMVU) has been for nine years running as Best Place to Work in the Silicon Valley.\n\nHow To Apply\n\nPlease familiarize yourself with our products and feel free to try out our core product at https://www.imvu.com/\n\nTogether Labs is an equal opportunity employer, and is committed to fostering a culture of inclusion. Our unique differences enable us to learn, collaborate, and grow together. We welcome all applicants without regard to race, color, religious creed, sex, national origin, citizenship status, age, physical or mental disability, sexual orientation, gender identification, marital, parental, veteran or military status, unfavorable military discharge, or any other status protected by applicable federal, state, or local law.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","marketing","non-tech","crypto"]},{"job":"Associate Analyst Attribution1","company":"Mastercard","location":"United States","post_date":"4d","link":"https://web3.career/associate-analyst-attribution-1-mastercard/40005","key":"40005","details":"Our Purpose\n\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\n\nJob Title\n\nAssociate Analyst, Attribution-1\n\nOur Purpose\n\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion (https://www.mastercard.us/en-us/vision/who-we-are/diversity-inclusion.html) for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\n\nWho is Mastercard?\n\nMastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential.\n\nOur decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.\n\nCipherTrace, a Mastercard company, is a rapidly growing cryptocurrency intelligence and compliance leader. Our team has introduced novel solutions to challenges including sanctions compliance for DeFi and the Crypto Travel Rule. Our mission is to grow the blockchain economy by making crypto safe for users and trusted by governments. CipherTrace operates on a global scale to assist banks, cryptocurrency exchanges, law enforcement agencies, regulators, VASPs, and businesses in preventing fraud, human trafficking, money laundering, and other illicit activity where cryptocurrency is involved.\n\nOverview\n\nAs part of the Mastercard Multi-Rail Trust & Security Team, we curate and deliver high quality data to a multitude of products. This allows our customers to perform data-driven decision making related to assessing the risk of virtual asset service providers.\n\nJob Title\n\nAssociate Analyst, Attribution\n\nRole\n\n\nResponsible for managing and documenting cryptocurrency transactional data\nResearch into cryptocurrency fees associated with transactional data\nAttributing and documenting coins and tokens associated with virtual asset service providers and known cryptocurrency exchanges\nCurating data essential to product commitments on cryptocurrency virtual asset service providers\nDocumenting supporting sources & evidentiary findings for data collection\nResponsible for detailed research and documentation on assigned virtual asset service providers and known cryptocurrency organizations\nResponsible for implementing research findings on virtual asset service providers and known cryptocurrency organizations into clear, concise and professionally formatted written communications\nResponsible for procuring data for reports to reveal insights & patterns\nPerforming tasks inside of Jira to ensure customers receive timely requests\nContribute to a high-level performing team to achieve & deliver product SLA’s and expectations.\n\n\nAll About You\n\nExcellent communication skills, verbal & written\nStrong organizational skills\nAbility to work effectively as an individual and in a team environment\nAbility to meet company attendance & dependability guidelines\nBasic knowledge of blockchain technology & ecosystem\nBasic knowledge of Excel and/or experience working with spreadsheets\nHighly detail-oriented and excel at spotting patterns and solving problems\nExperience in providing real-time analysis of cryptocurrency stakeholders & trends\nExperience or understanding with cryptocurrency transactional process\nAbility to present research findings in clear & concise manners\nAbility to accept and give candid feedback\nExperience in contributing to research and or efforts\nAbility to think strategically, with a creative mindset to solve complex problems\nEnthusiasm and ability to thrive in an atmosphere of constant changeIn the US, Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\n\n\nCorporate Security Responsibility\n\nResponsibilities\n\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must\n\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst"]},{"job":"Trading and Treasury Manager","company":"Coins.ph","location":"Manila","post_date":"4d","link":"https://web3.career/trading-and-treasury-manager-coins/40004","key":"40004","details":"Trading and Treasury Manager\nManila /\nOperations – Exchange Operations /\nFull-time Employee\n/ Hybrid\n\nApply for this job\nAt Coins.ph, we are driven by our vision of a world where everyone has access to financial services. We place great value on open communication, work ownership, and continuous learning on the job.We are a fast-growing startup looking to work with passionate, motivated professionals in improving our products and accelerating financial inclusion in Southeast Asia through blockchain technology.\n\n\nWho You Are\nAs a Trading and Treasury Manager, you will be one of the key people responsible for Coins.ph’s crypto wallet infrastructure, trading, and treasury management systems that are responsible for customer liquidity and digital currency trading.\n\n\nIn your role, you will have oversight over our customers’ cryptocurrency wallets as well as trading activities, working with our engineers and technology providers to ensure the best possible experience for our customers and that their funds are kept safe.\n\n\nYou will be responsible for managing as well as proposing a variety of automated systems to maximize security, capital efficiency, and revenue in the company’s day-to-day operations. The results from your efforts will directly impact both the security as well as the bottom line of the company.\n\n\nYou should be comfortable with handling and thinking strategically about complex and interconnected wallet/payment systems from first-principles, leveraging your deep background in cryptocurrency technologies to make decisions that optimize many often competing priorities.\nYou have a knack for moving quickly while still paying attention to details. You should be able to leverage data analytics to drive key strategic decisions and rapidly iterate on ideas alongside other members of our trading, finance, and engineering teams.  \nCore Responsibilities\nCryptocurrency Wallets\nAdministration and management of Coins’ crypto wallet systems, including hot, warm, and cold wallets\nManagement of Coins’ crypto audit systems\nCollaboration with Coins’ security team on best practices for safeguarding Coins’ crypto assets\nIdentify system inefficiencies and lead projects to improve robustness and performance\n\n\n\nCryptocurrency Treasury Management\nBuild out forecasting and crypto balance management processes; identify business drivers around working capital usage with a focus on improving efficiencies.\nIdentify opportunities for process improvement and automation in liquidity management policies, procedures, and controls\nPrepare and analyze daily crypto positions, ensuring adequate liquidity is available to meet financial obligations for our customers\nEnsure Coins’ customer cryptocurrency payment activities are fulfilled without service disruptions \n\n\nCryptocurrency Trading\nOversight and management of Coins’ crypto trading platforms\nWorking closely with Coins’ engineering team, business partners, and service providers to drive product development of Coins’ trading systems\nHelp to design and operate fully automated systems to support trading as well as manage our firm’s digital currency exposures and liquidity across multiple exchanges, countries, and currencies\nFull responsibility for revenues and costs associated with Coins’ customer trading activities\nLeverage trading metrics to identify inefficiencies and opportunities to increase profitability and performance\nEvaluate, structure, and execute digital currency transactions, including financing and hedging strategies\nJob Requirements\n4+ years of experience working in the crypto space, with a strong understanding of the underlying technologies behind the largest cryptocurrencies\n4+ years in Capital Markets, Corporate Finance, Treasury management, or similar areas preferred\nExcellent analytical, mathematical and financial skills, with strong attention to detail\nYou’re biased toward action, are a great collaborator and are able to distill complex plans into clear and actionable tasks\nAbility to excel in a fast-paced, highly analytical environment where multi-tasking and short timelines are met with consistent ability to achieve results\nAble to perform under pressure when required\nExtremely comfortable with data and can harness it effectively to generate insights on your own. You know how to leverage data to make decisions and drive improvements\nYou’re able to roll up your sleeves and do whatever it takes to get the task at hand done\nYou have true passion for Coins.ph’s mission for financial inclusion across Southeast Asia\n\n\nAdditional skills below will be a plus\n\nExperience in working in automated trading and/or risk trading environment\nExperience with SQL, R, or equivalent\nAbility to code in any language\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["finance"]},{"job":"Web3 Backend Developer","company":"Trikon Ecosystem","location":"India","post_date":"4d","link":"https://web3.career/web3-backend-developer-trikon-ecosystem/40003","key":"40003","details":"As a Back-end Developer, you will design and develop backend applications i.e. the database server, server-side applications as well as back-end system architecture. You will be working on the web as well as mobile applications. You should have expertise in REST API development and database management.\n\nTo succeed in this job role, you should possess excellent communication skills. You should also have the ability to keep a close eye on details. You should be able to manage multiple projects simultaneously.\n\nResponsibilities\n\nDesign, create and deploy secure, scalable, and sustainable backend services.\nParticipate in code and design reviews to maintain our high development standards\nConduct performance tuning and optimization\nDeveloping back-end website applications.\nCreating servers and databases for functionality.\nEnsuring responsiveness of Website.\nEstablish logging, monitoring, analytics, and telemetry frameworks for the team.\nWorking alongside graphic designers for web design features.\nSeeing through a project from conception to finished product.\nDesigning and developing APIs.\nMeeting both technical and consumer needs.\nStaying abreast of developments in web applications. Identify opportunities to improve existing practices.\n\n*Requirements *\n\nBachelor's degree in computer science or related technical field.\nMinimum 2+ years of experience as a Back-end Engineer\nExperience with NodeJS, DSA, And API building.\nSelf-driven with the ability to deliver results within deadlines.\nTeam player\nPassionate and up-to-date on the rapidly changing world of blockchain technology\nStrong organizational and project management skills.\nAttention to detail.\nGood communication skills\nGood time management abilities.\nStrong decision-making skills\nExperience with blockchain technology (Good to have).\n\nTrikon Ecosystem focuses on Online Gaming, Blockchain / Cryptocurrency, and Web3. Their company has offices in India. They have a small team that's between 11-50 employees. To date, Trikon Ecosystem has raised $1.5M of funding; their latest round was closed on July 2022 at a valuation of $4.5M.\n\nYou can view their website at https://trikon.io or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev"]},{"job":"Data Analyst Community and Blockchain Data Sourcing","company":"Binance","location":"South East Asia","post_date":"4d","link":"https://web3.career/data-analyst-community-and-blockchain-data-sourcing-binance/40002","key":"40002","details":"Data Analyst (Community and Blockchain Data Sourcing)\nSouth East Asia /\nOperations, Strategy & Project Management – Operations /\nFull-time Onsite or Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nResponsibilities\nSourcing, ingestion and analysis of blockchain ecosystem data (on-chain as well as off-chain data metrics) and liaising with relevant internal and external for the same\nAnalytics for community, developer relations, marketing and campaigns from sources such as Twitter, Discord, Telegram, Similarweb as well as other social / community / marketing related platforms\nIdentifying new data sources for analysis of dapps and emerging sectors (e.g. social, metaverse)\nIdentifying new data sources to benchmark BNB chain against upcoming competitor chains\nLiaising with big data team to execute the extraction of new data sources and building data pipelines (ETL, visualisation) for final consumption \nLiaising with external data platforms to ensure representation and accuracy of BNB chain metrics\nRequirements\nFamiliarity with blockchain ecosystem - top chains, general understanding of functional domains (DeFi, Gaming, NFT, SocialFi) - preferred experience with on-chain data platforms\nProficient in data engineering, modeling and ETL - preferred experience with data sourcing and working with APIs\n2-5 experience with data engineering, business analytics, insight generation and visualisation\nExperience with typical toolkits: SQL, Python, rest/post APIs, Twitter API plus data visualisation tools such as Tableau\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","community","manager","non-tech","data","science","blockchain"]},{"job":"Software Engineer — Backend","company":"Gemini","location":"United States","post_date":"4d","link":"https://web3.career/software-engineer-backend-gemini/40000","key":"40000","details":"Empower the Individual Through Crypto\n\nGemini is a crypto exchange and custodian that allows customers to buy, sell, store, and earn more than 30 cryptocurrencies like bitcoin, bitcoin cash, ether, litecoin, and Zcash. Gemini is a New York trust company that is subject to the capital reserve requirements, cybersecurity requirements, and banking compliance standards set forth by the New York State Department of Financial Services and the New York Banking Law. Gemini was founded in 2014 by twin brothers Cameron and Tyler Winklevoss to empower the individual through crypto.\n\nCrypto is about giving you greater choice, independence, and opportunity. We are here to help you on your journey. We build crypto products that are simple, elegant, and secure. Whether you are an individual or an institution, we want to help you buy, sell, and store your bitcoin and cryptocurrency. Crypto is not just a technology, it's a movement.\n\nSummary:\n\nAs a backend engineer on the Growth & Onboarding team, you’ll architect and solve complex problems that will directly influence the direction of the digital asset space. We have a strong culture of code reviews, and a focus on security and identity verification, with the end goal of writing and shipping high-quality code by getting things right the first time. We want to continue building the best product we can as we scale and grow our business.\n\nResponsibilities:\n\nDevelop new products and product features on the Gemini platform, as part of a tight knit team of eight to ten developers.\nWrite and maintain automated tests to ensure the operation and correctness of new product features.\nProvide technical input and knowledge to the planning, design, and requirements process for new products and features.\nReview other software engineers’ code for correctness, >\nImprove the performance, maintainability, and operations of the Gemini code base by engaging in occasional refactoring and upgrade projects.\nSupport your team’s production software by responding to an occasional alert or bug report.\n\nQualifications:\n\nAt least 3-4 years of software engineering experience.\nAdvanced proficiency in at least one language. We use mostly Scala and C++ on our backend and Typescript on the frontend – it’s great if you’re comfortable in those or if you’re willing to learn.\nThe ability to work closely across teams and manage dependencies.\nA customer- and product-focused mindset, with the ability to make well-reasoned tradeoffs between speed and quality.\nThe ability to adapt and handle multiple competing priorities in collaboration with peers.\n\nPreferred Qualifications:\n\nExperience working with or being a power user of Bitcoin, Ethereum, and/or blockchain technology\nWork experience or knowledge of the finance industry, payments, trading and/or exchange systems\n\nIt Pays to Work Here\n\nWe take a holistic approach to compensation at Gemini, which includes:\n\nCompetitive Compensation and Profit-Sharing Equity\nFlexible vacation policy\nRetirement Plan Matching\nGenerous Parental leave\nComprehensive health plans\nTraining and professional development\n\nSalary Range: In compliance with Colorado's Equal Pay for Equal Work Act and the New York City Pay Transparency Law, the base salary range for this role is between $137,000 - $171,000 in Colorado and $152,000 - $213,000 in New York City. This range is not inclusive of our discretionary bonus or equity package. When determining a candidate’s compensation, we consider a number of factors including skillset, experience, job scope, and current market data.\n\nAt Gemini, we strive to build diverse teams that reflect the people we want to empower through our products, and we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. Equal Opportunity is the Law, and Gemini is proud to be an equal opportunity workplace. If you have a specific need that requires accommodation, please let a member of the People Team know.\n\n#LI-\n\nGemini focuses on Financial Services, Virtual Currency, Bitcoin, and Cryptocurrency. Their company has offices in New York City and New York. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://gemini.com/ or find them on Twitter, Facebook, LinkedIn, and Product Hunt.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","ethereum","scala"]},{"job":"Blockchain Developer Employee or Contractor","company":"IESF AG","location":"","post_date":"4d","link":"https://web3.career/blockchain-developer-employee-or-contractor-iesfgroup/39997","key":"39997","details":"Our client is one of the stable international blockchain companies, with its own relational blockchain platform.\n\nSo far, the company has released both - successful products and new start-up projects, and whether you’re looking for a stable company or the energy of a start-up team both expectations can be justified!\n\nEstablished in 2014, the company is the creator of the relational blockchain - a new blockchain architecture that combines the power and flexibility of a relational database and the fault tolerant decentralized security of a blockchain. The company has its own Relational blockchain platform that makes sense!\n\nThe company is expanding its remote team and is looking to hire a skilled and open-minded Mid-Senior Blockchain Developer.\n\nYou could work fully remotely, on a work contract or as a long-term Contractor/Freelancer – up to you.\n\nA wholly new approach to building decentralized applications for the real world – a public platform for decentralized applications.\n\nRelational blockchain allows the company to offer a user and developer experience, which no other blockchain platform can match, and making it easy for people to build decentralized apps in the real world.\n\nThere is a great passion to empower people to build a fair and decentralized society, where technology allows everyone to benefit without anyone being exploited.\n\nThat is why the company provides user-empowering ecosystems and tools for exploring the potential of blockchain technology.\n\nTasks\n\nThe Role:\n\nAs a blockchain developer, you will be on the frontier of tech, a frontier with loosely defined rules and a lot of room to try things - you can define the industry.\n\nAs a blockchain developer, first and foremost, you write the code that goes on the blockchain, but also, take the mindset and philosophy of decentralization and blockchain and help others understand it.\n\nCompared to other fields, the developer that knows blockchain, has more influence over the applications being built.\n\nThe company has projects in different areas ranging from, music, gaming, real estate, DeFi, fashion, supply chain and more - all relating to blockchain.\n\nYou will be assigned to work as a blockchain developer on one of these projects, with responsibility that can grow over time.\n\nCommon tasks or activities are:\n\n• Product ideation\n\n• Product development\n\n• NFT sales\n\n• Air Drops\n\n• Unit tests\n\n• Code auditing\n\n• Explaining and teaching about blockchain\n\nRequirements\n\nRequirements:\n\n• Bachelor’s or Master’s degree in Computer Science or equivalent\n\nKnowledge of:\n\n• SQL\n\n• Solidity\n\n• OpenZeppelin\n\n• ERC standards\n\n• Hardhat\n\n• JS/Node.js\n\nAlso you:\n\n• Are a friendly team player\n\n• Have the courage to speak up if you see something that can be improved\n\n• Are open-minded and passionate about new technologies\n\n• Have the ability to change your mind\n\nPlease apply with your CV and a portfolio of your released product(s).\n\nThe company is mostly flat in hierarchy, consensus oriented and distributed around the world.\n\nSelf-development and listening to the needs of our people are core values!\n\nBenefits\n\nBenefits & Perks:\n\n• Flexible working time, remote or on-site – up to you\n\n• Budget to set-up your home office\n\n• Covered training and certification courses (annual budget for you), covered workshops or conferences to improve your personal development.\n\n• Company retreats plus monthly team meetups (expenses covered) for team-building.\n\n• Additional Health Insurance\n\n• Monthly reimbursement for a gym membership, massage and others, promoting a healthy life>\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain","solidity","nft","node"]},{"job":"Deployment Lead","company":"Cash App","location":"New York","post_date":"4d","link":"https://web3.career/deployment-lead-cashapp/39995","key":"39995","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nThe CRM Ops team’s mission is to enhance, build and maintain operational excellence through tooling, tech and process. We aim to enhance marketing capabilities across email, push and in-app channels and establish a workflow process for all crossfunctional teams to engage with our users. We’re looking for our very first Deployment Lead to drive company OKRs through the CRM operations, ensuring that holistic end-to-end multichannel campaigns are delivered in North America as a primary focus while there should be oversight globally. The Deployment Lead will play an integral part in leading Cash App’s overall digital presence with a unique focus on delivering email and push communications and evolution of related platform technology.\n\nYou will build relationships and influence cross-functionally with CRM Marketing Managers, Legal and Compliance, Analytics and Creative to meet ambitious growth CRM targets. Our Deployment Lead will be responsible for building the framework for managing and deploying communications to users via owned, digital channels across Cash App and Afterpay channels. You will develop, optimize, and update processes that are essential to scale while maintaining transparency to all stakeholders and continue to make recommendations for enhancements to efficiency and socialize for buy-in by all teams.\n\nYou Will\n\n\nBuild / ship, troubleshoot, and understand day to day responsibilities at a granular level.\nOwn feedback loop with Infra & Data Ops of surfacing what is/isn’t working for our business needs re. Our tools and net new needs\nManage resourcing/sprint process of projects across regions and teams\nMentor and lead direct reports for growth and skill development\nAdvanced understanding of creative briefs and what they should communicate as well as where changes are logged in order to maintain consistency across the process\nDevelop and optimize process, SLAs, and other key performance indicators to ensure the deployment team is shipping work in an efficient, timely, and high quality manner\nManage, update and document all process changes for scale\nDrive standardization and consistency across the entire CRM operation and maintain database integrity\nManage and lead multiple work streams and programs in a highly organized and transparent manner\nUse Data & Insights to continually optimize and drive growth and performance of strategy and tactics\nMaintains deliverable lists, and distributes a weekly status of project priorities to team members\nFacilitate project presentations independently to senior stakeholder level and manage project communications across functions and matrixed teams\nTrack project progress, responsible for schedule development, maintenance, and communication of status. Manages all project communications and documentation in a meticulous and timely fashion\nDistill and articulate defined business strategy and proposed solutions to the project team\nIdentify risks and dependencies in cross-functional program plans, and take appropriate action to mitigate risks and manage stakeholder expectations\n\nYou Have\n\nQualifications\n\n5+ years experience in the marketing field specializing in CRM or data-driven marketing\nAt least 5 years of demonstrable experience guiding both engineering and creative teams through complex projects (interactive agency experience is helpful)\nProven track record of flawless execution that drove performance and achieved KPIs\nDeep understanding of digital marketing process for flexibility and growth\nWorking knowledge of platform integrations like Segment, Movable Ink, Appsflyer are a plus\nExtremely organized and able to prioritize based on risk assessment and return on investment\nFamiliarity with digital communication platforms and technologies with a strong emphasis in managing email and push campaigns\nExtensive experience and knowledge of modular email templates and specs\nResults-driven, comfortable with large data-sets and able to identify actionable trends and insights\nProven track record running projects that drive results and developing processes to continually improve\nYou’re strategic and analytical in your thinking and a strong communicator with your team and cross-functional teams and are a trusted advisor on CRM processes\nYou’re a creative, empathetic, and strong people leader and coach to your team\nYou work effectively and build positive relationships with colleagues and cross-functional teams\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $138,200 - USD $169,000\n\nZone B: USD $128,500 - USD $157,100\n\nZone C: USD $121,700 - USD $148,700\n\nZone D: USD $110,600 - USD $135,200\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead"]},{"job":"Permance Engineer Blockchain","company":"Ripple","location":"New York","post_date":"4d","link":"https://web3.career/performance-engineer-blockchain-ripple/39994","key":"39994","details":"Ripple’s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of massive scale spanning $155 trillion in annual cross border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year.\nWe are looking for performance engineers to join a growing team that is in charge of performance, scalability and reliability of the XRPL network. You will work closely with developers, scientists, devOps and other members in the performance team to gain deep knowledge on software’s design; use cases and its data flow, model realistic load profiles and conduct comprehensive performance testing and tuning on products and features we deliver as a team to the XRPL community. The ideal candidate should have a strong CS background, be passionate about problem solving, possess strong analytical and logical thinking skills and be very detail oriented.\nWhat You’ll Do\n\n\nWork with teams across the organization in acquiring performance requirements and load forecast metrics\nParticipate in the full software release lifecycle, from software design and development to the deployment of the products\nDesign performance testing load model and the associated test data to realistically simulate the load in the lab environment\nDevelop comprehensive load simulators and all necessary tools required for the setup and testing\nConduct iterative performance testing; bottleneck detecting/removing; code profiling and comprehensive tunings at all levels (OS, network, software and database)\nDevelop performance monitoring dashboard or tools for effective monitoring during testing\nCollect test results; conduct detailed analysis and generate test report\nWork with devOps to ensure the product’s readiness for production environment\nContinuously raise our standard of engineering excellence by proactively looking out for problematic signs that may affect product’s performance and/or reliability\n\nWhat We’re Looking For\n\nBachelor’s degree or higher in Software Engineering, Computer Science, or equivalent industry experience\nFamiliarity with Linux shells; understanding of OS components; networking; web protocols and database operations\n2-4 year(s) of working experience in software engineering (including internship or research programs)\nProficient with one or two programming languages; strong computer science understandings\nIntellectually curious; hyper focused; problem driven and persistent - you are not easily satisfied with hypothetical explanation but driven in digging out the root cause\nExcellent communication skills in both verbal and written\nYou thrive on autonomy, responsibility and owning your work, end to end\nA positive attitude and a passion for sharing knowledge within your team and organization\nAttention to detail and a commitment to excellence\n\nWho We Are\nRipple is doing for value what the internet did for information: enabling its instant and seamless flow around the world. We call this the Internet of Value (IoV). Using blockchain and cryptocurrency technology, Ripple is dedicated to creating powerful gains in financial efficiency, equity and inclusion. In addition, Ripple is developing and enabling the future use cases that will catalyze the new digital economy for governments, businesses and consumers.\nRipple has offices in San Francisco (HQ), New York, London, Mumbai, Singapore, São Paulo, Toronto, Reykjavík, Washington D.C. and Dubai.\nWHAT WE OFFER – The resources and support to be your best at work and beyond:\nDo Your Best Work\n\nThe opportunity to build in a fast-paced start-up environment with experienced industry leaders\nA learning environment where you can dive deep into the latest technologies and make an impact. A professional development budget to support other modes of learning.\nThrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team.\nRipple is Flexible First: you have the option to work remotely, from our offices, or a combination of the two within the 11 countries we are located around the world.\nWeekly all-company meeting - business updates and ask me anything >\nWe come together for moments that matter which include team off-sites, team bonding activities, happy hours and more!\n\nTake Control of Your Finances\n\nCompetitive salary, bonuses, and equity\nBonus Flexibility Program: Participants in the Corporate Bonus Plan have the option to elect to receive their annual bonus in cash, equity or XRP, or a combination.\n100% paid medical and dental and 95% paid vision insurance for employees starting on your first day\n401k (with match)\nCommuter benefits\nEmployee giving match\nMobile phone stipend\n\nTake Care of Yourself\n\nTwice a quarter R&R days so you can rest and recharge\nGenerous wellness reimbursement and weekly onsite & virtual programming\nFlexible vacation policy - work with your manager to take time off when you need it\nIndustry-leading parental leave policies. Family planning benefits.\nCatered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events\n\nBenefits listed above are for full-time employees. Interns - please discuss benefits with your recruiter.\nRipple is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.\nPlease find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain"]},{"job":"Senior Backend EngineerWeb3 Blockchain","company":"Truist","location":"San Francisco","post_date":"4d","link":"https://web3.career/senior-backend-engineer-web3-blockchain-truist/39992","key":"39992","details":"The position is described below. If you want to apply, click the Apply button at the top or bottom of this page. You'll be required to create an account or sign in to an existing one.\nNeed Help?\nIf you have a disability and need assistance with the application, you can request a reasonable accommodation. Send an email to Accessibility (accommodation requests only; other inquiries won't receive a response).\nRegular or Temporary:\nRegular\nLanguage Fluency: English (Required)\nWork Shift:\n1st shift (United States of America)\nPlease review the following job description:\nDeliver technically complex solutions. Perform system integration support for all project work. Consult and partner with the business product owners to understand the end goal and offer solutions and recommendations during the design.\nEssential Duties And Responsibilities\nFollowing is a summary of the essential functions for this job. Other duties may be performed, both major and minor, which are not mentioned below. Specific activities may change from time to time.\n\n\nBuild and release Web3/Blockchain-based production features, prototypes, and applications\nMentor more junior engineers toward senior status and autonomy\nWork to constantly improve development and release processes\n\nQualifications\nRequired Qualifications:\nThe requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nBachelor’s degree and eight to twelve years of experience as a developer or equivalent education and related training or experience\nDeep specialized and/or broad functional knowledge\nSound understanding of business and organizational strategies and processes\nAbility to interpret internal and external business challenges and recommend best practices\nAbility to lead complex projects\nSophisticated analytical skills and the ability to solve complex technical and business problems\nAbility to influence others at senior levels to adopt a new perspective\n\nPreferred Qualifications:\n\n5-8 years experience in web application backend engineering\n3+ years experience with Javascript/Typescript and Node.js applications\n3+ years experience with building blockchain-centric applications, especially with smart contracts (Solidity, Rust, etc.) and safe key management\nGood attitude / team player - assumes positive intent in technical and non-technical teammates and avoids intellectual vanity\nCares about end user - deeply understands the importance of good user experience over an envisioned perfect system model\nHigh ownership of user experience - thinks critically while discussing spec & building, ideates on improvements, and self-tests code before others test\nUnderstanding of key business processes and competitive strategies related to the IT function\nAbility to plan and manage projects and solve complex problems by applying best practices\nAbility to provide direction and mentor less experienced teammates. Ability to interpret and convey complex, difficult, or sensitive information\n\nOther Job Requirements / Working Conditions\nSitting\nConstantly (More than 50% of the time)\nStanding\nFrequently (25% - 50% of the time)\nWalking\nFrequently (25% - 50% of the time)\nVisual / Audio / Speaking\nAble to access and interpret client information received from the computer and able to hear and speak with individuals in person and on the phone.\nManual Dexterity / Keyboarding\nAble to work standard office equipment, including PC keyboard and mouse, copy/fax machines, and printers.\nAvailability\nAble to work all hours scheduled, including overtime as directed by manager/supervisor and required by business need.\nTravel\nMinimal and up to 10%\nTruist supports a diverse workforce and is an Equal Opportunity Employer that does not discriminate against individuals on the basis of race, gender, color, religion, citizenship or national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law. Truist is a Drug Free Workplace.\nEEO is the Law Pay Transparency Nondiscrimination Provision E-Verify\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","senior","blockchain","solidity"]},{"job":"Technical Product Manager","company":"BlockApps","location":"New York","post_date":"4d","link":"https://web3.career/technical-product-manager-blockapps/39991","key":"39991","details":"Location: Brooklyn, NY / Miami, FL\n\n\n\n\nCompany Overview:\n\n\n\n\nBlockApps is an enterprise blockchain company which develops industry applications and its own blockchain platform to create traceability across enterprise value chains. Our customers include Fortune 500 companies such as Bayer Crop Science (the world’s largest seed company), Blockchain for Energy (a consortium of the world’s largest energy companies including Repsol, Chevron, ExxonMobil, Schlumberger and more), and the U.S. government. BlockApps has launched several industry initiatives, including TraceHarvest (agribusiness traceability), TraceCarbon (sustainability tracking), and the Enterprise Ethereum Alliance (world’s largest open standards blockchain organization). For more information, visit and contact us at www.blockapps.net, or find us on social media via LinkedIn, YouTube and Twitter.\n\n\n\n\nJob Description:\n\n\n\n\nIf you can ruthlessly prioritize while balancing the needs of customers and stakeholders and have a knack for evidence-based decision making and working with cutting-edge technology, do we have a job for you. BlockApps is looking for a Product Manager to help set the long-term vision and strategy for our Company’s products, communicate this strategy to all relevant individuals and stakeholders, and gather and analyze data and business intelligence to inform the evolution of your product roadmaps.\n\n\n\n\nJob Responsibilities:\n\n\n\n\n• Work with senior management to develop product requirements and roadmaps\n\n• Determine industries needs and desires and coordinate with engineering, marketing and other teams to evaluate whether customer’s needs and desires can be met\n\n• Generate produce requirements documentation and production timetables, pricing, and time-integrated plans for product delivery\n\n• Collect and analyze feedback and input from customers, stakeholders and other team members to shape the requirements and features of the end products and find ways to expand market reach\n\n• Ensure products and releases are launched correctly and on schedule\n\n• Make creative recommendations to expand product base and vision\n\n• Review product specifications and requirements to recommend the nature and scope of present and future product lines and appraise senior management of new product ideas and/or product or packaging changes you’d recommend\n\n• Develop and implement product strategies consistent with the Company’s vision\n\n• Assess market competition by comparing the Company's products to competitors' products\n\n• Obtain product market share by working with the Sales department to develop product sales strategies\n\n• Assess product market data by calling on customers with field salespeople and evaluate sales call results\n\n• Provide senior management with short and long term product sales forecasts\n\n• Contribute to team effort by accomplishing related results as needed\n\n• Conduct Product demonstrations\n\n• Create product sheets and objection management sheets for Sales staff\n\n\n\n\nSkills and Qualifications:\n\n• Bachelor’s degree in Computer Science, Engineering or related field required; MBA or equivalent desirable\n\n• Two or more years of product management experience\n\n• Detail-oriented\n\n• Thrive in collaborative environment\n\n• Analytical and strong organizational skills, with excellent oral and written communication skills\n\n• Problem-solving aptitude\n\n• Creative thinking skills\n\n• Product lifecycle management experience\n\n• Background in software development and program management\n\n• Experience in Agile teams\n\n• Strong background in the following technologies:\n\nREST API design\nSketch and or Adobe products\nAgile software delivery\nPowerpoint\nSQL\nSoftware architecture\nCSS & HTML\nJavascript\nTechnical Documentation\nAzure/AWS\n\n\n\nOther “nice-to-haves” include:\n\n\n\n\n- Solidity or other blockchain development\n\n- Docker experience\n\n- Distributed systems\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","solidity","ethereum","javascript"]},{"job":"FrontEnd Engineer","company":"Bebop","location":"London","post_date":"4d","link":"https://web3.career/front-end-engineer-bebop/39990","key":"39990","details":"Front-End Engineer\nLondon/Singapore /\nTECHNOLOGY /\nFULL-TIME\n/ Hybrid\n\nApply for this job\nAbout Bebop\n\n\nBebop is a decentralized trading platform that aims to deliver a step-change user experience to trading on DeFi. \n\n\nWe believe that DeFi is the future of finance facilitating true innovation, economic freedom and ability to create the best financial products. At Bebop, we are on a mission to make superior trading products with efficient execution available to anyone. This means that we will only offer products and features that make sense. We will be driven by the best practices of user experience with user-centric design at the heart of everything we do, making products fun and easy to use. And we will work relentlessly and leverage our deepest expertise to bring the most efficient execution with transparent fees. \n\n\nBebop was born and incubated at Wintermute, one of the largest trading companies in crypto and a leading liquidity powerhouse in DeFi. \n\n\nLearn more about bebop at bebop.xyz, Twitter, Discord and Medium.\n\n\nWorking for Bebop \n\n\nAt Bebop you will have an opportunity to grow professionally and make a direct impact on the business. You will work very closely with our product and engineering teams to improve your knowledge of building high-performance scalable applications and understand broader system architecture.\n\n\nWe are looking for a Front-End Engineer who is passionate about building products/applications that people find useful and that help grow the business. You will be responsible for all things Front-end related; this includes developing front end applications for Bebop as well as internal trading applications. A great advantage of this position is that it is varied, and you will have a unique opportunity to shape it, including selecting significant parts of the tech stack.\nHard Skills Requirements\nKnowledge of front-end tech stack: node.js, npm, javascript, typescript and popular frameworks such as React (please have examples front-ends that you built ready)\nNice to have requirements\nBasic understanding of infrastructure required for frontend/servers:  CDN, Cloudflare or similar, webservers.\nExperience with Web3 is a strong plus, but not mandatory\nPython knowledge is a strong plus, but not mandatory\nBebop Offer\nA unique opportunity to work on a startup from zero to one with all the impact of early employees, while having a reliable backing (financial, technological and business expertise) from one of the industry’s top players\nAn amazing culture, defined as ambitious, knowledgeable and fun\nWork flexibility: while we have location preferences for our hubs (New York, London, Singapore, Sydney).\nApplication Process\n1st Stage: Online Coding & Quantitative reasonings tests\n2nd Stage: Technical interview with our Engineer, Designer and Head of Product\n3rd Stage: Take home design task followed by presenting it to one of our Engineers\n4th Stage: Final round with the rest of the team\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","react","javascript","node"]},{"job":"BD Partnerships Manager Gaming","company":"Horizon Blockchain Games","location":"Toronto","post_date":"4d","link":"https://web3.career/bd-partnerships-manager-gaming-horizon/39989","key":"39989","details":"BD & Partnerships Manager, Gaming\nToronto, ON /\nSales /\nRemote\n/ Remote\n\nApply for this job\nAt Horizon, we’re building a new dimension where Internet economies are fun, accessible, and for the benefit of all participants.\n\n\nWe have two amazing products to make this real:\n \nSequence, the all-in-one developer platform + smart wallet that makes building web3 games and applications easy.\n \nSkyweaver, a digital trading card game—powered by Sequence—where players can win, own, and trade their NFT/SFT game items.\n \nSequence is poised to drive web3 adoption on a massive scale by making blockchain easy, fun and powerful for users and developers. And, Skyweaver is a groundbreaking video game with an unprecedented player-owned economy, novel gameplay, and an already fervent community.\n \nWhile the challenge is hard, we find it incredibly fun. And, we have the ingredients to make it happen: a well-capitalized company with some of the best investors in the world, including Brevan Howard Digital, Take-Two Interactive Software Inc., Coinbase, Ubisoft, Polygon, Morgan Creek Digital, Initialized, BITKRAFT, DCG, and more; an amazing team of leaders in the web3 space; engineers who have built widely popular open source; a former top McKinsey strategy consultant; gaming industry veterans; and founders who have built and sold successful companies. You'll get to work with and learn from them all. Learn more at https://horizon.io/\n\n\nAbout the Role\n\n\nWe are looking for an experienced and energetic BD & Partnerships Manager to join our Business Development team to play a key role in the growth of Horizons industry leading products, focusing primarily on Sequence. The BD & Partnerships Manager in Gaming we’re seeking is a strong relationship builder who thrives on prospecting, closing, nurturing and maintaining sustainable, long term partnerships.\n\n\nThe ideal candidate has several years of experience in business development or sales role and is able to work independently, as well as part of an awesome and collaborative team who will probably become close friends in no time. You are deeply interested and knowledgeable about blockchain, Web3 and gaming in particular. \n\n\nWe are looking for a self-starter that can be both hands on and strategic. You will report to the Business Development Director and collaborate with the product & engineering, marketing, legal teams to, through our offerings, and solve real problems our partners are facing while building innovative products in Web3. You will be able to easily develop an in-depth knowledge of company offerings, to be able to communicate and pitch tailored messaging to a wide variety of audiences at differing levels of technical sophistication. You are friendly and people enjoy talking to you.\n\n\nYou will have the opportunity to make an impact in a fast-scaling sector, with the potential to affect hundreds of millions of people around the world. You will be a key asset in making web3 accessible to the people.\n\n\nResponsibilities\n\n\nBusiness development\n\n\n* Execute the go-to-market strategy for attracting new industry-leading partners\n* Prospect and rank the best potential partners across in the Web3 gaming sector\n* Perform lead generation and reaching out to target partners across various platforms\n* Develop an understanding of potential partners needs and pitch Horizon offerings to solve those needs using tailored messaging\n* Track discussions with partners through all stages the business development life-cycle and keep the relevant internal teams up to date with progress and timelines\n* Close partnership deals which are mutually beneficial for both parties\n\n\nManaging key partnerships\n\n\n* Manage and strengthen relationships with existing gaming partners\n* Lead partners through the integration onboarding process, ensuring a smooth and easy experience for all parties\n* Own client relationships from onboarding until adoption and use of the Sequence wallet and developer platform\n* Establish relationships with leadership teams and founders worldwide and attempt to work with them to drive adoption of the Sequence wallet and developer platform\n* Develop processes to manage ongoing partnerships, to keep them informed of our product roadmap, releases and news\n* Develop processes to understand partners ongoing requirements, and effectively communicate their needs to the relevant team members internally\n* Research emerging trends and recommend new Horizon offerings to satisfy partners needs\n\n\nBecome an expert\n\n\n* Develop a strong knowledge base in the Ethereum and blockchain ecosystem\n* Understand how our products, Sequence Wallet and developer platform, can unleash significant value for partners\n* Keep up with trends and developments in the blockchain and web3 gaming sector\n* Participate in blockchain/crypto/gaming conventions with relevant opportunities to build relationships and develop future opportunities\n\n\nBe a great teammate\n\n\n* Embody and promote our company values\n* Build solid relationships with colleagues from marketing, product, development and legal teams\n* Ability to multitask, managing priorities and concurrent projects, meeting deadlines in a busy and ever-changing environment\n* Team player, positive attitude, strong verbal, and written communication skills and excellent interpersonal skills.\n* Ability to work on your own initiative and make effective decisions under pressure\n\nRequirements\nAt least 5 years of proven “B2B” business development and/or partnership management experience\nExperience working in the gaming sector is a strong plus\nExperience working in a fast paced, start up environment\nWorking knowledge in blockchain and/or Web3 industry is ideal\nPassionate about blockchain, web3 and gaming is a must\nStrong communication, experience in creating pitch presentations, and materials, strong presentation skills\nFluent in English (written and spoken)\nExperience with Google Suite and MS Office Suite\nHighly organized: you can multitask without dropping the ball and you always meet deadlines\nYou are resourceful and LOVE to take initiative\n‘Hands on’, ‘can do’ attitude is a prerequisite\nWhy Horizon?\n\n\n·       A chance to deliver massive impact at a small and quickly growing company\n·       Work on hard, big, meaningful problems that can shift markets\n·       Competitive salary and equity package\n·       Accelerate your career by joining at the early stages\n·       Be part of defining web3, the next generation of the Internet, and creating symbiotic economies where both users and creators share in the value generated by networks\n·       Work with an outstanding team made of wonderful people who have built and sold successful companies, launched amazing products, and have rich experience in infrastructure, architecture, blockchain, games, finance, investing, strategy, consulting, design, marketing, community, and more.\n·       Work-life balance unlike the “crunch” culture you find at larger studios\n·       New PC, and generous allowance for work-from-home setup\n·       Extensive health benefits for Canadian employees\n·       We’re conscious about mental health and have modern vacation policies\n·       We invest in everyone’s personal development\n·       Learn more about our values and the traits we embody at https://careers.horizon.io/\n\n\nWe are committed to diversity and encourage applicants from all backgrounds, genders and faiths. While we're building incredible products, we also want to add to our wonderful team and company. The best way to do that is to attract talented folks from all areas and to have their experiences inform their work.\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","game","dev","ethereum","nft"]},{"job":"3D Creator 100%","company":"Finfin Play AG","location":"Remote","post_date":"1mo","link":"https://web3.career/3d-creator-100-finfin-play-ag/37706","key":"37706","details":"Finfin Play is launching Fashion League, the first female-centered blockchain mobile game to bring NFT and Web3 to the masses. We are a diverse and inclusive team of fashion enthusiasts and retail experts united by our passion for simulation games, supported by a board of world-class gaming and crypto experts. \n \nFinfin Play now offers a 3D Creator role, a full-time position partly in Switzerland/ remotely. In this role you will be acting as a 3D creator, coordinating and executing different game asset productions, including 3D renders (still and videos), and ensuring high quality standards across the whole production line from sculpting to final beauty passages.\n \nResponsibilities:\n\n\nCreation of 3D assets and optimization for gaming\nHelp to create marketing content and social media renders according to the game marketing strategy developed\nDedicated adaptation and texturing creation for both marketing purposes and in-game assets \nProduction of short renders for social media purposes\nCoordination with external creators and quality check\nMonitoring external creators and determining the most effective approaches for increased productivity\nExecuting projects containing key deliverables and timeline workflows\nTimely reporting on creative production and effective communication with the Creative Direction\nCollaboration with the Game Production and Marketing team to build visual campaigns according to the brand guidelines\nQualifications:\n\n\nStrong background in visual content creation and creative coordination\nMinimum 3-5 experience in 3D production and project management\nExpert knowledge of 3D software; Blender, Mixamo and Unity\nKnowledge of Adobe Creative Suite\nPrevious experience with a fast growth, blockchain, or technology-related company preferred\nExcellent project management skills with the ability to effectively take ownership, lead, organize, prioritize, strategically plan, execute, and consistently produce deliverables on time\nStrong written and verbal communication skills in English (proficiency level)\nAre you looking for an international, diverse, fresh and fast-growing environment to further enhance your career? We would like to hear from you! \nIf you are interested in this position, please send us your portfolio and reach out to us at hr@finfinplay.com.\n \nInformation provided will be treated in strict confidence and will only be used for recruitment-related purposes. Only short-listed candidates will be contacted. Information of unsuccessful applicants will be destroyed after six months.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["vfx","non-tech","art","direction","game","dev","marketing"]},{"job":"Senior Game Marketing Manager 100%","company":"Finfin Play AG","location":"Remote","post_date":"1mo","link":"https://web3.career/senior-game-marketing-manager-100-finfin-play-ag/37707","key":"37707","details":"Finfin Play is launching Fashion League, the first female-centered blockchain mobile game to bring NFT and Web3 to the masses. We are a diverse and inclusive team of fashion enthusiasts and retail experts united by our passion for simulation games, supported by a board of world-class gaming and crypto experts. \n \nFinfin Play now offers a Senior Game Marketing Manager role, a full-time position in Switzerland. In this role you will be acting as a head of marketing, leading, overseeing, monitoring, and executing different game marketing projects such as campaigns, roadmaps, go-to-market initiatives in order to grow brand awareness and increase our community!\n \n \nResponsibilities:\n\n\nLeading the marketing team, help to shape the brand according to the game marketing strategy developed\nBuilding and executing creative game marketing campaigns and activations that effectively grow brand awareness and increase our community userbase \nCreating and developing roadmaps and tracking progress of roadmaps, executing projects containing key deliverables, rollouts, timeline, and budget\nCoordinating game marketing projects and go-to-market initiatives \nMonitoring and analyzing the ROI of different initiatives in different markets to determine the most effective approaches for growing our community and brand\nGathering analytics and reporting on campaigns and channels collaborate with the Partnership team to build game marketing initiatives \n \nQualifications:\nStrong background in gaming industry, Web3, blockchain, and NFTs\nMinimum 5-7 experience in game marketing (including digital marketing) and project management\nPrevious experience with a fast growth, blockchain, or technology-related company preferred\nExcellent project management skills with the ability to effectively take ownership, lead, organize, prioritize, strategically plan, execute, and consistently produce deliverables on time\nStrong written and verbal communication skills in English (native or proficiency level)\nAre you looking for an international, diverse, fresh and fast-growing environment to further enhance your career? We would like to hear from you!\nIf you are interested in this position, please reach out to us at hr@finfinplay.com.\n \nInformation provided will be treated in strict confidence and will only be used for recruitment-related purposes. Only short-listed candidates will be contacted. Information of unsuccessful applicants will be destroyed after six months.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["game","dev","marketing","non-tech","senior","blockchain"]},{"job":"Product Lead Community","company":"Cash App","location":"San Francisco","post_date":"4d","link":"https://web3.career/product-lead-community-cashapp/39988","key":"39988","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app, bringing a better way to send, spend, invest, borrow and save to our millions of monthly active users. With a mission to redefine the world's relationship with money by making it more relatable, instantly available and universally accessible, at Cash App you'll have the opportunity to make a real-world impact with your career.\n\nToday, Cash App has thousands of employees around the world with a culture geared toward creativity, collaboration and impact. We’ve been a distributed team since day one, and continue to value working across time zones and continents both remotely and in our Cash App offices.\n\nOur offices are great, but many of our roles can be done remotely from the countries where Block operates. We tailor our experience to champion our employees’ creativity and productivity wherever they are.\n\nCheck out our locations, benefits and more at cash.app/careers.\n\nJob Description\n\nAt Cash App, over 40 million customers send and receive money from friends, family and businesses in their communities each month. As our network has scaled, we're looking for leaders to join our Community product team and build new ways for individuals and groups to form meaningful financial relationships. These connections build the network effects at the heart of our product, strategy and business. Our team is responsible for Cash App's core P2P (peer-to-peer) network and new product areas designed to grow our network by making money instant and relatable.\n\nYou Will\n\nIn this role you will be a core member of the Community product team, helping us craft the vision and experiences for multiple areas of our roadmap.\n\n\nDefine the strategy, goals and roadmap for our peer-to-peer payments product and related feature areas\nOwn features from exploration through launch; get your hands dirty on a day-to-day level and building for the long-term\nBuild unique features that weave into the rest of the Cash App product ecosystem\nPartner with design, engineering and other disciplines to build diverse team(s) to accomplish our business goals\n\nYou Have\n\nQualifications\n\n10+ years of product management or equivalent experience\nA humble and scrappy get-it-done mindset; you’re resourceful and in your element going from 0 to 1\nStrong customer empathy and the ability to leverage design as a superpower\nAnalytical chops; a deep understanding of network effects and how to reinforce them in product\nExperience driving complex, cross-functional projects that span engineering and product disciplines\nComfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction\nExcellent verbal and written communication skills\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $202,500 - USD $247,500\n\nZone B: USD $192,400 - USD $235,200\n\nZone C: USD $182,300 - USD $222,800\n\nZone D: USD $172,200 - USD $210,400\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","lead"]},{"job":"Sr. Strategy Manager Customer Success","company":"Cash App","location":"Atlanta","post_date":"4d","link":"https://web3.career/sr-strategy-manager-customer-success-cashapp/39987","key":"39987","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nWe are seeking a highly motivated, experienced, and deeply resourceful individual to lead and execute Cash Customer Operations’ (CCO’s) Customer Success planning and strategy functions. This individual will be part of a team that works cross-functionally within CCO, and across Cash to create, align and refine strategy, and drive performance and goals. This role is focused on effective, timely, and compliant operations of our strategy and framework within Customer Success to deliver critical business projects.\n\nIn this role, you will serve as a guide, air traffic controller, innovation source, budget master, and the ultimate operational strategist, driving excellence, consistency, and communication among the Customer Success leadership team, and ensuring alignment and shared understanding across CCO. This role will work deeply with the Sr. Leaders of the Customer Success to develop and drive a deep understanding of key strategies, keeping the teams and supporting functions aligned, and maximizing CCO’s focus and execution capabilities. Inside the Cash team, you’ll work with the Sr. Strategy Lead, Finance, Product, Engineering, Biz Ops, and other partners to represent Customer Success and its priorities to support our customers as a key piece of building Cash App’s reputation as a financial institution they can trust.\n\nYou Will\n\n\nGuide strategy execution by the business in a scalable and compliant way\nUtilize deep operational and support industry knowledge to implement and improve on people, process and technology while serving as a strong cross-functional leader for our global team\nFacilitate the goal setting and execution of critical projects within Customer Success smartly balancing the levers around quality, cost, impact, risk and compliance and outcomes to maximize investments and talent\nIn partnership with Data and Process improvement teams to gather and synthesize relevant data, suggesting improvements in the processes and workflows to help scale the business to stay ahead of our needs\nRepresent Customer Success as needed in critical conversations with business partners across Cash to help synthesize priorities and context to drive informed high-decision quality\nPartner with Operational Excellence in the implementation of risk management practices within Customer Success including driving risk assessments, remediating identified issues, facilitating policy reviews, and managing regulatory change.\n\nYou Will Be Accountable For\n\nManaging operational frameworks around how Customer Success prioritize strategic initiatives, set goals, form and align on priorities, in partnership with the Sr. Leadership teams.\nCoordinating communication and execution of work amongst the department leadership team to ensure alignment, visibility and context are available and incorporated\nSteering and refining the engines that drive how we manage change, new business priorities, balance running the business with fueling innovation, and hold each other accountable in Customer Success to focusing on the priorities with the strongest impact and value\nParticipate with the Sr. Strategy Lead and CCO Leaders in formulating and creating alignment around the CCO investment strategy, which includes budgets, resource balancing among priorities\nMore specifically, oversee and drive accountability over annual and quarterly planning, including budgets, headcount, and organizational design.\nBuilding and representing the team’s culture and priorities as part of the overall ecosystem CCO is building across internal and external sites\nLeading, coordinating or supporting efforts around major impactful high-visibility projects and ensure opportunities are carried forward to practical and sustainable solutions\nMaintain relationships with cross-functional partners to help support Customer Success programs and goals.\n\nYou Have\n\nQualifications\n\n7+ years of operations/support industry experience with a focus on planning and process frameworks and developing and executing strategy at scale\n3 years experience and a proven track record in coordinating senior leaders with varied initiatives, priorities, and functions into a smooth, aligned performant team\nPast experience working in a rapidly scaling organization and going from a US-based or single-channel model to a global, distributed, matrixed model and evolving processes in tandem with growth and shifting business needs\nThe ability to effectively influence and communicate cross-functionally and excellent written and verbal communication skills\nCreative problem-solving abilities and expertise in balancing and articulating trade-offs\nA passion for consumer financial services and ensuring an outstanding customer experience\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $167,300 - USD $204,500\n\nZone B: USD $155,600 - USD $190,200\n\nZone C: USD $147,200 - USD $180,000\n\nZone D: USD $138,900 - USD $169,700\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["customer","support","senior"]},{"job":"Launch Partner Growth Initiatives","company":"Cash App","location":"MO St Louis US","post_date":"4d","link":"https://web3.career/launch-partner-growth-initiatives-cashapp/39986","key":"39986","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nAs a Launch Partner, Readiness at Cash, you’ll work on our Readiness team within the Cash Customer Operations (CCO) organization. CCO encompasses all customer facing teams along with those that support them. Readiness is a function at Cash that focuses on driving preparedness for growth initiatives that impact our CCO team.\n\nIn this role, you’ll help prepare for and manage execution of specific Cash growth initiatives that impact the larger CCO Organization, have a pulse on the needs of the business, and be the first point of contact for CCO teams when we launch any given initiative. You’re comfortable with ambiguity, proactive, and not afraid to jump in and do the work. You have the ability to effectively understand the scope of an issue quickly, and identify/partner with the right stakeholders to problem solve where needed. Lastly, you’re an execution master that thrives in a fast paced environment. You love checking things off the to do list, tackling the next issue, and effectively communicating with the right folks along the way.\n\nYou Will\n\n\nGain a thorough understanding of all growth initiatives assigned to you\nVisualize how a given initiative will impact current processes for teams involved, define areas that need attention/change, and document accordingly\nCreate/update process maps and illuminate process considerations as we scale each growth initiative beyond initial launch\nWork with stakeholders across CCO, including but not limited to: Data/Analytics, L&D, Behavioral Insights, Risk Operations, Internal Systems etc. to understand considerations and impact to their teams in regards to any growth initiative you are assigned.\nOwn Readiness playbook execution and updates for assigned growth initiatives\nCreate mechanisms to collect early feedback from internal CCO stakeholders upon launch of an initiative. With inputs, quickly assess, problem solve and involve the right cross-functional team members to resolve issues\nEffectively inform and handoff responsibilities to Change Management (CM), Voice of Customer (VOC), and other teams within CCO post initiative launch as defined by the Readiness playbook\nContribute to regular readouts on behalf of Readiness team\n\nYou Have\n\nQualifications\n\n5+ years experience in Customer Operations, preferably working on Market launches\nStrong technical acumen, comfortable with ambiguity and understands the right questions to ask to assess impact\nInvolvement in product launches as related to customer experience and impact\nThoughtful communicator, with the ability to explain operationally complex problems and translate technical product terminology to various stakeholders across the business\nExperience with JIRA, Asana, Looker, Tableau, Excel or similar project management and data tools\nComfortable managing up, down and across the organization to get work done\nHigh emotional intelligence with the ability to build strong partnerships across the organization\nExperience gathering requirements, working with PMO functions and executing key project tasks.\nExceptional and proactive problem solver. Comfortable getting in the weeds to understand, partner where needed, and problem solve\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $103,900 - USD $126,900\n\nZone B: USD $96,600 - USD $118,000\n\nZone C: USD $88,300 - USD $107,900\n\nZone D: USD $77,900 - USD $95,300\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech"]},{"job":"Graphic Design EU Intern Binance Accelerator Programme","company":"Binance","location":"Remote","post_date":"4d","link":"https://web3.career/graphic-design-eu-intern-binance-accelerator-programme-binance/39985","key":"39985","details":"Graphic Design (EU) Intern - Binance Accelerator Programme\nGlobal /\nMarketing – Marketing /\nIntern\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a Graphic Designer to help develop and define the Binance identity. You will be part of a highly talented team, working to elevate the brand through creative excellence.\n\n\nThis position can be fully remote or can work in one of our offices in Europe.\nResponsibilities:\nAs part of the Design team, develop and produce artwork and advertising, which reflect the identity of Binance globally; across different products and local markets\nCollaborate closely with the internal design team to ensure brand coherency and consistency across all creative output\nProactively identify emerging design trends, and contribute to robust internal creative conversations\nIdeation of Brand-led campaigns\nRequirements:\nGraphic Design or Design-related field major preferred\nFluency in English is required\nBasic knowledge of layouts, typography, line composition, colour, and other graphic design fundamentals\nClear communication skills - ability to express complex ideas clearly and succinctly, while collaborating closely with teams outside of the Creative group\nExperience with Adobe Photoshop and Illustrator is a must, knowledge of Figma is a plus\nKnowledge and interest in the world of Binance and cryptocurrency is a plus\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","intern","entry","level","remote"]},{"job":"Blockchain Solutions architect Lead","company":"Trikon Ecosystem","location":"India","post_date":"4d","link":"https://web3.career/blockchain-solutions-architect-lead-trikon-ecosystem/39984","key":"39984","details":"In this role, you will be the technical representative for our Blockchain development and we expect you to architect enterprise Blockchain solutions for our organizations.\n\nYou will be responsible to lead and manage core Blockchain components that will be part of our current and future Blockchain solutions and guide team. This requires you to keep updated on the latest Blockchain technology developments and collaborate with our worldwide Blockchain team to propose technical solutions to foster our Blockchain ecosystem.\n\nResponsibilities\n\nDemonstrate a good understanding of Blockchain fundamentals, smart contracts, and consensus algorithms.\nUnderstanding of using cryptography material such as certificates for identity management in order to authenticate members, transactions, etc.\nAbility to architect and design integration architecture for integrating applications with Blockchain and, also, participant organizations and their member nodes to Blockchain network.\nCreate security architecture for managing the security of Blockchain and related applications\nCreate best practices/guidelines for blockchain team\nCreate performance metrics for measuring Blockchain performance\nReview code best practices and guide team for implementations\nCreate risk /failure analysis and prepare a risk mitigation plan\nRemain updated with emerging trends in Blockchain\nWork with the management team and lead efforts to research, design, develop, and test blockchain technologies to enable platform features\nDetermine best practices to utilize in order to realize the company vision.\nTrain and advise technical employees on Blockchain tools and frameworks, Blockchain principles, and so forth.\nBuild performance indicators to assess the performance of the Blockchain.\nPreparation of a risk and failure analysis and risk prevention plan.\nDocument new solutions as well as maintain existing documentation.\n\nRequirements\n\nBachelor’s degree in Information Technology, Computer Science or relevant field.\nTotal 6-8 years of experience with minimum 4+ years of experience as blockchain architect/ Technical architect/ Solutions Architect\nExperience working with ETH, polygon, and Solana.\nExperience with database architecture and design to create storage solutions for managing distributed ledger and related data/state in files/database systems.\nA solid understanding of Blockchain foundations, consensus algorithms, and smart contracts\nStrong command over cryptography.\nSkilled in programming languages, like NodeJS, ReactJS, JSON/API management, database management and NextJS\nExperience in application architecture and API-based integration.\nExperience in using cloud infrastructure (AWS, Azure).\nKnowledge of Digital Assets, Smart Contract Oracles, Multi Chain interoperability, private/public blockchains, and sustainability\nStrong communication skills, and experience communicating to technical and non-technical audiences\nExcellent communication and teamwork skills\nGreat attention to detail.\n\nTrikon Ecosystem focuses on Online Gaming, Blockchain / Cryptocurrency, and Web3. Their company has offices in India. They have a small team that's between 11-50 employees. To date, Trikon Ecosystem has raised $1.5M of funding; their latest round was closed on July 2022 at a valuation of $4.5M.\n\nYou can view their website at https://trikon.io or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["architecture","lead","blockchain","solana"]},{"job":"Operations Special Projects Manager Blockchain infrastructure company","company":"ZRG Partners, LLC","location":"New York","post_date":"4d","link":"https://web3.career/operations-special-projects-manager-blockchain-infrastructure-company-zrgpartners-llc/39982","key":"39982","details":"Our client is a Blockchain Infrastructure firm who is on a mission to enable elite infrastructure performance for billions of transactions at the intersection of Web3 and commerce.\n\nAs Operations & Special Projects Manager, you will play an active partnership role with the executive management team at a critical and exciting inflection point for the business. You will be asked to identify and solve strategic and operational challenges through data collection, analysis, and cross-functional collaboration. You will help improve upon existing operational processes, support the operations of various business lines, contribute to building and supporting new products, and identify new opportunities for growth.\n\n\n\n\nRESPONSIBILITIES\n\n● Develop and maintain operational performance metrics, implementing a roadmaps to ensure all deliverable and goals are met (or exceeded)\n\n● Serve as a thought partner to sharpen the work of other staff, reviewing recommendations, providing feedback, and refining drafts and products\n\n● Spearhead special initiatives and projects at the direction of the executive team\n\n● Proactively follow up with C-suite and functional leads to ensure that goals are being met and actions are being pursued to completion\n\n● Provide backup to C-suite on high impact tasks such as budget development, overseeing a recruitment processes, creating business development and/or fundraising collateral, and building culture\n\n● Improve internal decision making and help scale operations through processes, systems, and people\n\n\n\n\nQUALIFICATIONS\n\n● Self-starter that thrives in a fast-paced, ambiguous environment; entrepreneurial experience is a plus\n\n● A unique determination and drive that results in superior effort and insight\n\n● Highly organized, analytical, and accountable; with a particular focus on attention to detail\n\n● Pragmatic and solutions-oriented - always looking for more efficient and effective ways to do things\n\n● Able to move fluidly between collaborative and independent work >\n\n● Ability to distill complex concepts and to convey messages succinctly and thoroughly to a all audiences\n\n● Experienced at moderating discussions with groups small to large both asynchronously and in person\n\n● A willingness to grow and adapt with an exciting company in a high-growth space\n\nREQUIREMENTS\n\n● Experience in either management consulting or operations at a high-growth company\n\n● Demonstrated interest in crypto & blockchain space\n\n● Proven aptitude to manage many competing projects and priorities, with various levels of interdependencies\n\n● Exceptional powerpoint and excel skills; and an ability to pick up new tools/systems quickly\n\n● Outstanding verbal and written communication skills\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["operations","project","manager","non-tech","blockchain"]},{"job":"Web Marketing Manager","company":"Cash App","location":"San Francisco","post_date":"4d","link":"https://web3.career/web-marketing-manager-cashapp/39981","key":"39981","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nCash App is looking for an experienced marketer to found and own our Marketing Web channel. The role would work cross-functionally across Engineering, Product, Marketing, Creative and Design.\n\nDespite Cash App’s customer and revenue scale, we operate a lean Business team and this person would be a key stakeholder in driving our overall business strategy and performance.\n\nYou Will\n\n\nBuild and lead our Marketing Web discipline. You will be seen as responsible and accountable for the performance of the Marketing Web channel.\nRoadmap and prioritize how we execute against our objectives of maintaining brand reputation and trust, acquiring traffic, and optimizing performance of our surface areas.\nWork across our ecosystem of products and collaborate cross-functionally in order to deliver Cash App to consumers\nDefine marketing technology requirements needed to support our Marketing Web and work with our engineering teams to ensure successful implementation.\nLeverage experimentation and search optimization to maximize the performance of our channels. As Cash App evolves, you will be responsible for the ongoing optimization of our marketing web presence in order to optimize for our business goals.\nPartner with our analytics team to stand up Web measurement. Lay out the framework for measurement and reporting to monitor and improve the performance of our Web channel.\n\nYou Have\n\nQualifications\n\nHave 6+ years of experience in a marketing or analytical function related to Marketing Web\nHave a high degree of comfort with ambiguity, and a knack for quickly ramping on new skills and functions\nHave a track-record of demonstrating an extraordinary level of ownership\nExcellent communication and presentation skills. You can frame and distill complex information appropriately for different audiences.\nDemonstrated ability to collaborate with people outside your immediate team and get things done through influence rather than authority.\nHave strong quantitative and analytical abilities, including experience with business modeling and statistical tests. Familiar with analytical concepts such as attribution models, LTV, CAC, return on investment, payback periods).\nDeep experience and knowledge of web marketing tools across content management (Contentful/ Contentstack), web analytics (Google Analytics), experimentation (Optimizely/VWO/Google Optimize) , attribution/tracking (GTM, Appsflyer/Branch), and SEO (SEMRush/Ahrefs/Moz, Google Search Console, Screaming Frog)\nExperience with SQL and/or experience with analytical tools (Amplitude, Tableau)\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $184,100 - USD $225,000\n\nZone B: USD $171,200 - USD $209,200\n\nZone C: USD $162,000 - USD $198,000\n\nZone D: USD $152,700 - USD $186,700\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech"]},{"job":"Crypto Content Manager Remote","company":"Numbrs Self Custody","location":"United States","post_date":"4d","link":"https://web3.career/crypto-content-manager-remote-numbrsselfcustody/39980","key":"39980","details":"About Numbrs\nNumbrs Personal Finance AG (\"Numbrs\") is a Bitcoin company founded in 2013 and headquartered in Zug, Switzerland. The company provides a state-of-the-art Bitcoin storage account, the 'Numbrs Bitcoin Account', which guarantees an industry-leading and highly secure storage solution for Bitcoin custody and private wealth preservation for the 21st century. The Numbrs Bitcoin Account has been created in the spirit of Switzerland's long traditions of strict standards of privacy, neutrality and stability.\nOur Mission\nHere at Numbrs, we make it our mission to help clients safely navigate Bitcoin and other crypto markets by providing timely, cutting edge research and analytics, while offering the most secure Bitcoin storage solution literally backed up by military-grade encryption in the heart of Switzerland.\nJob Description\nNumbrs is hiring a content editor for its research publishing team. We're looking for candidates who live in the United States. We'll be accepting applications for this position until November 27th.\nWith a fast growing user base and a tremendous twitter followership and within our rapidly expanding organization, there's plenty of opportunity to have a significant impact now, and on the next chapter of the company. This is a job where you can really make your mark.\nAbout The Job\nAt many companies, research is just a fringe activity and not taken very seriously. At Numbrs., we live and breathe fundamental analysis through intellectual curiosity, in-depth research and a sharp mind. Our research is of utmost importance to Numbrs and its clients.\nIn addition to excellent (native) English skills and a curiosity for Bitcoin-related topics, you must be able to break down complex research topics and present them in a way that is understandable to a broad audience. The scope of our research on Bitcoin does not limit itself to its technology, but its geopolitical, social and economic impact. Since our entire focus is on distributing content on Twitter, you should have knowledge of Twitter and be able to handle time pressure well.\nThe content editor's responsibilities include writing content (usually online content) for a variety of articles, editing and proofreading, restructuring and revising content in various formats, and updating websites and social media pages. Will be expected to come up with fresh, original ideas, have some knowledge of SEO, and report on web traffic and user engagement.\nWe are an organization that strongly believes in fostering talents and providing them with the freedom to excel in a manner that they see fit. There are no daily required meetings or lengthy Zoom video calls. You will take full responsibility to manage your own time and structure your own work the way you see fit.\nThe core of your daily work is to distill down highly complex research topics from the Bitcoin space into short and clear articles and prepare them for a B2C audience. The number of articles is between 2-5 articles per day. The basis for your articles is prepared by analysts, you must be able to understand this input and be able to clearly write.\nBenefits & Compensation\nNumbrs pays in the top 10% of the industry based on Switzerland rates. Same position, same pay, no matter where you live.\nOur benefits support a life well-lived away from work. Ample time off and all the resources you need to support you in doing the best work of your career. All we ask is a reasonable 8-hour day and 40-hour work week, and we'll stay out of your way so you can do the best work of your career.\nHow To Apply\nPlease submit an application that speaks directly to this position. Tell us about yourself, about what you can bring to Numbrs. Tell us why you love writing, content creation and Bitcoin. Be descriptive, but don't feel the need to write a novel — 300 words or so should be plenty.\nWe're accepting applications until Sunday, November 20th, 2022, at 11:00PM CET.\nWhat Happens After You Apply\nWe expect to take a few weeks to review your application. You'll hear from us in November, about advancement to the interview stage. The chosen candidates will receive an at-home challenge. The exercise is representative of the kind of work we do, and it helps us understand how you'd approach new problems from scratch.\nThe final candidates will be invited to 2-3 interviews, all 30min, all remote, with your future colleagues, on your schedule. We'll talk through your background, your at-home challenge and dive into your professional knowledge. No surprises. We hope to make an offer sometime in November, with a flexible start date.\nPlease note that due to the number of applications we receive for open positions, we're unable to offer individual feedback during the screening process.\nThis is a demanding application process and significant, long-term career move to consider. We appreciate you giving us that consideration, and we promise to give you our full attention in return. We look forward to hearing from you!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","marketing","non-tech","copywriting","crypto"]},{"job":"Risk Operations Specialist","company":"Square","location":"MO St Louis US","post_date":"4d","link":"https://web3.career/risk-operations-specialist-square/39979","key":"39979","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nWe are looking for someone to join our Business Banking Risk Team. The Square Card Risk team provides technical support to cardholders who are initiating a transaction(s) dispute on a Square Card, and monitoring fraud on all Business Banking products. You will analyze transactions, deposits and monitor potential fraud activity and communicate with sellers in cases where additional information is required. You will complete case analysis, track metrics, and work directly with sellers to assist them through the chargeback process and ultimate outcome. Additionally, you will surface anomalies and identify process improvements to internal and external operations teams, data analysts and engineers.\n\nYou Will\n\n\nResearch and compile evidence to evaluate legitimacy of transactional logs\nIdentify potential fraud and risk-based activity that may affect Square and our sellers\nManage customer inquiries by email using a CRM tool\nAdvocate for sellers by identifying trends, issues and suggesting improvements to processes and products\nCommunicate with sellers, internal and external parties to ensure all service level agreements are achieved\nIdentify, document and escalate bugs to engineers and external partners\nManage end-to-end processes and ensure on-time delivery of important projects\nCreate partnerships with Product, Program Managers, all Risk teams, Customer Success, Counsel, Analysts and Engineers within Square\nBuild your knowledge of risk at Square, and the broader payments industry\nBring an inclusive, thoughtful attitude committed to finding solutions\n\nYou Have\n\nQualifications\n\n2+ years of banking experience\nBasic knowledge of products and services (checking, savings and Square Card)\nFlexible curious nature, comfortable with rapid change\nOrganizational, written and verbal communication skills\nA metrics-driven work >\nSuperb attention to detail\nExcellent time-management skills\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $34.09 - USD $41.68\n\nZone B: USD $31.73 - USD $38.75\n\nZone C: USD $28.99 - USD $35.43\n\nZone D: USD $25.58 - USD $31.25\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["operations"]},{"job":"Web3 Entrepreneur CoFounder","company":"Genius-X.co","location":"Zug","post_date":"4d","link":"https://web3.career/web3-entrepreneur-co-founder-genius-x-co/39977","key":"39977","details":"GeniusX is the Accelerator Program launched by the world-class team behind Genius Yield.\nAt GeniusX we foster innovations on Cardano by providing blockchain startups with all the tools they need to become successful. We advise, connect projects to relevant investors, mentors, and partners, provide business and technical guidance, assist in community growth, and more.\n\nStartups become a part of the Genius Yield and GeniusX ecosystem, providing an opportunity for global strategic partnerships and exposure to world top KOL's, as well as launching the project's native token on the exchange listing and through the GeniusX Launchpad.\n\nTo drive continued growth and effective organization of our portfolio projects, we are seeking to fill positions as\n\nWeb3 Entrepreneur, Co-Founder\n\nYour tasks & responsibilities\n\nYou will start working as a business co-founder in one of our portfolio projects.\n\nStructure the investment case with details and a business plan\n\nManaging the overall operations and resources of the company\nAnalyse the market and opportunities\nBuild the company and team from scratch with our support and guidance.\nDeveloping and driving the brand and business network into international markets.\n\nYour profile\n\nYou are a motivated executor and pragmatic entrepreneur\n\nIdeally, you hold a university degree (BA / Master) in entrepreneurship, business management, economics, or any other relevant subject. You can prove relevant strong experience.\nHaving an entrepreneurial mindset is crucially important, as is being able to work on your initiative. Excellent communication and leadership skills and brand-building capacities\nHumble and driven: you're not afraid of doing unpleasant tasks to get the job done.\nA real passion for DeFi / web3 / DLT / gaming\nYou have a strong interest in crypto or/and NFTs\nYou have an understanding of the B2B2C markets\nYou have a successful track record in driving digital product growth and a strong understanding of digital technology Relevant experience in B2B marketing, sales, and business development. Strong presentation skills to interact with diverse stakeholders Fully fluent in English\n\nBenefits\n\nExcellent business opportunity in an extremely fast, developing market\nA founding team with a clear vision\nParticipation in strategic decisions\nAttractive funding terms & stock package (depending on the stage of the venture when you start)\nLot of freedom in time and work location and open to all ideas and suggestions anytime. We are entirely result-driven.\nGrow with the company and shape its culture\nA broad network of strongly experienced advisors\n\nGenius-X.co focuses on Startups. Their company has offices in Zug. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://www.genius-x.co/\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Senior Solution Architect BNB Chain Web3","company":"Binance","location":"Canada","post_date":"4d","link":"https://web3.career/senior-solution-architect-bnb-chain-web3-binance/39976","key":"39976","details":"Senior Solution Architect (BNB Chain - Web3)\nCanada /\nEngineering – Blockchain Development /\nFull-time: Remote\n/ Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are looking for a passionate and experienced Senior Solution Architect for the BNB Chain Eco-system. In a short span of time, BNB Chain has become one of the largest public blockchain with more than 1,200 DeFi and dApps have been deployed in BNB Chain and attracted  more than 2 millions daily active users (addresses) in the peak time.\n\n\nThe successful candidate will join the innovative and fast changing field to build a new era of BSC multi-chain vision. The Senior Solution Architect will get involved in working with cutting edged Web2/Web3 partners to design and implement innovative blockchain solutions and solve technical problems on BNBChain.\nResponsibilities\nProvide technical & architectural guidance to Web2/Web3 partners and help design and develop the optimized strategies by deploying the right architecture\nServe as a key technical member of the Business Development team to define and implement technical and business strategies that will enable them to sell more of their offerings on the partners\nHelping to ensure partners success in building and migrating applications, software and services on the BNBChain\nDevelop and deliver compelling presentations, product demos, sample solutions, and discussions to drive awareness and adoption of BNBChain\nCapture and share best practice knowledge with the worldwide Blockchain community\nSupport the wider BNBChain Community with specialized workshops and training sessions\nRequirements\nDegree in Computer Science, Technology, Engineering, Math or 5+ year’s work experience in a technical role in lieu of no Bachelor’s degree\nHighly technical and analytical, possess 3+ years of blockchain solution architecture (implementation/consulting) experience\nExperience in architecting or deploying large scale Web3/Blockchain solutions like GameFi in enterprise customers\nExperience in designing, building, refactoring or operating large scale and impactful GameFi projects\nTech skills: Blockchain, Wallets Development, Web3, NFT, understanding fundamentals of blockchain infrastructure\nPresentation skills with a high degree of comfort speaking with executives, IT Management, and developers\nAbility to communicate fluently in English, in technical and business settings (verbal and written)\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["architecture","senior","nft"]}]}