{"jobs":[{"job":"Events Manager","company":"Block","location":"United States","post_date":"8d","link":"https://web3.career/events-manager-block/39779","key":"39779","details":"Company Description\n\nBlock is one company built from many blocks, all united by the same purpose of economic empowerment. The blocks that form our foundational teams — People, Finance, Counsel, Hardware, Information Security, Platform Infrastructure Engineering, and more — provide support and guidance at the corporate level. They work across business groups and around the globe, spanning time zones and disciplines to develop inclusive People policies, forecast finances, give legal counsel, safeguard systems, nurture new initiatives, and more. Every challenge creates possibilities, and we need different perspectives to see them all. Bring yours to Block.\n\nJob Description\n\nBlock is looking for a dynamic, creative, and organized individual to join the Executive Operations Event team. You will report into our Internal Events Lead, and take on a much-needed body of work collaborating with the Executive Operations organization on producing events and continuing to grow the internal event program that serves our distributed workforce. You will oversee the full collection of EO events, and support company-wide programs both in-person and virtual. Events will vary in size, location, and type - so you will plan multiple events at the same time across the globe!\n\nWe are looking for someone who has a natural passion for creating team experiences, building new things, enjoys taking on new tasks and projects, and someone who executes at a high level in an energetic and human-centric environment.\n\nYou Will\n\nManage events coordinated by the Executive Operations Team. Partner with EAs to produce team events including venue/vendor sourcing, communications, and overall logistics.\nSolve for current event needs at hand, propose scalable events solutions, and build a new and elevated event management resource for EAs at Block to partner with.\nBuild a more robust resource center for events which includes:\nEnhancing current program tools (tracking form, website, and slack channel) to identify more ways to educate users of the event program.\nBuilding a vendor database that houses event specific information (Catering, SWAG, Hotel, Venue, etc).\nCreating location-based guides and templates for more efficient planning.\nSolving for event storage and equipment.\nProvide in person event support for high-impact, leadership-focused, or large team events.\nManage budgets, vendor payments, contracts and operations, and reporting on spend to ensure payment for vendors.\nProject manage working teams per event (AV, IT, Workplace, Trust & Safety), providing clear direction to improve coordinated efforts and execution.\nPartner with Internal Events Lead to execute company-wide and core specific events.\n\nYou Have\n\nQualifications\n\n3+ years of experience as an events professional or creative role with transferable skills; ideally within fast-pace technology companies.\nExperience supporting a variety of different teams and programs within an organization.\nIntermediate/Advanced level understanding of event management scope and planning process.\nExperience tracking multiple events, hosting events within the workplace, planning offsite events, and vendor/hotel selection.\nStrong presentation skills that can be conveyed and coordinated to event partners.\nThe ability to organize and prioritize workflows, often interpreting data to guide decisions.\nExceptional written and verbal communication skills.\nFull proficiency with Google Suite, including Google Calendar, Docs, Sheets, Forms, and Slides. Bonus if experience with JIRA, Asana, and Canva (or other similar software/project management tools).\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $103,900 - USD $126,900\n\nZone B: USD $96,600 - USD $118,000\n\nZone C: USD $88,300 - USD $107,900\n\nZone D: USD $77,900 - USD $95,300\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["events","manager","non-tech"]},{"job":"Affiliate Business Development Manager India","company":"OKX","location":"Delhi","post_date":"8d","link":"https://web3.career/affiliate-business-development-manager-india-okx/39778","key":"39778","details":"About OKX:\n\nAt OKX, we believe our future is reshaped with technology. Founded in 2017, OKX is one of the world’s leading cryptocurrency spot and derivatives exchanges. OKX innovatively adopted blockchain technology to reshape the financial ecosystem by offering some of the most diverse and sophisticated products, solutions, and trading tools on the market. Trusted by more than 20 million users in over 180 regions globally, OKX strives to provide an engaging platform that empowers every individual to explore the world of crypto. In addition to its world-class DeFi exchange, OKX serves its users with OKX Insights, a research arm that is at the cutting edge of the latest trends in the cryptocurrency industry. With its extensive range of crypto products and services, and unwavering commitment to innovation, OKX vision is a world of financial access backed by blockchain and the power of decentralized finance.\n\nWe invest in our people as much as we invest in the technology. We are united by our engaging culture, here we win as a team, embrace changes, and do the right thing. We are committed to creating a friendly, rewarding and diverse environment to OKers. It doesn’t matter where you come from, here everyone feels valued, respected and has the same opportunities to develop and thrive — we want to bring out the best in you.\n\nWhat you will be doing:\n\nDevelop, manage, and optimize affiliate campaigns; Develop new affiliate network and improve the performance of existing affiliates\nMainly focus on expanding the influencer resources in local market (India), which could bring trading users and income to the platform\nDevise creative ways to identify potential affiliates\nOptimize the strategy of business develop and plan corresponding actions to ensure the conversion rate\nAnalyze user habits and user behavior, and judge the trend of business development\n\nYou’d be a great fit if you have the following skills:\n\nBachelor degree or above\nAffiliate marketing/ business development experience in the Cryptocurrency space\nExperience in building large affiliate networks from start to finish\nExperience with analytical tools and reporting such as Google Analytics and Amplitude\nUnderstanding of fundamental affiliate customer acquisition KPIs and optimization methods to improve performance through data analysis and segmentation\nFluency in local language: Hindi\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","sales"]},{"job":"Director of Global Events","company":"Consensys","location":"Remote","post_date":"8d","link":"https://web3.career/director-of-global-events-consensys/39777","key":"39777","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout Marketing\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and prizes ourselves on being defiantly optimistic.\n\nWhat you’ll do\n\n\nYou will define our global event strategy in partnership with executive stakeholders product and developer teams\nLead the events team, including the opportunity to build and grow the team\nCreate strategy to engage with, best leverage and streamline  third-party conference sponsorships\nTrack and report event KPIs\nWork cross-functionally with creative teams, product teams and various stakeholders within the organization to create accountability practices\n\nWould be great if you brought this to the role\n\n8+ years in event programming and management\nAbility to see the big picture, build a long term strategy, determine appropriate course of action, delegate to the right people and allocate resources to deliver effective, high quality event execution\nAbility to problem solve on the fly, proactively identifying potential challenges or barriers to execution, and delivering solutions for a successful event\nExperience with large, multi-day/multi-track conference programs\nStrong analytical and operational skills\nImpeccable communication skills, especially with regard to executive audiences\nGood multi-project management, prioritization, time management capacity\nAn ability to bring unique creative vision to life for compelling, engaging experiences\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n \n\n#LI-KB1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","remote","ethereum"]},{"job":"Director of Developer Marketing","company":"Consensys","location":"Remote","post_date":"8d","link":"https://web3.career/director-of-developer-marketing-consensys/39776","key":"39776","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout Marketing\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and prizes ourselves on being defiantly optimistic.\n\nWhat you’ll do\n\n\nDefine and execute the Developer Marketing strategy\nLead and grow the Developer Marketing Team. Provide coaching and career pathing for your team, and lead from a position of personal expertise.\nDesign and drive accountability for Developer Marketing reporting\nAlign with multiple teams to ensure consistent messaging and branding across the organization\nCoordinate support for developer events, developer community, developer relations teams with marketing strategies and campaigns\nBe a key part of an inclusive environment that fosters collaboration and creativity both internally and externally\nManage agency and contractor relationships\n\nYou are:\n\nAn experienced marketing professional who has the ability to create global marketing strategies.\nA seasoned marketer who enjoys keeping your finger on the pulse of a growing ecosystem, community and empowering others to use new technologies\nA great communicator and able to share information effectively across multiple mediums\nResults-driven with deep sense of accountability and the ability to drive projects from start to finish\nFocused on being a creative, flexible, and positive force when tackling multiple priorities\n\nWould be great if you brought this to the role\n\n5-plus years experience in marketing roles including Developer Marketing, Technical Product Marketing, Creative Director, Principle Marketing Manager or similar.  \nDeep understanding of the developer audience and experience creating developer campaigns and messaging to that audience\nExceptional communication skills; highly responsive and interactive with ability to rapidly process auditory and written information that can be technical in nature\nCreative, approachable, energetic, “can-do” attitude with ability to change direction in a dynamic environment\nExtreme attention to detail; ability to prioritize workload and complete multiple tasks in a timely manner\nPassion to have an impact\nAbility to pivot quickly and adapt to competing and ever-evolving priorities\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n \n\n#LI-KB1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","executive","marketing","non-tech","remote"]},{"job":"Director of Community","company":"Consensys","location":"Remote","post_date":"8d","link":"https://web3.career/director-of-community-consensys/39775","key":"39775","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. \n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. \n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. \n\nAbout Marketing\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and prizes ourselves on being defiantly optimistic.\n\nWhat you’ll do\n\n\nDefine a comprehensive developer community brand and programs, including naming, tiers, member benefits, budget requirements, marketing program strategy, content and resources strategy,\nDrive comprehensive developer community strategy to provide value to all stakeholders  \nDefine a comprehensive online community strategy \nAlign online community engagement with internal and external stakeholders\nLead the growth and nurturing of our community through several initiatives including Ambassador programs\nDesign and execute data-driven action plans for developing and growing new Community building programs \nEvaluate existing programs\n\nWould be great if you brought this to the role\n\nAn ideal candidate has a wide range of skills and is able to speak the language of software developers, marketers, and product managers, has previous experience with managing developer communities. \nThis is a cross-cutting role that interfaces with our developer relations, product, and marketing teams. As such, our ideal candidate has a wide range of skills and is able to speak the language of software developers, marketers, and product managers. 5+ years of working experience in developer communities. \nExcellent project management skills with proven ability to successfully manage and execute multiple projects with different priorities and stakeholders\nClear, thoughtful communicator (verbal and written) with strong interpersonal skills\nDemonstrated problem-solving and critical-thinking skills\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n \n\n#LI-KB1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","executive","remote","ethereum"]},{"job":"Product Lead Sr. Product Manager","company":"Molecule","location":"Remote","post_date":"8d","link":"https://web3.career/product-lead-sr-product-manager-molecule/39773","key":"39773","details":"Introduction\n\n\nMolecule’s story starts with patients and researchers. We imagine a world where patients directly fund researchers developing the next therapeutic breakthrough they need. A world where accessible, innovative therapeutics are created through collaborative drug development and fuelled by early R&D funding - operating at the intersection of biotechnology and decentralization, we are building the frameworks and platform to do exactly this. \n\n\nOver the past 12 months, we have grown our team from 3 to 20 and recently closed a $12.7m Seed round. Now, we are looking to expand our team with a Product Lead / Sr. Product Manager, well-versed in blockchain technology and web3 and excellent in Product Exploration and Discovery. \n\n\nAs this position will form part of the most centric part of what Molecule will build over the months and years to come, we will be as intentional as possible in the hiring process, using the following crucial aspects to proceed with any applications received: \n\n\nWhat we really want to see in you \n\n\nWe want to see a candidate that is excellent in Product Exploration and Discovery. You must be familiar with exploration and discovery processes, fallacies that can arise when consulting users for their feedback, and use different frameworks and technology to analyze the needs of users.\nYou are a well experienced Product Manager, preferably in companies with product-driven growth or start-ups, and with 6-8 years of experience.\nPreferably, you have experience in/understand web3 to a large extent. If not, we have developers and general web3 knowledge in-house to fill any web3 knowledge gaps. Of critical importance is the ability to build and execute good exploration processes and have strong scrutiny of feature ideas that arise within that process.\nYou are an analytical thinker and are able to break down needs, problems, processes, and existing structures into their individual parts.\nYou excel in project management and are a clear and concise communicator & facilitator between different stakeholders.\nYou have experience with software design and development processes, as well as agile methodologies.\n\nThe Role\n \nYou should be excellent in Product Exploration and Discovery.\nYou will work together with designers and the tech team in creating, evaluating, and implementing product feature ideas. We’re looking for someone with an obsession with the problem and user.\nYou must think about the uncertainties of implementing solutions and be aware of the scarce resources of e.g. Tech to be implementing things with the biggest impact and largest certainty possible. This is why Product Exploration and Discovery is the most important aspect.\nYou will decide how the product evolves, what to implement, and even more important, what not to implement.\nAdditionally, you must support any project management in implementing the solutions.\n\nOur offer to you\n \nA highly competitive salary.\nFlexible working hours across global time zones.\nAnnual leave days\nHobby leave days.\nMental health days.\nPaid travel to Europe and US for conferences.\nIf you need one, a brand new MacBook Pro is yours.\n\nEqual Opportunity \n\n\nWe are an equal-opportunity employer. We are committed to equality and weaving a community that values diverse perspectives and experiences and are actively seeking a diverse pool of applicants. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. \n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead","product","manager","non-tech","senior","remote"]},{"job":"Summer Engineering Intern","company":"21.co","location":"New York","post_date":"8d","link":"https://web3.career/summer-engineering-intern-21-co/39772","key":"39772","details":"21.co is the world’s leader in providing access to crypto through simple and easy to use products. 21.co is the parent company of 21Shares and Amun, and its mission is to build bridges into the crypto world.\n\n\n\n\n21Shares is the world’s largest issuer of cryptocurrency exchange traded products (ETPs) and is powered by Onyx, a proprietary technology platform used to issue and operate cryptocurrency ETPs for 21Shares and third parties. 21Shares mission is to make crypto easy.\n\n\n\n\nAmun is a blockchain infrastructure company focused on making purchasing crypto more accessible by offering a suite of tools for passive strategies across major DeFi platforms. Amun’s mission is to simplify your crypto journey.\n\n\n\n\nThe company was founded in 2018 by Hany Rashwan and Ophelia Snyder and is a global organization, with offices in Zurich and New York. Cathie Wood, Chief Executive Officer & Chief Investment Officer of ARK Invest is a board member.\n\n\n\n\nAbout the Role:\n\n\n\n\nWe are seeking talented Engineering Interns to participate in our 10-12 week Summer Internship program. This is a great opportunity for rising Seniors or Master’s students to gain valuable experience from a Global Crypto/Fintech organization. Our interns are embedded directly into our engineering teams, contributing immediately to impactful projects and constantly learning.\n\nOur culture is about diversity, communication, collaboration and education. We work together across continents, building amazing experiences and learning along the way.\n\n\n\n\nThis internship is a hybrid role (Mon-Wed in office) based in one of our offices, New York City or Zürich, Switzerland.\n\n\n\n\nWhat You Will Be Doing:\n\nWorking with various technologies to build unique products in the crypto/fintech industry\nCollaborate heavily with team members and other groups within a global organization\nGain experience in DevOps, Software Engineering, Blockchain, Product Management and Data Engineering\nLearn to create roadmaps and how to properly plan/manage product development\n\n\n\nWhat You Will Need To Be Great In This Role:\n\nStudents pursuing a BS or MS degree in Computer Science or related technical field with an expected graduation date of June/Dec 2024\nPassion for technology\nInterest in crypto/blockchain/ fintech technology\nExcellent verbal and written interpersonal skills\nProven leadership experience in an academic, extra-curricular or professional setting\n\n\n\nPlease submit an updated resume along with a Cover Letter for your application.\n\n\n\n\n(NYC only) Pursuant to Section 8-102 of title 8 of the New York City administrative code, the base hourly range for this role is $20.00 - $30.00. Total compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years & depth of experience, certifications and specific office location. This may differ in other locations due to cost of labor considerations.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["intern","entry","level"]},{"job":"Sales Account Executive","company":"Cobo","location":"United States","post_date":"8d","link":"https://web3.career/sales-account-executive-cobo/39771","key":"39771","details":"Cobo is Asia Pacific's largest digital asset custodian and blockchain technology provider, based in Singapore. Trusted by over 500 institutions and HNWIs to grow and protect their crypto assets, the company focuses on building scalable infrastructure and powering the Web 3.0 revolution around the world. As a strong blockchain and DeFi infrastructure builder, Cobo provides SaaS (Software-as-a-Service) products such as WaaS (Wallet-as-a-Service), DaaS (DeFi-as-a-service), NaaS (NFT-as-a-Service), and Argus (The Smart Contract Based Custody).\n\n\n\n\nResponsibilities :\n\n\n\nTo deliver on SaaS sales targets in the regional financial institutions, crypto funds, and blockchain companies. Doing so requires specific regional strategy, active sourcing of top priority opportunities, a healthy pipeline of leads, and ensuring self-discipline on sales methodology, CRM and forecasting\nBecome an expert at presenting how our product suite can bring value\nTo work cross functionally with internal departments, such as product, marketing, legal and compliance to facilitate a smooth sales process\n\n\n\nRequirements :\n\nAt least 2 years or more experience in B2B sales in Blockchain, financial services or fintech SaaS industry\nProven track records in sales / business development / client relationship management\nWell versed in blockchain product and market knowledge, highly passionate about Cryptocurrency and Digital Assets\nProficient verbal and written communication capabilities in English; Additional language proficiency would be a plus.\n\n\n\nHiring for candidates with residency in: Europe & USA\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","executive","nft"]},{"job":"Analyst","company":"Volt Capital","location":"San Francisco","post_date":"8d","link":"https://web3.career/analyst-voltcapital/39767","key":"39767","details":"Volt Capital is looking for an analyst to join the team. This individual will be working closely with the General Partner, venture partners, and the growing investment team on sourcing and analyzing investment opportunities in companies and protocols.\n\n\n\n\nResponsibilities\n\nResearching early-stage investment opportunities in companies and protocols\nAnalyzing emerging technical and crypto market trends\nCollaborating with the investment team on due diligence of potential investments\nSupporting existing portfolio companies with recruiting, market analysis, and product feedback\nWillingness to travel as necessary\n\n\n\nQualifications\n\nNative understanding of crypto and blockchain technologies\nAbility to identify emerging themes and trends in the broader crypto market\nIntense intellectual curiosity about crypto and decentralized systems\nAn analytical mindset, attention to detail and strong organizational skills\n1-3 years of experience researching, operating, or investing in crypto\n\n\n\nNice to haves\n\nA degree in a technical area (i.e. mathematics, engineering or computer science) and/or technical experience preferred\nA strong network within crypto\n\n\n\nHow to apply\n\nChoose one of the following topics to write a one-page, double spaced assessment on and answer the other with a brief paragraph.\n\nWhat is your favorite crypto protocol? Describe its mechanisms and 2-3 potential improvements to the model.\nChoose an emerging trend in the crypto space to write about. Describe events and developments that have led to this trend.\nWhen finished, send an email with your resume and the assessment attached to soona@volt.capital.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst"]},{"job":"Economics Tokenomics ResearcherBlockchain","company":"Safariblocks","location":"New York","post_date":"8d","link":"https://web3.career/economics-tokenomics-researcher-blockchain-safariblocks/39765","key":"39765","details":"Safariblocks is a privately-held company that researches, and builds blockchain-based financial instruments to advance financial health for consumers globally. Our products are built and hosted on the public, and borderless Algorand Blockchain Ecosystem. In collaboration with the Algorand Foundation, we are developing a protocol that includes a non-custodial all-weather crypto mobile wallet, a digital token and a custom asset tokenization web application.\n\nWe are looking for a Tokenomics Researcher to ensure that the protocol's token economy is healthy, and economically sound, while always generating sustainable rewards for all its participants. You will do this by creating economic models, testing it around the protocol's use-cases and applying economic metrics in meaningful ways to guide decision-making.\n\nWhat you will need:\n\nA bachelor's degree in economics, or political economics - Masters/PHD(highly advantageous but not necessary, can be substituted for previous considerable industry experience in the field).\nYou must be able to create practical economic models that interface with central bank money supply and the protocol's decentralized-finance integrations without breaking and ensuring constant liquidity, especially in times of economic stress.\n3+ years experience\nAbility to write computer modelling and simulation programs in Python. We use cadCad Python packages: https://cadcad.org/\nAbility to use computer spreadsheets, and generate data for decision-making around various reward programs executed by the protocol to its community and protocol participants\nAbility to get stuff done in the short timeframes, and iterate continously as requirements change\nKnowledge of global financial markets\n\nCompensation Structure: Base Salary(whose compensation range is included on AngelList profile), Performance Bonuses, & Equity Options\n\nCulture: 1. We are a remote-first and globally distributed team 2. We are fast-paced in our work processes 3. We allow OKRs to guide us 4. Always assume positive intent from your workmate(s) 5. Agree to disagree and commit 6. Honor your committments, your word matters 7. Accomplish more with less 8. Speak up! - be inquisitive and do not think in silos 9. Hold yourself and others to high standards\n\nSafariblocks focuses on Financial Services, Emerging Markets, Finance Technology, and Blockchain / Cryptocurrency. Their company has offices in Nairobi and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://www.safariblocks.com or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","non-tech","blockchain"]},{"job":"Staff Software Engineer","company":"RECUR","location":"Boston","post_date":"8d","link":"https://web3.career/staff-software-engineer-recur/39764","key":"39764","details":"RECUR is a technology company that designs & develops dedicated branded experiences that allow fans to buy, collect, and re-sell digital products and collectibles (NFTs). RECUR is the only blockchain-agnostic NFT platform ultimately giving its brand partners the widest range of distribution and their fan bases the widest range of utility. RECUR also co-authored the recurring royalty standard for NFTs, allowing for creators, artists, athletes, and brands to participate in the secondary sales of their assets in perpetuity.\n\nRECUR is seeking a Staff Software Engineer to join its team full time. This is an exciting opportunity to join a fast-growing team, where you will be designing and building the platform that powers our NFT eCommerce storefronts and marketplaces for some of the largest brands in the world in the nascent NFT space.\n\nWhat do we at RECUR believe makes a great engineering team?\n\nHere are our core beliefs:\n\nIt’s important to have team members that care about the team’s results more than their own individual achievements\nIt’s important for leadership to be tolerant of making mistakes\nIt’s important that the team members help, teach, and mentor one another\nIt’s important not to place blame on individuals when things go bad but instead to evaluate as a team how we do it better the next time\nIt’s important to be clear on what that mission is and minimize the distractions on the teams executing on that mission\nSmall teams execute better than big ones, empower small teams with ownership and minimize the dependencies between them\nIt’s important to encourage self-directed innovation\nWhat you will do at RECUR\nDesign, build, and ship a highly scalable, highly fault tolerant eCommerce platform\nExplore and present new technologies and approaches to the team\nFix, maintain, and enhance the product throughout its lifecycle\nWork on a small agile team of software engineers and product managers\nCoach and guide our co-ops, interns, and other junior members of the team\nDevelop high quality and maintainable software using a test driven mindset\nWhat you bring to RECUR\nYou have 8+ years of experience developing software\nYou have built and deployed software in a public cloud offering (preferably Amazon Web Services/AWS)\nYou have built and maintained highly secure, scalable, and reliable public internet applications. e-commerce, financial trading, or payment processing are a plus.\nYou have advanced working SQL knowledge and practical experience with popular relational SQL and NoSQL databases and concepts.\nYou have strong software development chops and deliver tested and scalable code in at least two languages such as JavaScript, Python, Java or Go and know how and when to apply functional and object oriented concepts\nYou have developed and deployed code in linux and have experience with containerization including Docker and Kubernetes\nYou have a passion for testing your code through automated unit and integration tests\nYou strive to be a productive engineer and use the latest tools and techniques to achieve this goal\nYou have experience building applications with Node.js\nYou are a strong communicator, able to succinctly describe technically complex problems\nYou learn quickly, are flexible, and do whatever it takes for the team to be successful\nYou are comfortable mentoring and coaching other members of the team\nYou have an interest in blockchain, cryptocurrency, and NFTs\nYou are legally eligible to work in the United States\nAdditional Details\nThe base salary range for this position is $170,000-$210,000. In addition to base salary, this position will be eligible for an annual bonus and is eligible to participate in RECUR’s equity program. The pay ratio between base pay and target incentive (if applicable) will be finalized at the offer. Keep in mind we are open to varying levels of experience which can impact total compensation. Even if you don’t meet all the requirements, we encourage you to apply!\nCommitment to being a remote-first company & embracing remote work best practices\nComprehensive insurance plans - health, dental, and vision + disability and life Insurance\n401(k) with 2% company matching, no waiting period\nFlexible Spending Account and Dependent Care Accounts\n4 weeks paid vacation, 11 company holidays, 3 floating holidays\nParental Leave - Primary & Secondary\n$100 per month stipend for internet & cell phone\nLearning and development reimbursement (including online courses, certifications, conferences, seminars, etc.)\nFree monthly subscription to Headspace, Gympass, Omada\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","nft","javascript","node","java"]},{"job":"YCombinator SS Blockchain Startup Post Pilot Seeks A Marketer to Publish our 50+ page research whitepaper","company":"Reputationaire","location":"Melbourne","post_date":"8d","link":"https://web3.career/ycombinator-ss-blockchain-startup-post-pilot-seeks-a-marketer-to-publish-our-50-page-research-whitepaper-reputationaire/39763","key":"39763","details":"Until we secure revenue or investment unfortunately this is an unpaid local or remote role. *\n\nReputationaire is a blockchain-enabled platform that allows users to import, store & exchange verified reputation data, to prove their credibility, while optionally remaining anonymous yet trusted.\n\nWe believe people should own not only their data, but more importantly the massive value locked away within their reputation they've spent time, money, sweat and tears building on services like Airbnb, Ebay and Facebook.\n\nWe're live in pilots with organisations helping refugees and migrants and IBM have awarded us $270k to help build our blockchain backed tech.\n\nAs an early stage award winning, YCombinator Startup School graduate startup with launched MVP we are seeking a Marketer.\n\nWe've just completed 2 years of research proving individual's online profiles correlate to real world \"gold standard\" BIG5 psychometric traits - we need someone keen to educate the world to help us publish this novel and exciting research in scientific journals that have already accepted our research.\n\nYou will be required to rewrite the research into the journals format - your name will then be published in the report!\n\nYour following tasks will be to then publicise and share the journals publication with our 600+ newsletter subscribers and on our socials and new and novel places you deem fit.\n\nYou'll be helping people directly improve their life situation by helping them prove they are trustworthy to secure a job, place to live, financial assistance or even a social circle.\n\nThis role has huge growth potential and requires an individual with natural self starter “hustler” qualities.\n\nWhat we expect from you\nYou have a strong results focus, including the ability to set and handle personal goals\nYou are excellent at presenting information through visual tools and techniques\nAbility to challenge the status quo in an appropriate manner\nSelf-motivated and enthusiasm to learn\nWillingness to be the one that always asks ‘why’\nExperience working in an agile environment\nSuperb communication skills, written expression and comprehension\nStrong organisation and facilitation skills\n\nBonus\nStrong, validated marketing experience in commercial product or bespoke software development\nKnowledge of blockchain technology\nPassionate about your online reputation\n\nThis is role has the capability of extreme growth in terms skills, responsibility, seniority and shaping the future of both Reputationaire and the reputation industry as a whole.\n\nYou will be given a supportive working environment, written ongoing mentoring from our team and a written confirmation on successful completion.\n\nCome join us on our Startup adventure to build a fair world with trust that's easy to prove!\n\nReputationaire focuses on Peer-to-Peer, Reputation, and Trusted Networks. Their company has offices in Melbourne. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://reputationaire.com or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","marketing","non-tech","blockchain"]},{"job":"Fullstack Developer – Blockchain","company":"Beamin","location":"United States","post_date":"8d","link":"https://web3.career/fullstack-developer-blockchain-beamin/39762","key":"39762","details":"Exciting opportunity at the crossroads of e-commerce and tech. We are a disruptive 3D NFT startup aimed at connecting Brands & products with their customers' through an interactive 3D NFTs. We are open to part time and full time developers.\n\n\n\n\nResponsibilities\n\nArchitect, build, maintain and improve Beamin’s web-based content platform.\nBuild scalable, performant, maintainable and well-tested web applications.\nDesign APIs that could be launched across various ecommerce brands and publishers.\nDesign, build and launch an official NFT ecosystem.\n\n\n\nQualifications\n\nWeb:\n\nBachelors or Masters in Computer Science or a related field.\nHands on 7+ years of strong web development experience building highly-reliable, mission-critical applications in java or related technologies.\nExtensive experience with frontend and backend development, with frequent production releases.\nFullstack: React, Node.js, Java, JavaScript, Python.\nAWS: Networking, S3, DynamoDB, EC2, Lambda.\nDatabase: PostgreSQL, MongoDB.\n\nBlockchain:\n\nExperience developing, deploying and running smart contracts in production on Ethereum mainnet or L2 sidechain (Polygon).\nProficiency in two or more of the smart contract languages, Solidity, Go or RUST\n\nGaming:\n\nPrior experience and understanding of gaming a big plus.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","blockchain","react","solidity"]},{"job":"Senior Product Security Engineer Offensive","company":"Coinbase","location":"Remote","post_date":"8d","link":"https://web3.career/senior-product-security-engineer-offensive-coinbase/39761","key":"39761","details":"We’re Coinbase. We’re the world’s most trusted way to join the crypto revolution, serving more than 89 million accounts in more than 100 countries.\n\nOur mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web 3.0 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.\n\nThere are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.\n\nReady to #LiveCrypto? Who you are:\n\nYou’ve got positive energy. You’re optimistic about the future and determined to get there.\nYou’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0.\nYou appreciate direct communication. You’re both an active communicator and an eager listener - because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.\nYou can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.\nYou have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.\nYou want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone.\n\nCoinbase’s mission is to build an open financial system, and our Security Team serves a vital role ensuring that system stays safe. On behalf of our customers, we store and manage more digital currency than any company in the world. The Product Security team exists to protect our outermost surface area to that digital currency: the web and mobile apps our customers use and love every day. Part Architect, part Engineer, part Evangelist, and part traditional Application Security, the Product Security team is tasked with doing what’s right to help the Product Engineering teams deliver default Secure products.\n\nWhat you’ll be doing:\n\nYou will prioritize and perform pen testing of cloud infrastructures, internal/external facing services, mobile and web applications\nAs a member of the Offensive security team, you will be responsible for Threat Modeling of applications, systems and/or services.\nYou will be responsible for supporting the development of processes and procedures to ensure cross-functional SLA’s are exceeded.\nYou will review and analyze existing code bases to uncover vulnerabilities, and provide teams with recommended fixes.\nAs a member of the Offensive security team, you will assist in the development of frameworks and tools to be leveraged during assessments.\nCollaborate with trusted partners to support scoping assessments, environment setup/configuration, project management, troubleshooting and vulnerability remediation\nYou will be responsible for triaging and support of the public Bug Bounty program. This will include, but is not limited to: tiered support, documentation, stakeholder management, risk ranking and researcher feedback.\nPick up other duties as assigned.\n\nWhat we look for in you:\n\nProgramming experience or ability in one of our core languages. At current inventory, we use Ruby (Sinatra & Rails), Golang, JavaScript (Server & client flavors), Java/C++ (physical trading engine stack), Python (Data/ML stack), and Swift/Kotlin (among others for the mobile stack). You don’t need to be a whiz, but we expect you to be able to perform secure code review of new features and/or services.\nFluency in a risk and threat modeling methodology. You don’t need to be able to rattle off everything in the CWE as you iterate through STRIDE, but structure and fluidity in your analyses will really help you communicate efficiently across teams.\nMobile or Web Application Security experience. Be it source code audit, penetration testing, bug bounty triage, or code reviews, you’ll be expected to examine code with security critical eyes.\nStrong written and verbal communication skills, specifically on security topics. The work our team does is consumed by a startling number of audiences, so being able to effectively communicate across those people will be invaluable in stopping confusion and saving roundtrips.\n\nNice to haves:\n\nExperience working in a high security and/or highly regulated industry. We would love to have you take the essentials of what you’ve learned and apply them to the unique challenges Coinbase faces in Digital Assets.\nIf you have open source security tooling to your name, we’d love to take a look and understand what problem you are solving and how your solution works. We heavily encourage Open Source contributions!\n\n#LI-Remote\n\nID: GP999\n\nCommitment to Equal Opportunity\n\nCoinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may viewPay Transparency,Employee RightsandKnow Your Rightsnotices by clicking on their corresponding links. Additionally, Coinbase participates in theE-Verify programin certain locations, as required by law.\n\nCoinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations[at]coinbase.com and let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).\n\nGlobal Data Privacy Notice for Job Candidates and Applicants\n\nDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","senior","remote","javascript"]},{"job":"Research Analyst Intern","company":"FutureMoney Group","location":"Remote","post_date":"8d","link":"https://web3.career/research-analyst-intern-futuremoney-group/39760","key":"39760","details":"Company Website\n\nhttps://www.fmgroup.xyz/\n\nJob Description\n\n\nConduct in-depth research on various blockchain projects.\nWork remotely with the investment team on assessing prospective investments.\nPrepare detailed comparisons, research pieces, and gap analysis reports of a variety of blockchain projects.\nYour Qualifications\n\n\nYou have excellent English written and verbal communication skills.\nYou have the ability to aggregate information from a variety of sources, including whitepapers, technical papers, discussion forums, etc.\nYou obsess with the future of blockchain technology and web3.\nYou have basic familiarity with Notion & Medium for collaboration w/ teams\nTechnical experience is strongly preferred\nComputer Science and Engineering students strongly preferred.\nHow to apply\n\n\nPlease apply by sending an email to and include:\n\n\nCV or links to LinkedIn, Github, or other network profiles\nA research written sample (500~ words)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","analyst","intern","entry","level","remote"]},{"job":"Director of Communications","company":"Ava Labs","location":"New York","post_date":"8d","link":"https://web3.career/director-of-communications-avalabs/39759","key":"39759","details":"We are looking for a Director of Communications to join the Marketing & PR Team at Ava Labs. This particular role will be an integral part of media relations strategy and growth for several mission critical verticals within the organization.\nWHAT YOU WILL DO\nOwn and drive communications strategy and operations for 2-3 core business verticals at Ava Labs\nCreate, craft and deploy strategic narratives to various media outlets with a crypto native audience\nEstablish strong rapport/relationships with cross functional collaborators and drive campaign development processes\nCollaborate with agency partners\nProactively develop and drive relationships that will grow media hits and overall market presence\nWHAT YOU WILL BRING\nBachelors Degree in Communications, Marketing or related discipline\n7+ years of professional experience\n3+ years of agency experience\n2+ years of in house experience\nStrong writing skills and the samples to prove it\nTrack record of success while working professionally in the blockchain industry\nExpert level media relations and strategy (launch) skills\nNatural ability to identify and pitch a story\nData driven narrative support\nSmooth pitch skills\n\nSalary Range: $166K to $197K (**This is not a guarantee of compensation or salary, a final offer amount may vary based on factors including but not limited to experience and geographic location.)\n\n#LI-Remote #LI-PA1\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Account Executive","company":"Satoshi Solutions","location":"New York","post_date":"8d","link":"https://web3.career/account-executive-satoshisolutions/39757","key":"39757","details":"🔔 Our client in the Crypto Space is looking for their next Account Executive!\n\n\n\n\n👉 Role: Account Executive\n\n📆 Position: Full-time, Permanent\n\n🤑 Salary: $150,000-$300,000 OTE\n\n🌍 Location: New York (Remote possibility)\n\n\n\n\nRequirements\n\n- 3 years experience in SaaS\n\n- Successful sales history of exceeding targets\n\n- Experienced in Crypto/Blockchain environment\n\n\n\n\nLearn more details and apply here:\n\n📩 hello@satoshisolutions.co.uk\n\n\n\n\nLive Web3 Vacancies:\n\n🚀 www.satoshisolutions.xyz\n\n\n\n\nReferrals:\n\n🤑 If you aren't looking but know someone that is, we pay $1000 for a successful referral!\n\n\n\n\n#blockchain #accountexecutive #sales #saas #satoshisolutions #vacancy #hiring\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","executive"]},{"job":"Community Lead Crypto FinTech Real Estate","company":"HoneyBricks","location":"Sydney","post_date":"8d","link":"https://web3.career/community-lead-crypto-fintech-real-estate-honeybricks/39756","key":"39756","details":"We’re looking for an experienced Community Manager to build and lead our community strategy and execution as we redefine real estate investing in digital assets.\n\n\n\nImmediate Responsibilities\nSet, plan and execute campaigns to grow the HoneyBricks community\nBuild a strong, engaged community and ‘Fly the flag’ as part of HoneyBrick’s mission through variety of channels including web, social media (twitter, reddit) and messaging platforms (discord, telegram)\nDesign and distribute engaging text, image and video content through these channels\nRespond to customers in a timely manner and support them to achieve their goals with HoneyBricks\nMonitor, track and report on feedback and online reviews\nOrganize and manage online events and webinars to boost brand awareness\nBuild relationships with customers, industry professionals and journalists\nProven work experience as a community manager or similar role\nInterest and working knowledge of crypto, fintech and real estate industries\nExperience planning and leading communities in both Twitter and Discord\nAbility to identify and track relevant community KPIs including website traffic, reviews and engagement\nAbility to work with product & marketing teams to identify potential customer issues and problems\nAbility to communicate and uphold online community guidelines\nPlay a foundational role in the company as we redefine real estate investing\nLead the online community at a high growth, venture backed company\nA fast-paced culture open to new ideas and rapid iteration\nAbility to help define a passionate, driven and accountable ‘remote-first’ culture\nFounding team equity, competitive salary and benefits/perks\n\n\nHow to stand out?\nSubscribe to our YouTube channel and join our HoneyBricks community https://discord.gg/UGP5uJnD\nShare one idea for improvement that we could be doing better in your application\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","finance","lead","crypto"]},{"job":"Community LeadBlockchain East Africa","company":"Safariblocks","location":"New York","post_date":"8d","link":"https://web3.career/community-lead-blockchain-east-africa-safariblocks/39754","key":"39754","details":"Safariblocks is a privately-held company that researches, and builds blockchain-based financial instruments to advance financial health for consumers globally. Our products are built and hosted on the public, and borderless Algorand Blockchain Ecosystem. In collaboration with the Algorand Foundation, we are developing a protocol that includes a non-custodial all-weather crypto mobile wallet, a digital token and a custom asset tokenization web application.\n\nWe are looking for an energetic Community Lead, with mid-level experience, to grow our community in East Africa. You will be developing community outreach programs, creating product awareness and depth in our East African communities. You will be leveraging our social media platforms and also scheduling offline events with the team.\n\nWhat you'll need:\n\nMinimum 3 years of related work / project experience in community, event, or social media roles.\nBachelor's degree in Marketing, Communications, PR or a related field.\nAbility to use Tiktok, Twitter, and Linkedin to drive a campaign around a product.\nHigh EQ, a love for building relationships and personal networks\nAlready a part of the Algorand Blockchain Community and Ecosystem.\nExperience developing, executing and optimizing integrated community campaign.\nExperienced in making, developing and implementations content for web3/blockchain brands.\nExperienced in making, developing and implementations of Community Events.\nExcellent interpersonal communication, writing, and organizational skills\nExcellent communication in English and Kiswahili, both verbally and in writing.\n\nWhat you'll be doing\n\nConceive and develop efficient and intuitive community strategies on our socials.\nCreate Planning and implementation for the community events and promotions (Online/Offline).\nCollaborating with stakeholders from across departments to ensure branding is consistent.\nCollaborate with stakeholders in preparing budgets and monitoring expenses around community events.\nResearch, write and promote strategies to targeted competitors and industry.\nReporting all data and analyzing the performance of social media campaigns\n\nCulture: 1. We are a remote-first and globally distributed team 2. We are fast-paced in our work processes 3. We allow OKRs to guide us 4. Always assume positive intent from your workmate(s) 5. Agree to disagree and commit 6. Honor your committments, your word matters 7. Accomplish more with less 8. Speak up! - be inquisitive and do not think in silos 9. Hold yourself and others to high standards\n\nSafariblocks focuses on Financial Services, Emerging Markets, Finance Technology, and Blockchain / Cryptocurrency. Their company has offices in Nairobi and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://www.safariblocks.com or find them on LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["community","manager","non-tech","lead","blockchain"]},{"job":"Director Capital Markets","company":"Block","location":"New York","post_date":"9d","link":"https://web3.career/director-capital-markets-block/39752","key":"39752","details":"Company Description\n\nBlock is one company built from many blocks, all united by the same purpose of economic empowerment. The blocks that form our foundational teams — People, Finance, Counsel, Hardware, Information Security, Platform Infrastructure Engineering, and more — provide support and guidance at the corporate level. They work across business groups and around the globe, spanning time zones and disciplines to develop inclusive People policies, forecast finances, give legal counsel, safeguard systems, nurture new initiatives, and more. Every challenge creates possibilities, and we need different perspectives to see them all. Bring yours to Block.\n\nJob Description\n\nAs a member of the Capital Markets team, you will play a key role in the strategic planning and capital markets needs of the various lending businesses within Block. Block has lending vertices that serve small businesses and vertices that serve consumers. Included are more developed products like Square Loans to small business and Afterpay receivables to consumers as well as newer products in development like Cash Borrow, Loans and Advances to International Square sellers.\n\nYou will be responsible for sourcing new institutional investors, managing the relationships with lenders, and designing new structures to help fund Block's newer lending products. Additionally, you will serve as a secondary point of contact for investors and lenders for Block's more mature lending products. You will support the continued expansion of Block's various lending businesses, and help product teams improve lending products across the Block ecosystem. You will report to the Head of Capital Markets.\n\nYou Will\n\n\nIdentify and establish relationships with new lenders and institutional investors for Block's various lending products\nManage relationships with prospective leverage providers and institutional investors\nDesign, document, and communicate new fundraising structures and strategies including forward flow arrangements, warehouse and other leverage facilities and securitizations\nWork with the Block Treasury, Investor Relations and Finance & Strategy teams to develop balance sheet limits for the various lending products\nCoordinate with the product team and other stakeholders to develop new and improve existing lending products\nWork with data team to understand loan performance metrics\nAttend relevant conferences and maintain relationships with key industry participants\nMaintain and own policies, operational procedures and risk oversight\nShare market color and investor sentiment with management and key stakeholders\nSupport initiatives to incorporate newer lending products into Square's de novo bank\nContribute to Block's growth strategy, product roadmap, and performance tracking\n\nYou Have\n\nQualifications\n\nA Bachelor's Degree in a quantitative field; MBA is a plus\n10+ years of relevant industry experience with institutional sales, debt capital markets, structured finance, and/or investor relations\nSuperior understanding of the lending and fin-tech industry\nLeadership skills with a proven ability to innovate\nExperience negotiating and closing loan sales agreements and warehouse lending agreements\nExperience with ABS securitization and working with rating agencies\nSuperior organization skills\nExcellent verbal and written communication skills\nExperience with structured fundraising deals\nExperience with SQL or Python is a plus\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $222,800 - USD $272,300\n\nZone B: USD $222,800 - USD $272,300\n\nZone C: USD $222,800 - USD $272,300\n\nZone D: USD $222,800 - USD $272,300\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"VP of Operations","company":"Paxos","location":"United States","post_date":"9d","link":"https://web3.career/vp-of-operations-paxos/39751","key":"39751","details":"Paxos is on a mission to enable the movement of any asset, any time, in a trustworthy way. Today’s financial infrastructure is archaic, expensive, inefficient and risky - supporting a system that leaves out more people than it lets in. So we’re rebuilding it.\nAs a regulated blockchain infrastructure company, we use technology to tokenize, custody, trade, and settle assets for enterprise clients like PayPal, Bank of America, and Interactive Brokers. Paxos is a top-funded blockchain company, with more than $500 million in total funding from leading investors like OakHC/FT, Founders Fund, PayPal Ventures, and Declaration Partners. Together, we empower today’s financial leaders to build a more open, trusted economy.\nThe Operations team is responsible for keeping our customer assets safe and secure as well as ensuring the smooth operation of our products. As a regulated fiduciary, the operations team operates at the highest level of excellence which enables our customers to trust us to power their financial systems and hold their financial assets.\nAs a VP of Operations, you’ll get to:\n\n\nOversee and grow a world class product operations group that allows the company to scale our growing global businesses.\nDrive the company’s ability to meet and exceed any existing and new product challenges as well as the standards set by regulators.\nResearch, develop and implement processing frameworks for the new products we are developing. Success is measured by securely supporting new products and features in a timely manner.\nLead cross functional efforts to improve and scale the way we run our operational processes\nManage external regulatory and audit relationships in a way that achieves the product operations and security objectives of the company.\nRecruit, train and develop a global product operations team that executes both day to day operations work and forward thinking projects. Paxos aims for perfect execution of operations procedures and high marks on regulatory exams, SOC reviews, internal audits and customer/partner due-diligence.\n\nYour experience should include:\n\n15+ years of experience in Product Operations\n7+ years growing, leading, and managing teams of 50+\nGlobal management experience in a high growth, fintech, regulated environment\nStrong background developing operational solutions for new products within the financial space.\nMeaningful experience in a high-growth startup experience, which can include a focus on other types of financial industry operations such as payments, brokers, neobanks\n\nWhat you’ll love about Paxos:\nPaxos has consistently been recognized on the Forbes Fintech 50, CB Insights Blockchain 50 and Built In’s “Best Places to Work” lists. Paxonians have significant ownership and impact on our business, as well as benefits like company equity, health insurance, family leave, a quarterly stipend for development, a stipend for home office setup and unlimited PTO. From team product demos and virtual lounge and learns to care packages and an active Slack #shoutouts channel, there are countless opportunities to connect and make your mark. Help us continue to build a new, open financial system from one of our three offices or right from your home!\nLearn more:\nCompany\n\nWeb 3.0 Is Still the Place to Be\nA Conversation with Paxos Product Leaders\nPaxos Raises $300M in Series D Funding at 2.4B Valuation\n\nCustomers\n\nPaxos & PayPal Bring Crypto to Millions of Users\nMercado Libre Reaches 1M+ Users in 60 Days With Paxos\nPaxos Was Built to Protect its Customers\n\nMedia\n\nCNBC Crypto World Interviews Paxos CEO on USDP stablecoin\nPaxos CEO Charles Cascarilla’s Perspectives on the Current State of the Global Economy\nYahoo Finance Interviews Paxos CEO on Testimony to U.S. Congress and Stablecoin Infrastructure\n\nOur Paxos team is made up of passionate people from all over the world with different perspectives and experiences. If this opportunity excites you, but your experience doesn’t perfectly match the description…apply! Unique voices help us build a more transparent and open economy.\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["operations","executive"]},{"job":"VP of DevOps","company":"Qredo","location":"Amsterdam","post_date":"9d","link":"https://web3.career/vp-of-devops-qredo/39747","key":"39747","details":"VP of DevOps\nRemote – Amsterdam /\nInformation Technology – DevOps /\nFull-time Remote\n\nApply for this job\nQredo is a decentralized digital asset management infrastructure and product suite designed to unlock new opportunities for institutional investors in digital assets and decentralized finance. Qredo's Layer 2 blockchain protocol enables users to seamlessly transfer and settle BTC, ETH, and ERC-20 tokens. Assets are secured by Qredo’s advanced Gen 2.0 multi-party computation (MPC), which provides tier-1 bank security and institutional-grade governance.\nResponsibilities\nManage and own the technical responsibility for Qredo's market-leading blockchain software solution\nProvide documentation resources for internal and regulatory consumption\nBuild a team of engineers and architects to further build and optimize the Qredo's infrastructure, platform and solutions\nLead the team to design and implement the DevOps architecture and automation solutions including but not limited infrastructure security, automated provisioning, CI/CD pipeline\nCoach the team to drive for results with continuous improvements on technical skills, architectural thinking and communication efficiency.\nRequirements\nMinimum 5 years experience in team management\nMinimum 10 years of experience as senior or principal development working on large-scale projects and architecture\nPrevious experience working within the blockchain / DeFi sector is a must\nWith experience and skills on Docker, Kubernetes, infrastructure design (networking, load balancing, CDN, middleware including but not limited to message queue - Kafka, RabbitMQ, etc), automation (Ansible, Terraform, etc) and CI/CD Pipeline (Jenkins)\nStrong hands-on experience on Cloud Platform and architecture such as AWS\nSolid knowledge on Cloud based security solution and architecture design and implementation\nCorresponding development experiences on micro-services based frontend and backend applications will be considered an asset. \nQredo Offers\nFlexibility to work from anywhere and possibility for international transfer\nAssistance with home office setup as well as offsite team building allowance\nCulturally diverse work environment (we speak 33 languages!)\nGreat career development opportunities in a growing company\nCompetitive compensation and benefits package within the industry\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["devops","executive"]},{"job":"Data Scientist","company":"Elementus","location":"United States","post_date":"9d","link":"https://web3.career/data-scientist-elementus/39746","key":"39746","details":"About us\n\nElementus is a data-first pioneer focused on solving the biggest challenges in crypto. Backed by the most comprehensive data set in the market and patented algorithms built to trace the flow of funds, we’re able to provide powerful visualization of on-chain activities and insightful analytics so our customers can unlock both the power and promise of blockchain.\n\nWhether starting out with compliance, looking to assess bad actor risk, or interested in valuable insights on which to build out a web3 strategy, our platform provides customers with a 360-degree view of data and the deep attribution capabilities needed to start and scale their business on the blockchain with confidence.\n\nWe are looking for an ambitious and self-motivated Data Scientist who shares our passion for blockchain data and the endless opportunities this data presents.\n\n\n\n\n\nThe Role\n\nWe are looking for gritty, technical Swiss Army Knives who are enthusiastic about quickly translating customer needs into elegant, stable, and performant software solutions. You should be comfortable interacting with the stack at every level, excited to move fast and exercise a bias towards experimentation and operate in a fast-paced, often opaque environment. Your job is to figure out what needs to get done and do it.\n\nCan you balance trade-offs between the speed of delivery and perfection?\n\nIs your code production-ready and a stable foundation for continuous iteration?\n\nDo you love working in new verticals, rolling your sleeves up, and solving fantastically hard data problems – often ones that have never been solved before?\n\nIf so - we want you on the team!\n\n\n\n\nCore Responsibilities\n\nProactively identify opportunities where data can enhance our understanding of Blockchain. Support the core of our data science process\nCollaborate with the engineering and business team to coordinate timely product delivery cycles\nBuild and maintain the operational toolbox for the data science team\nBuild, improve, and maintain the blockchain entities’ attribution knowledge base\n\n\n\nRequirements\n\nComfortable working with SQL/No-SQL databases and eager to learn graph databases\nAdvanced skills in at least one programming language such as Java, Python/Pandas, JavaScript/Node\nSolid understanding of blockchain technology\nAbility to read white papers, replicate and improve results\nCuriosity in creating proprietary graph algorithms as well as applying graph data science to blockchain data\nDegree in a technical or quantitative discipline, such as statistics, mathematics, physics, electrical engineering, or computer science (all levels welcome, from bachelor’s to doctorate)\nYou should be comfortable venturing into new and unknown directions while maintaining clarity of purpose. The problems we work on rarely have clean, definitive answers.\n\n\n\nStand Apart By Demonstrating\n\nCuriosity about blockchain and technology in general\nProactivity in identifying problems and asking the right questions\nResourcefulness in finding data sources and gathering data\nVersatility in attacking problems with different tools and from various angles\n\n\n\nCompensation\n\nThe base salary pay range for this position in New York City is $130K-$160K annually; however, base salary pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and Restricted stock units may be provided as part of the total compensation package, in addition to a full range of medical, financial, or other benefits, dependent on the position offered. This information is provided per the New York City Human Rights Law. Base pay information is based on market location. Applicants should apply via Elementus internal or external careers site.\n\n\n\n\nPerks\n\nMedical, Dental & Vision Insurance Coverage\n\nLife Insurance\n\nUnlimited PTO\n\nPaternal Leave\n\nFlexible Work Schedule\n\n9 Paid Holidays\n\nWFH Stipend to support your home office needs\n\n\n\n\n\nEEO Statement\n\nElementus is an equal opportunity employer and we’re proud of our ongoing efforts to foster diversity equity & inclusion in the workplace. Individuals seeking employment and employees at Elementus are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, disability, military or veteran status, or any other characteristics protected by applicable law.Elementus aims to provide reasonable accommodations for applications with disabilities and disabled veterans pursuant to applicable federal and state law. If you are an individual with a disability and require a reasonable accommodation to submit this application, complete any pre-employment testing, or otherwise participate in the employee selection process, please send an email to hello@elementus.io with your specific accommodation request.\n\n\n\n\nBy submitting your application, you agree that Elementus may collect your personal data.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["scientist","data","science","javascript","node","java"]},{"job":"DevOps Engineer","company":"JPG Store","location":"","post_date":"9d","link":"https://web3.career/devops-engineer-jpgstore/39745","key":"39745","details":"We are the biggest NFT Marketplace on the Cardano blockchain, forever expanding our team to include talented individuals from around the world. We truly believe diversity and inclusivity go hand in hand with the decentralized ethos of Cardano and aim to keep it as a key driver in our colleagues and partners.\n\n\nCurrently, we are looking for the next killer dev to join our team and help us do what we do; better! We are a fun and compassionate organization to work with and if you think the given responsibilities are something you can pick up; apply now!\n\n\n\n✔️ Responsibilities:\n\nBuild & maintain architecture that handles millions of requests every single day.\nWrite scalable, tidy and comprehensible code.\nImprove the developer workflow, create and maintain CI/CD pipelines and speed up the delivery processes.\nTroubleshoot user issues while coordinating with our all-star support team.\n\n✒️ Requirements:\n\nExtensive experience with Python & Typescript.\nFamiliar with deployment best practices (environment variable configuration, structured logging, etc.).\nWorking knowledge of basic infrastructure: cloud storage basics (object metadata, cache invalidation, etc.).\nBasic understanding of SQL.\nExperience working with Google Cloud service.\nPassionate about Cardano and an overwhelming desire to push the entire ecosystem forwards.\n\n🔥 Nice-to-haves:\n\nExperience with Rust.\nExperience decoding CBOR objects.\nExperience working with Cardano specific technologies such as blockfrost, cardano-serialization-lib and smart contracts.\nExperience with k8s.\n\n🤝 Team Requirements:\n\nConfident in communicating in English.\nAbility to critique our marketplace and convert it into actionable tasks to improve the product.\nSelf-driven and motivated.\n\n✨ Perks:\n\nHigher end of salary band.\nFlexible working hours.\nFully remote work.\nBudget for home office upgrades so you can get that ergonomic chair you’ve always wanted.\nMonthly wellness reimbursement for gyms, outdoor activities, therapists, massages, etc.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["devops","dev","nft","rust"]},{"job":"Quality Assurance Engineer Backend testing","company":"Binance","location":"Singapore","post_date":"9d","link":"https://web3.career/quality-assurance-engineer-backend-testing-binance/39744","key":"39744","details":"Quality Assurance Engineer (Backend testing)\nHybrid – Singapore /\nEngineering – QA /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe are flexible on location for this role.\nResponsibilities\nWork closely with team members (developers, product manager, customer support and partners) to develop, test and deliver high quality products\nPrevent, collect, analyze and track product defects\nCreate detailed, comprehensive and well-structured test plans and test cases\nManage project dependencies and risk mitigation\n\n\nRequirements\n3+ years experience in software testing methodologies, both manual and automated\nExperience in writing clear, concise and comprehensive test plans and test cases\nExperience testing backend services such as APIs, Databases, distributed services\nFamiliar with Linux and database operation: Mysql, SQLServer, Oracle\nFamiliar with test environment construction  by CICD, Spring Boot\nGood programming ability, master at least one of Java, Python and other programming languages\nStrong analytical and trouble-shooting skills\nExperience working in an Agile/Scrum development process and using collaboration tools, such as Jira, Trello, Slack, etc\nExcellent interpersonal, consultative and communication skills\nSelf-managed, proactive work >\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","quality","assurance","java"]},{"job":"Sr. Software Engineer Payments","company":"Stardust","location":"Palo Alto","post_date":"9d","link":"https://web3.career/sr-software-engineer-payments-stardust/39743","key":"39743","details":"Stardust is powering the Metaverse, an interconnected world of blockchain and NFT enabled games.\n\nWe're building the future of gaming - and we don't say that lightly. Think of us as the foundation for Metaverse economies connecting games, finance, the future of work, fashion and more. The infrastructure for Ready Player One if you will. We're developing backend technology to power new gamer-first economies.\n\nAs a SaaS, blockchain agnostic, platform – we offer a seamless “low code” integration of NFTs for game studios; and looking for players who think big, build bigger, and want to turn crazy ideas into reality.\n\nAre you ready to play?\n\nROLE\n\nStardust seeks a Sr. Software Engineer, Payments, to build and design our products. This person will report to the Head of Backend Engineer, and will leverage their professional experience and technical skillset; owning the payment systems and integration build out.\n\nRESPONSIBILITIES\n\nArchitect and implement performant payment systems/integrations for our core API and marketplace features\nMentor junior team members on best practices to approaching large ambiguous problems\nUse and promote communicable paradigms such as SOLID to improve team and product quality\nMigrate legacy systems to a scalable maintainable state\n\nQUALIFICATIONS\n\n6+ years of industry experience building distributed and scalable payment systems\nExpert knowledge of a backend language such as Javascript/Typescript on Node.js, Java, Kotlin, Python, or PHP\nExpert knowledge of payment gateway and ancillary service integrations\nExpert knowledge of Postgres (AWS RDS)\nExperience with distributed systems and relational databases\nAbility to write high-quality, well-tested code\nExperience using design patterns and other engineering best practices\nAbility to effectively articulate technical challenges and solutions\nDeal well with ambiguous/undefined problems; ability to think abstractly\nAbility to add code quality tools to systems e.g. linters, static analysis, profilers, remote debuggers\nAbility to synthesize requirements underlying feature requests, recommend alternative technical and business approaches, and facilitate engineering efforts to meet aggressive timelines\n\nBONUS POINTS\n\nFamiliarity with Stripe Connect, Payout, Tax, and Radar\nPassion for blockchain and / or games\nPrior experience in a high growth startup\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","nft","javascript","node"]},{"job":"Director Enterprise Channel Partnerships","company":"Halborn","location":"United States","post_date":"9d","link":"https://web3.career/director-enterprise-channel-partnerships-halborn/39740","key":"39740","details":"We are looking to bring in a Sales Director focused on Channel Partnerships for our Enterprise Verticals to join our growing sales team. This role will work closely with the Sales VP to build and execute our alliance go-to-market (GTM) plans across a service partner ecosystem.The Sales Director will develop and manage relationships with Service Partners, including Agencies and GSIs, to define and activate the services economy around Halborn, create greater service depth and breadth, co-innovate, reach new markets, and increase adoption and penetration of Halborn products.\n\nResponsibilities\n\n\nManage and grow relationships. Own partner relationships and build and manage more points of contact and influence deeper and across each partner.\nDeliver Joint Business Plan Annually. Plan and Manage QBRs across Partners with Halborn stakeholders (CSM, Sales, Marketing, Product)\nDrive and attain relationship KPIs including sourced and influenced deals.\nExecute against the Programs by owning onboarding and maintenance of relationships including influencing cross-functional support from marketing, product, product marketing, sales, and customer success.\nEnable account teams and partners through organizing training sessions, collateral creation, events, partner marketing, and other means to allow both organizations to work together smoothly.\nIdentify opportunities for Partners to influence and supply sales opportunities for Halborn, and assist sales execs on partner sales opportunities.\nEffectively communicate performance and status via scorecards, dashboards, highlights, updates, etc. that effectively drives the agenda to stakeholders and influencers\n\n\nQualifications\n\n7-10 years demonstrated track record of business development, alliance management, account management, and/or sales roles.\nStrong understanding of the marketing technology and services ecosystem to bring on new business in the technology space.\nPrevious exposure to the cybersecurity industry.\nProven ability to create relationships, drive value, drive outcomes and make things happen.\nComprehensive Understanding of different partner GTM and Organizational models.\nSome experience selling technology services to enterprises with blockchain, crypto or cybersecurity strongly preferred (but not required)\nConsistent and proven delivery of attaining revenue targets/goals and quota attainment as well as driving business growth.\nExtremely Well-versed in Retailer-specific marketing challenges and solutions landscape\nPassionate about forecast accuracy and sales hygiene. Dedicated follow up skills that allow nothing to fall through the cracks.\nStrong executive presence and great presentation skills along with high confidence in engaging with diverse decision makers. Prior experience selling directly to senior leaders and executives with the ability to influence.\nPowerful communication and interpersonal skills are critical. Highly articulate via phone, email and in person is a differentiator, along with a positive engaged approach to working collaboratively with internal and external colleagues.\nOrganizational agility in navigating and partnering effectively and leading cross-functional teams towards a goal\nStrong tolerance for ambiguity that is nspired by working in in a constantly changing and evolving work environment where growth is non-stop\nHigh self awareness and emotional intelligence\nWillingness to learn technical aspects of blockchain and cybersecurity\nAbility to travel up to 40%\n\n\nBonus Points:\n\nMulti-lingual\nPreexisting directory of contacts in the fintech, banking or blockchain industry\nKnowledgeable of the latest trends in Blockchain and DeFi\nKnowledge of Cybersecurity landscape and selling infosec services or products\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","executive"]},{"job":"Partner 20 Business Development Partner Crypto","company":"a16z","location":"United States","post_date":"9d","link":"https://web3.career/partner-20-business-development-partner-crypto-a16z/39739","key":"39739","details":"Partner 20, Business Development Partner, Crypto\n\nFounded in Silicon Valley in 2009 by Marc Andreessen and Ben Horowitz, Andreessen Horowitz (known as \"a16z\") is a venture capital firm that backs bold entrepreneurs building the future through technology. We are stage agnostic: We invest in seed to venture to late-stage technology companies, across bio + healthcare, consumer, crypto, enterprise, fintech, games, and companies building toward American dynamism. a16z has $35B in assets under management across multiple funds.\n\nWe’ve established a team that is defined by respect for the entrepreneur and the company-building process; we know what it’s like to be in the founder’s shoes. Our team is at the forefront of new technology, helping founders and their companies impact and change the world.\n\nThe Role\n\nThe Business Development Partner, Crypto will work with a16z Crypto portfolio companies as the go-to-market subject matter expert to help portfolio companies drive towards their ambitious growth goals. A successful candidate has a breadth of experience and knowledge across the blockchain and crypto landscape, including: NFTs and gaming; Web 3 applications / Layer 0, 1, 2 protocols; dApps; blockchain/crypto developer tools; exchanges; liquidity providers and market makers; and DeFi/Payments.\n\nThis individual will be on the crypto GTM Network team, reporting to the GTM Partner and working closely with the crypto General Partners, deal team, and other cross functional teams responsible for Crypto.\n\nThe ideal candidate will be an experienced, purpose driven partnerships professional who can help develop and guide the partnership strategy with both a16z portfolio companies and corporates that are interested in understanding the space.\n\nTo join our team, you should be excited to:\nDemonstrate understanding across the protocol layers, middleware applications, gaming and NFT players, DeFi and payments sector, and other divisions within the space\nHold proven partnership expertise with decision makers within the global crypto native organizations as well as traditional organizations\nExhibit critical thinking and embody a growth mentality to master the quickly growing space\nHave a perspective of how public vs private vs hybrid blockchain is used across organizations\nAdvise the a16z crypto portfolio companies on product market fit, GTM strategy, partnership plans, and pitch/presentation skills\nBuild a growing, global ecosystem comprised of both traditional and crypto-native organizations which are deemed as high priority for a16z’ success and GTM function\nDevelop workshops, content, and scalable programs to assist portfolio companies’ growth\nConduct introductions, meetings, corporate briefings, events, and conferences amongst the a16z network\nShare relevant market insights with a16z investment partners to better advise the market receptivity and the evolving investment thesis\nMinimum Qualifications\nHave a passion for blockchain technology, the crypto landscape, and the innovative potential this emerging area presents across several verticals\n4-6 years of business development experience with a solid understanding and knowledge of blockchain and overall crypto landscape\nHave existing insight into how blockchain and crypto is currently being used across Enterprise, Consumer, Public Sector, Financial, and Bio/Health organizations\nCommunicate at an executive level to share findings from portfolio companies and the network\nCollaborative and open work ethic, with a “we” mentality to help the broader firm succeed\nComfortable working independently in a remote environment to define OKRs and KPIs, and drive successful relationships with and for portfolio companies\nAbility to travel domestically and/or internationally for business meetings, if/when deemed safe\n\nThe anticipated salary range for this role is between $257,000 - 300,000, actual starting pay may vary based on a range of factors which can include experience, skills, and scope.\n\nThis role is eligible to participate in the a16z Direct Carry program and various discretionary bonus programs as well as benefit and perquisite plans including health, dental, vision, disability, life insurance, 401K plan, vacation, and sick leave.\n\n#LI-Remote\n\na16z culture \nWe do only first class business and only in a first class way\nWe take a long view of relationships, because we are in the relationship business \nWe believe in the future and bet the firm that way\nWe are all different, we recognize that, and we win\nWe celebrate the good times\nWe do it for the team\nWe play to win\n\nAt a16z we are always looking to hire the absolute best talent and recognize that diversity in our experiences and backgrounds is what makes us stronger. We hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, Veteran status, and any other status. These differences are what enables us to work towards the future we envision for ourselves, our portfolio companies, and the World.\n\nAndreessen Horowitz hereby reserves the right to make use of any unsolicited resumes received from outside recruiting agencies and / or individual recruiters without being responsible for payment of any fees asserted from the use of unsolicited resumes.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","crypto","nft"]},{"job":"Associate Product Manager UX","company":"Poloniex","location":"Boston","post_date":"9d","link":"https://web3.career/associate-product-manager-ux-poloniex/39738","key":"39738","details":"About Poloniex:\n\nWe believe the future of finance will be built on open protocols, decentralized infrastructure, and rapid innovation. Poloniex enables 24/7/365 trading and custody of digital assets. Since 2014, Poloniex has facilitated hundreds of billions of dollars in trades for millions of customers around the world.\n\nAt Poloniex, you will work on the cutting edge of open financial protocols and build systems and tools that enable scalable, high performance trading. All our teams have high standards and a dedication to delivering high quality, high value solutions that meet the needs of millions of global customers. Come join us as we build the future of finance!\n\nRole Description:\n\nWe are looking for an enthusiastic Associate Product Manager to join the Product team. You will have the full breadth and responsibility of a Product Manager while being supported and mentored on the Product process. You will be focusing on the UX/UI of our native apps on IOS/Android along with the overall web trading experience. As an integral part of the product team, you will help design, build, and maintain our global exchange products related to trading, staking, wallets, asset portfolio, NFT’s, DeFi, and helping us build the future of web 3.0 experiences.\n\nWhat you'll work on:\n\nOversee the product life cycle from ideation to implementation.\nDevelop a deep understanding of our target customer and market through market research, user analytics, and customer feedback to prioritize new features and projects.\nDeliver products and services that address market needs and customer pain points.\nCreate business cases, competitive and operational feasibility analyses, user journeys, user stories, and product requirements.\nGrow personally and professionally through mentorship, global experience, and hands-on learning.\nPrepare customer-facing teams to support product launches that further the product roadmap.\nBuild relationships with partners and stakeholders across the business and collaborate with cross-functional teams on high impact initiatives.\nWork closely with Engineering, Design, Security, Marketing, Operations and Data Analytics teams to support the product lifecycle and help make our vision a success.\n\nWhat you'll bring to the team:\n\nA passion for markets, crypto and learning about innovative trends in fintech.\nExcellent verbal and written communication skills, with the ability to work cross-functionally.\nHands on and passionate about improving the customer experience.\nYou are a compelling storyteller, adept at balancing anecdotes and insights with data in making decisions.\nYou're a self-starter - you don't need to work from a script and love to play in whitespace.\nYou're detail-oriented and prompt when it comes to putting plans into motion.\nStrong analytical skills and a data-driven mindset.\nYou are flexible and can adapt to changing priorities in a fast-paced environment.\nAbility to communicate effectively with people at all levels, from around the world.\nComfort shifting gears and working on an evolving product without having all the answers.\nChinese language skills are a plus.\n\nWe are an equal opportunity employer and value diversity at Poloniex. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nHiring led by a service provider located in the United States.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","design","nft"]},{"job":"Solutions Engineer","company":"SELF ID","location":"New York","post_date":"9d","link":"https://web3.career/solutions-engineer-selfidcareers/39736","key":"39736","details":"Solutions Engineer\n\nSELF ID is looking for a foundational Solutions Engineer to build out the client integration architecture & implementation process for our rapidly growing company. As a SELF ID Solutions Engineer, you will help integration partners to be successful in deploying the SELF ID platform. You will utilize your strong technical skills, business competencies and customer service orientation, provide the highest level of solution design, and deliver technical value to cross-functional teams, prospects and customers, to support growth goals.\n\nThis is a full-time role reporting to the CTO that can be held anywhere in the world.\n\nWhat you’ll do at SELF ID:\n\nCreate and deliver customer-centric solution designs, proposed architectures and business outcomes to all levels – developers, architects, CTO, and CIO\nWork with cross-functional teams including Business Development, Product and Engineering to share SELF ID’s vision with customers and prospects\nAdvise customers on use case patterns through discovery and requirements workshops\nTransform customer feedback into actionable product roadmap items\nWork with teammates and management to define technical selling strategy\nParticipate within the SELF ID and MDIP/Keychain.org community, share evangelism activities (blogs, meetups, industry events), and contribute to internal and external knowledge repositories\n\nQualifications:\n\n5+ years of professional work experience in a similar position, delivering solutions to business leaders and technical champions in the enterprise.\nDemonstrated problem solving and analytical skills.\nExperience in Solution Architecture/Engineering as a field of practice (an ability to listen to customer requirements, whiteboard and propose solution architectures, and be hands-on with the tech) to design, build, and demonstrate real business value\nHands-on experience developing on/with the Bitcoin blockchain (block explorers, Bitcoin Core, C++, Bitcoin RPC) with deep understanding of decentralized computing systems in general.\nHand-on experience with C++, Javascript, Python, shell scripts, Bitcoinjs-lib\nExperience with Hierarchical Deterministic (HD) wallets (BIP39, Seed Phrase, xpriv, xpub)\nExperience with Node.js/npm, Web Sockets/RPC\nExperience with Webview\nFamiliarity with the W3C standards for DIDs and Verifiable Credentials and Presentations\nExperience with IPFS, IPNS and knowledge of the supported key pairs (RSA, ed25519, secp256k1)\nExperience with AWS infrastructure (EC2, ELB, EBS), Linux distributions/development, Android,iOs and MacOS development.\nYou care about your colleagues, and you will get the job done together.\nYou are passionate about what you do and inspire people around you\nBachelor’s Degree or equivalent experience in a Technical Field\n\nBonus Skills:\n\nYou understand the challenges in identity authentication and orchestration and integration of enterprise platforms for identity in the enterprise\nExperience with, and interest in, open-source software and development practices\nExperience with Zero Knowledge Proofs (ZKP's) and ZKrollups\nExperience with the Ethereum Blockchain\nExperience with Solidity Smart contracts\nYou have made notable contributions to open source projects (please provide your GitHub or other repo handles and/or projects)\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","ethereum","javascript","node"]},{"job":"Software Engineer Intern Winter 2023","company":"Square","location":"San Francisco","post_date":"9d","link":"https://web3.career/software-engineer-intern-winter-2023-square/39735","key":"39735","details":"Company Description\n\nSince we first opened our doors in 2009, the world of commerce has evolved immensely – and so has Square. After enabling anyone to take a payment and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together. So we expanded into software and started building integrated, omnichannel solutions – to help sellers sell online, manage inventory, run a busy kitchen, book appointments, engage loyal buyers, and hire and pay staff. And across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow all in one place.\n\nToday, we’re a partner to sellers of all sizes – large, enterprise-scale businesses with complex commerce operations, sellers just starting out, as well as merchants who began selling with Square and have grown larger over time. As our sellers scale, so do our solutions. We all grow together.\n\nThere is a massive opportunity in front of us. We’re building a business that is big, meaningful, and lasting. And we are helping sellers around the world do the same.\n\nJob Description\n\nOur software engineers keep Square simple and make our users faster and smarter by giving them a designed payments experience and rich data surrounding each transaction. We're looking for engineers of all shapes and sizes, who are excited about building outstanding software and solving hard problems. Our challenges span many technologies, from web and mobile applications (iOS, Android) to server-side development (Java, Ruby). As an engineer at Square, you will work on a small team with people across engineering, product, and creative, building reliable, fast, responsive, and beautiful software.\n\nYou Will\n\n\nReliability: Ensure Square works right, every time, by using testing, continuous integration, and in-depth code reviews\nSecurity: Create interactions and APIs that promote trust, increase security, and make it harder to do the wrong thing\nAnalytics: Collect all the data around every transaction and turn it into tools that help our users\nProducts: Envision entire new products, features, and flows that are inspired, considered, and magical\nFraud Prevention: Make quick decisions on millions of dollars which requires diligence and passion for detecting bad actors and preventing loss\n\nYou Have\n\nQualifications\n\nPursuing degree in Computer Science, Electrical Engineering, Math or related technical field, graduating between December 2023 and May 2025. Recent bootcamp graduates and engineering training participants are also considered within six months of completing program/training requirements\nProgramming experience in one or more object-oriented languages such as: Java, Python, Ruby, Go, Kotlin, Swift, C, and C++\nSquare internships are 12-weeks and co-op placements are 16 weeks, available for Winter 2023\n\nAdditional Information\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on the candidate's work location and may be may be modified in the future\n\nZone A: USD $46.00\n\nZone B: USD $43.70\n\nZone C: USD $41.40\n\nZone D: USD $39.10\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","intern","entry","level","ruby","java"]},{"job":"Director of Developer Marketing","company":"MetaMask","location":"Bhopal","post_date":"9d","link":"https://web3.career/director-of-developer-marketing-metamask/39734","key":"39734","details":"Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society.\n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.\n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nAbout Marketing\n\nCreatives at ConsenSys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and prizes ourselves on being defiantly optimistic.\n\nWhat you’ll do\n\nDefine and execute the Developer Marketing strategy\nLead and grow the Developer Marketing Team. Provide coaching and career pathing for your team, and lead from a position of personal expertise.\nDesign and drive accountability for Developer Marketing reporting\nAlign with multiple teams to ensure consistent messaging and branding across the organization\nCoordinate support for developer events, developer community, developer relations teams with marketing strategies and campaigns\nBe a key part of an inclusive environment that fosters collaboration and creativity both internally and externally\nManage agency and contractor relationships\n\nYou are:\n\nAn experienced marketing professional who has the ability to create global marketing strategies.\nA seasoned marketer who enjoys keeping your finger on the pulse of a growing ecosystem, community and empowering others to use new technologies\nA great communicator and able to share information effectively across multiple mediums\nResults-driven with deep sense of accountability and the ability to drive projects from start to finish\nFocused on being a creative, flexible, and positive force when tackling multiple priorities\n\nWould be great if you brought this to the role\n\n5-plus years experience in marketing roles including Developer Marketing, Technical Product Marketing, Creative Director, Principle Marketing Manager or similar.\n\nDeep understanding of the developer audience and experience creating developer campaigns and messaging to that audience\nExceptional communication skills; highly responsive and interactive with ability to rapidly process auditory and written information that can be technical in nature\nCreative, approachable, energetic, “can-do” attitude with ability to change direction in a dynamic environment\nExtreme attention to detail; ability to prioritize workload and complete multiple tasks in a timely manner\nPassion to have an impact\nAbility to pivot quickly and adapt to competing and ever-evolving priorities\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/).\n\n#LI-KB1\n\nMetaMask focuses on Cryptocurrency, Blockchain / Cryptocurrency, and Web3. Their company has offices in San Francisco, London, Brooklyn, and Remote. They have a small team that's between 11-50 employees.\n\nYou can view their website at https://metamask.io or find them on Twitter.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","executive","marketing","non-tech","ethereum"]},{"job":"Web3 Senior Backend Go 100K Full Remote","company":"Lity","location":"","post_date":"9d","link":"https://web3.career/web3-senior-backend-go-100k-full-remote-lity/39733","key":"39733","details":"Cett entreprise rend l’infrastructure blockchain simple pour les investisseurs et les développeurs, en accélérant la décentralisation du web.\n\nLa start-up gère plus de 8,500 validateurs avec $400M d’actifs sous gestion. Elle déploie ses validateurs sur 3 clouds différents partout dans le monde.\n\nLa plateforme SaaS supporte les projets Web3 les plus importants comme Ethereum, Solana, Polkadot, Cosmos, Tezos et bien d’autres, en composant avec des problématiques d’infrastructure, de sécurité et de software au quotidien.\n\nL’équipe est composée de passionnés de l’écosystème anciennement employés chez Google, Circle, Ledger, Chainalysis, Polygon et d’autres.\n\nVos missions\n\nWe’re looking for someone to be a Senior Back-end Engineer. In this role, you’ll be responsible for:\n\nBuilding the product: You’ll be working closely with the Product and Infrastructure teams to plan, architect, and implement our core product. You’ll take part in the construction of the roadmap, with the rest of the team. In this role, it includes:\nDevelopment of data aggregators for blockchains\nDevelopment of new Golang micro-services within our stack\nTaking part to automation & deployment processes\nFramework development\n\nOwning what you build: As you architect, test, and refine the platform, you will ensure that our services communicate with each other seamlessly, have minimal downtime, and recover quickly (daytime, no on-calls)\n\nHelping grow the Team: Everyone on the early team plays an important role in attracting, closing, and growing other talented team members. You can also mentor or brainstorm with other backend developers.\n\nStack :\n\nMostly in Golang with a bit of Javascript and Typescript\nCommunication between services is done using HTTP Rest and most of our databases are backed by PostgreSQL\nEverything runs in EKS (Elastic Kubernetes Service) on AWS\nVos compétences\n\nSkills & background\n\nStrong judgment with the ability to ship opinionated architectural choices and code, and to share software best practices\nStrong communication skills both in French & English to facilitate design scalable architectures with SREs\nStrong technical skills with Golang (over 2 years of experience)\nOver 5 years of experience designing, building, and deploying user-facing, infrastructure related, and/or API-based products\nExperience coding in Javascript and Typescript is a plus\nExperience working with container technologies such as Docker, Kubernetes, and with Continuous Integration is a plus\nFamiliarity with Hashicorp Vault is a plus\n\nSoft skills\n\nCuriosity and ability to dig into a topic and follow through\nTeam spirit: discuss, do not try to impose\nBe pragmatic to not over-engineer unnecessarily: startups need to quickly adapt\nOwn what is coded and shipped to production\nTrust & clear communication\nReal interest about the blockchain and cryptocurrency space\nAvantages\n\nA fast-paced, no bureaucracy work environment\n\nEquity Share Options in the business: if the company succeeds, we all succeed!\nCompetitive Salary\nUnlimited holiday\nChoice of IT equipments\nFlexible/remote working\nSignificant personal development and wellness budget\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","backend","golang","senior","solana"]},{"job":"Talent Acquisition Lead Remote","company":"metaschool","location":"Singapore","post_date":"9d","link":"https://web3.career/talent-acquisition-lead-remote-metaschool/39732","key":"39732","details":"Acquiring talent is also a talent! Metaschool is looking for such an individual who has an eye for the 10x people of their fields and has hands-on experience with end to end recruitment for business and tech roles.\n\n\n\n\nThere are 30M developers in the world but only 24k devs are actively contributing to the web3 ecosystem as of now. Blockchain and protocol companies need more devs in web3 to survive and thrive. Metaschool helps these companies by building fun, free and exciting projects for web2 devs to propel to web3. Find this exciting? Keep reading.\n\nWorking at Metaschool\n\nMetaschool produces courses for devs to build, ship and learn web3. We have over 70K devs signed up from 50+ countries within 5 months of launch.\n\n\n\nWe’re a decentralized, remote-first company with teammates based in Singapore, India and Pakistan (for now 😉). We are divided by borders but our common mission to help devs build and flourish in the web3 ecosystem has brought us very close. If you are in any timezone of Asia and are a web3 native, we would love to have you onboard.\n\nOur Values\n\nBuidl dope shit!- We care about what you have built, not your degrees or FAANG experience.\n\nStay weird -Own yourself, be yourself! Diversity is our strength!\n\nImprove daily -Daily efforts compound. Don’t underestimate them.\n\nDevelopers come first -We are building for devs. Put them first, always!\n\nLearners for life -Leave your ego outside, learn whenever you can.\n\nCollaborate to win -If you want to go far, collaborate and go with a team.\n\nIn the role you will:\n\nBe the face of Metaschool as a world-class employer\n\nProvide your expertise in attracting the top talent and strategizing the sourcing methodologies to create a global pipeline of potential candidates who themselves are leaders in their respective industries.\n\nDigitize the talent acquisition process to ensure world-class candidate experience\n\nCreate an evaluation criteria for interviews and assessments to hand pick the best of resilient and hustlers\n\nBe partnering with the business leaders to ensure adherence to the SOPs of recruitment and be on the right track of acquiring talent on strict timelines and hiring metrics.\n\nBe a strong advocate for Metaschool’s value props and ensure a culture fit check-list for each potential colleague entering the space\n\nYOU\n\n3+ years of experience as a Recruiter. Generalist experience is a plus\n\nExcited to work independently and embrace the make-it happen attitude\n\nHave managed end-to-end recruitment for business and tech roles for multiple markets\n\nExcellent influencing and interpersonal skills are essential to your success\n\nPassionate networker and truly inquisitive\n\nIf any of the above doesn’t apply to you and you still strongly feel you can do it. Don’t let us stop you.. Please apply for the opportunity.\n\n\n\n\nPerks\n\nWe have an important mission to help devs enter web3 and bring the power back to the individuals. At Metaschool, you will have exposure to product, business, growth, technology and everything in between. Additionally, you will get:\n\n\n\nCompetitive Salary\n\nGenerous Equity\n\nHealth Insurance\n\nPaid Time off\n\nWorkstation Allowance\n\nMultiple Tech subscription(s) to make your life easier\n\nAnd an amazing bunch of weird frens!!\n\nWe are so excited to see you around. Don’t forget to apply!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","lead","recruiter","non-tech"]},{"job":"Founding Blockchain + Smart Contract Engineer EVM Solidity","company":"paraform","location":"San Francisco","post_date":"9d","link":"https://web3.career/founding-blockchain-smart-contract-engineer-evm-solidity-paraform/39731","key":"39731","details":"SALARY: $140,000-$210,000\n\nLink to apply and be considered for this role: https://www.paraform.com/company/axel/cl6r10v6u08850glb88lr6pjz/apply\n\nAbout Axel\n\nAxel builds developer infrastructure for the future of finance. We’re unlocking financial freedom for everyone, starting with the developer. As the leading universal and composable decentralized finance infrastructure platform, we’ve built the world class developer tooling needed to make building on the blockchain frictionless.\n\nOur culture is at the core of everything we do. We're obsessed with building teams that are intentional about what they create and empathetic through their process. We know that Axel is not possible without trailblazing, caring, and collaborative visionaries, so we've curated an environment that makes you excited to come to work each day and build a product we're all proud of — together.\n\nAxel is extremely well funded from phenomenal investors and some of the brightest minds in technology, giving us many years of runway and the ability to pay competitive salaries, offer great benefits, and provide meaningful equity.\n\nThe Role\n\nAxel is building out smart contract infrastructure to scale our financial platform. As one of our initial smart contract engineers, you will be joining a team of hyper talented engineers to architect and build protocol infrastructure, proxy and interface contracts, open-source smart contract libraries, and more. You'll be responsible for bringing the same level of security, speed, and stability from our existing financial infrastructure platform to our smart contract infrastructure. The contracts you build will quickly become a platform for thousands of teams to millions of users globally.\n\nAt Axel, we believe the magic happens when we’re in person. Our headquarters are based in Silicon Valley. If you are not based in the Bay Area and want to be IRL with the team, we can help you relocate or fly you to the HQ on a regular basis.\n\nWhat You’ll Be Doing\n\nBuild leading blockchain infrastructure. You’ll be building out Axel’s core smart contract adapters and proxy/interface contracts to support our API, as well as Axel’s public smart contract libraries.\n\nScope and lead complex technical projects. You’ll architect and design smart contracts with an emphasis on readability, security, performance, and scalability.\n\nArchitect simple solutions across complex systems. You’ll be driving standardization in crypto protocols by defining and designing seamless interfaces.\n\nMaintain world class security. You’ll write, deploy, and test secure smart contracts and maintain them in production.\n\nSet new standards for financial innovation. Build secure smart contract protocols and backend services to support Axel’s APIs and connect Axel’s developers with the decentralized finance ecosystem.\n\nPlay as a team. At Axel, engineering is a team sport. In a week, you might mentor other engineers in high leverage Solidity/EVM topics and best practices, or you might be pair programming with other engineers. We're looking for builders who are committed to working together to build an incredible product.\n\nLead by example. Develop and take ownership on best practices for EVM protocol upgrades and versioning across different networks.\n\nWhat We're Looking For\n\n2-4 years of backend development experience\n\n1-2 years of Solidity smart contract development, including mainnet production deployments of non-trivial protocols and related security audits\n\nBackground in Computer Science or a technically related field\n\nProficiency with Solidity, the Ethereum Virtual Machine (EVM), wallet interfaces, and RPCs\n\nExperience designing, building, testing, deploying, and maintaining high traffic smart contracts\n\nExperience with cutting edge developer tools, such as Hardhat, Foundry, Solmate, Ganache, and/or Truffle is preferred\n\nAbility to balance shipping quickly with building secure, robust, scalable infrastructure\n\nExperience working with startups and fast-paced, ambitious environments\n\nPassion for decentralized finance and blockchains\n\nA “can-do” hustler mentality, being a former founder, or building side projects is a huge plus\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain","smart","contract","solidity","ethereum"]}]}