{"jobs":[{"job":"VP Engineering Product Head of Technology","company":"Shelterzoom","location":"Remote","post_date":"5d","link":"https://web3.career/vp-engineering-product-head-of-technology-shelterzoom/39925","key":"39925","details":"Job Description: VP, Engineering & Product / Head of Technology, ShelterZoom\n\n\nShelterZoom is an emerging and leading Web3 organization working with the Fortune 500 companies and many other leading organizations. \n\n\nAt ShelterZoom we envision a world with a Single Source of Truth (SSOT) for the internet and digital universe that is people centric to empower people and every organization to serve humanity and future generations in the new business era.  \n\n\nWhat we’re looking for:\n\n\nYou will be part of the ShelterZoom's Management Team and will report into the CEO. \n\n\nThis individual will shape the technical vision for ShelterZoom. to build and oversee an ecosystem of strong developers and entrepreneurs, work alongside those in the broader community to complete projects for many key partners. \n\n\n\n\nWhat you’ll be doing:\nSet a technical strategy and direction for ShelterZoom \nUnderstand the current capabilities of ShelterZoom from an overall technical perspective, and what its future technical capabilities should be. \nUnderstand the wide range of blockchain protocols and translate potential learnings into project proposals and initiatives for ShelterZoom roadmap. \nLead and manage the technology planning, budget, evaluation and decision of projects, with emphasis on cost/benefits analysis. \nWork with PMO to put together processes for reviewing and evaluating different proposals, and provide recommendations to the CEO for project funding and technical integrations. \n \nBuild up an ecosystem of developers and entrepreneurs for ShelterZoom\nUnderstand the current capabilities of ShelterZoom \nUnderstand what competitors and similar projects do in terms of tooling & libraries for developers and entrepreneurs.\nPut together a roadmap and processes for implementing projects with partners.\n \nProvide oversight of the technology ecosystem\nHire, inspire and work closely with engineering teams, made up of project managers and developers (internal or external) to ensure the delivery of the platform and products and oversee the full lifecycle.\nLead and manage the technology planning, development and post-development process of critical projects (including QA and protocol audits).\n \nCollaborate and communicate with  ShelterZoom on current and future technical efforts\nCoordinate and drive the business relationships with key internal and significant external partners within the technology ecosystem\n \nSupport internal IT & security for ShelterZoom by creating and overseeing processes to enable security & IT to work for ShelterZoom\n \nDefine, monitor and report on KPIs and IT budgets to assess technological performance.\n\n\nRequired Experience:\nBachelor Degree in computer science, computer engineering or related fields (Masters preferred but not essential). \n5+ years as a CTO or VP of engineering, focused on working with external developers and growing an open-source developer community.\nExperience in building and leading a high performance team of Golang/Backend developers, blockchain developers, frontend developers, DevOps and QA engineers. \nDeep product knowledge of document and contract management solutions\nDeep knowledge and understanding of blockchain technology, cryptography, related use cases and blockchain industry developments (e.g., Hyperledger Fabric development, understanding how smart contracts work across multiple platforms).\nHas managed the delivery of a successful enterprise blockchain application project.\nHas a track record of working effectively with other senior managers, technical and non-technical.\nWhat you are like:\nYou are comfortable in navigating and leading teams in a decentralized environment across different stakeholders.\nYou have strong analytical, communication, and problem-solving skills.\nYou are focused on achieving goals in a fast-paced and result-oriented environment.\nYou have an entrepreneurial mindset and \"getting things done\" mentality.\n\n\nIf you cover a large part of the requirements and have a strong background in IT engineering and architecture as well as a focus and passion for distributed systems and blockchain technology, we are looking forward to receiving your application.\n\n\n\n\nWork at the ShelterZoom \n\n\nShelterZoom is striving towards a leading Web3 blockchain-enabled better future, based on inclusiveness and transparency. Our ambition is to build a Web3 future.  \n\n\nWe can only achieve our goal with the best talent!  \n\n\nWe are attracting high-performing individuals who think outside the box and will take us to new heights. If you are up for unlocking opportunities and create value with relevant experience, we would love to hear from you.  Join us and become a driver for the future and positive change !\n\n\nBenefits:\n- Competitive compensation package\n- Stock option plan\n- Open minded, collaborative and diverse culture with truly human values\n- Equal opportunities at any time in respectful, fair and conscious surroundings\n- Learning and development opportunities to strive for your individual goals\n- Flexible and remote working to ensure a good work life balance where wellbeing matters\n\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","architecture","backend","devops","product","manager"]},{"job":"Web Presence Design Lead","company":"Chainlink Labs","location":"Remote","post_date":"5d","link":"https://web3.career/web-presence-design-lead-chainlink/39924","key":"39924","details":"Web Presence Design Lead\nRemote – United States / Remote /\nDesign /\nRemote - Full-time\n\nApply for this job\nAt Chainlink, we put our users first, focusing on consistently bringing innovative, world-changing products to market to serve millions of people every day. \n\n\nWe're designing tools and services that enable our users to build, run, scale, and integrate decentralized apps (DApps) in a trust-minimized world. That's where you come in: we're looking for a Web Presence Design Lead for the small but mighty Web Presence team. \n\n\nWe design and build the first impression of Chainlink and obsess over every pixel because we intuitively understand our role in building trust with our customers.\nYour Impact\nEstablish and lead the Web Presence Design team\nPartner with the Web Presence product owner to influence strategic decisions across all our digital properties, like chain.link, product pages, Chainlink Docs, our blog, and more\nCraft novel and delightful experiences, and mentor individual contributors to put their creativity at service of world-class user experiences\nPartner with our Marketing and Product teams to define information architecture and tell the right stories, while driving prioritization conversations  \nHelp the team to synthesize broadly scoped loose concepts into defined, tactical deliverables\nCollaborate closely with Product and Brand designers, marketers, and product owners to shape the evolution of Chainlink’s Design’s footprint\nBe a collaborative and trusted Design partner within Chainlink Labs\nRequirements\nA passion for the web as a storytelling medium, demonstrable through a portfolio of design systems, engaging microsites, Figma libraries, digital experiments, CSS art, or anything else—show us what you’ve got!\n7+ years of relevant web design system experience at a tech-forward, product-driven company.\n2+ years of experience in a player-coach role.\nFundamental understanding of the formal elements of design–not just limited to the web– including typography, layout, balance, rhythm, and proportion.\nA systems perspective and an ability to extrapolate and extend shared patterns and behaviors.\nExperience applying those systems to design-system-driven digital properties—and know how to balance maintainability with adaptability.\nObsessively focused on pushing your work until every detail is covered.\nAn ability to reduce complex problems into stories delivered through layout and interaction, and the skills needed to explain your work, process, and decisions to cross-functional stakeholders.\nDesired Qualifications\nExperience working on a remote, cross-functional design team.\nPlayer-coach experience.\nBlockchain interest or experience (bonus if you are already familiar with Chainlink)\nFigma, Webflow, and experience with Zapier and Airtable are a big plus. Additional web development experience is also great.\nOur Principles\n\n\nAt Chainlink Labs, we’re committed to the key operating principles of ownership, focus, and open dialogue. We practice complete ownership, where everyone goes the extra mile to own outcomes into success. We understand that unflinching focus is a superpower and is how we channel our activity into technological achievements for the benefit of our entire ecosystem. We embrace open dialogue and critical feedback to arrive at an accurate and truthful picture of reality that promotes both personal and organizational growth.\n\n\nAbout Chainlink Labs\n\n\nChainlink is the industry standard oracle network for connecting smart contracts to the real world. With Chainlink, developers can build hybrid smart contracts that combine on-chain code with an extensive collection of secure off-chain services powered by Decentralized Oracle Networks. Managed by a global, decentralized community of hundreds of thousands of people, Chainlink is introducing a fairer model for contracts. Its network currently secures billions of dollars in value for smart contracts across the decentralized finance (DeFi), insurance, and gaming ecosystems, among others. The full vision of the Chainlink Network can be found in the Chainlink 2.0 whitepaper. Chainlink is trusted by hundreds of organizations—from global enterprises to projects at the forefront of the blockchain economy—to deliver definitive truth via secure, reliable data.  \n\n\nThis role is location agnostic anywhere in the world, but we ask that you overlap some working hours with Eastern Standard Time (EST).\n\n\nWe are a fully distributed team and have the tools and benefits to support you in your remote work environment.\n\n\nChainlink Labs is an Equal Opportunity Employer.\n\n\n\n\n#LI-Remote\n\n\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","lead","remote"]},{"job":"Smart Contract Engineer Protocol","company":"0x Labs","location":"San Francisco","post_date":"5d","link":"https://web3.career/smart-contract-engineer-protocol-0xlabs/39923","key":"39923","details":"Company\n\nAt 0x Labs, our mission is to create a tokenized world where all value can flow freely. We're a mission-driven and diverse team composed of world class talent from Coinbase, Google, Meta, Bitso, Citi, Spotify and other top companies. We are a remote-first and fully distributed company, with team members located across all of the continents besides Antarctica. As early pioneers in the space, we've made significant technical contributions to various Ethereum standards over the years; fun fact - our team helped establish the NFT token standard (ERC721).\n\nIn joining us, you'll take part in transforming the way that value is exchanged on a global scale. We're passionate about open-source software and decentralized technology's potential to act as an equalizing force in the world, and our technology is deployed by a wide array of projects at the forefront of internet and economic advancement.\n\nFounded in 2017, 0x Labs created and now partakes in the development of 0x protocol: the open-source, global backbone for decentralized exchange. Alongside the core protocol, we also build and maintain products and service offerings including Matcha, the search engine for tokens, and 0x API, the endpoint for multi-chain aggregated liquidity. All of these offerings allow 0x Labs to continue marching towards our vision of building a tokenized world where all value can flow freely at the best prices and with the lowest transaction costs. This way, we can help businesses eliminate the complexity of accessing decentralized markets across all layers of the Web3 exchange stack and have more time to focus on what matters most: their product.\n\n0x currently supports 8 major blockchains: Ethereum, Polygon, Fantom, Avalanche, Arbitrum, Optimism, BNB Chain, and Celo, and the 0x ecosystem has been rapidly expanding. With integrations across all of the top wallets and apps, including MetaMask, Coinbase Wallet and Coinbase NFT, Polygon Wallet, Brave, Matcha, dYdX, Zapper, Zerion, and Shapeshift, 0x is fast becoming the trusted standard for all decentralized exchange.\n\nWe're a remote-first company with core contributors in nearly ten countries and over twice as many cities. Our headquarters is in San Francisco, with an office available for anyone on the team to use at any time. We'll consider your application regardless of where you call home.\n\nYOU'LL BE WORKING CLOSELY ALONGSIDE\n\nA small and growing team of world-class Solidity/protocol engineers from diverse technical backgrounds, including folks who've done notable solo open-source Ethereum development, co-authored the ERC-721 standard, and audited security-critical smart contracts across the industry\n\nResponsibilities\n\n\nOur Blockchain engineers ensure 0x remains the most resilient, flexible, and future-proofed protocol for decentralized exchange\nResearch and drive high-level decisions about 0x protocol architecture, incentive structures, and features\nSolve greenfield challenges around liquidity, market structures, governance, multi-chain interoperability, security, and mechanism design\nYou'll own our smart contract architecture and development. Spec, implement, test, and audit protocol upgrades and additions while partnering with projects across DeFi and providing web3 developers with access to our exchange infrastructure\nKeep attuned to the rapidly evolving blockchain/crypto space and introduce innovative functionality\nCollaborate cross-functionally with other teams, including engineering (internal and external), research, data science, product management, executive leadership, and recruiting\nAnalyze transaction and usage statistics to identify and prioritize areas for improvement\n\n\nRequirements\n\nExperience writing high-quality, well-tested Solidity\nKnowledge of the EVM, DeFi protocols, and gas optimization\nStrong communication, ownership, and collaboration skills\nThe ability to learn and adapt to a rapidly evolving tech stack and industry\nExhibit the core values that drive our mission at 0x: do the right thing, consistently ship, and focus on long-term impact\n\n\nPreferred\n\nKnowledge of market structures and exchange-related concepts\n\n\nBenefits\n\nCompetitive salary and equity with token-based perks\nComprehensive insurance (medical/dental/vision/life/disability) — 100% covered for you and dependents\n401k, HSA, and FSA\nMonthly mobile phone bill, wellness, and pre-tax transportation expense\nCovered mental health benefits (included professional therapy sessions)\nRemote first: flexible hours, liberal work-from-home policy, and a supportive remote environment\nLunch reimbursement for all employees across the globe!\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need\n12-week paid parental leave\nGreat office located in Soma/East Cut, SF\nUnlimited vacation: Take time when you need it (and we really mean it)\nMultiple annual in-person team meet-ups around the globe\n\n\n0x Labs and its associated entities (0x) are dedicated to fostering diversity, inclusion, and belonging in its teams and workforce, and are proud to be equal opportunity employers. 0x does not make employment or hiring decisions on the basis of race, color, creed, religion, sex, sexual orientation, gender, gender expression or identity, age, disability, veteran status, marital status, pregnancy, citizenship, national origin, or any other basis that is protected by applicable local, state, or federal laws. 0x will also consider qualified applicants with arrest and conviction records in a way that is consistent with San Francisco's Fair Chance Ordinance and similar local laws.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","solidity","ethereum","nft"]},{"job":"Principal Blockchain Engineer","company":"tZERO Group, Inc.","location":"UT Salt Lake City US","post_date":"5d","link":"https://web3.career/principal-blockchain-engineer-tzerogroup-inc/39922","key":"39922","details":"tZERO Group, Inc. is the global leader in Blockchain innovation for capital markets, focused on the development and commercialization of innovative fintech solutions for capital markets based on blockchain technologies.\n\n\n\n\nWe aim to completely revolutionize capital markets and positively address the inherent inefficiencies of Wall Street so that financial processes and investors are less beholden to traditional, institutional market structures. Since tZERO’s inception in October of 2014, we have pioneered the movement to bring greater efficiency and transparency to capital markets through our proprietary blockchain and distributed ledger technologies.\n\n\n\n\nJob Description\n\nAs a Principal Blockchain Engineer, you will work with developers, designers, and product managers to implement features for the tZERO trading platform and other internal applications. You will be working on significant critical projects and will take responsibility for all facets of the development process. You will support and mentor other team members to improve team performance and velocity. This is a fantastic opportunity to gain experience in fintech and build expertise in capital markets and blockchain technology. If you’re creative, versatile, and passionate about building exceptional software, we want to hear from you!\n\n\n\n\nJob Responsibilities\n\nFunction as tZERO’s in-house expert on technologies & smart contract development.\nDevelop new applications and services, including database design either individually or as part of a team.\nDevelop new Smart Contracts to meet business and legal requirements.\nIntegrate Wallet Management Software to new level one blockchain networks\nAnalyze and understand business and user needs to determine feasibility of design within time/cost constraints.\nMonitor and troubleshoot production issues, and participate in an on-call rotation.\nWork with the broader team, including DevOps, architects, QA, Product, and Marketing to understand project limitations, capability/interface/performance requirements, and integrations with legacy systems.\nAd-hoc reporting, database updates, and other data analysis and manipulation.\nCreate unit tests and help with broader integration and system testing, including procedures and documentation.\nCoordinate software deployments and monitor applications to ensure specifications are met\n\nJob Requirements\n\n\n\n\nMinimum\n\n5+ years of recent software development experience with a focus on Blockchain networks, Smart Contract Development, and Web 3.0 applications.\nStrong development experience using Solidity, Kotlin or Java, preferably with Java version 1.11 or later.\nStrong analytical skills.\nExperience with the Ethereum blockchain\nPractical experience with Solidity development\nExperience with ERC-20 Token standard\nKnowledgeable with blockchain re-orgs.\nUnderstanding of UTXO and Account Model blockchain.\nExperience with NFTs and ERC-721\nProficiency in Object Oriented design and programming.\nExperience with build management tools, preferably Maven.\nExperience with version control tools, preferably Git.\nProficiency with IDE-based development, especially in Eclipse or IntelliJ.\nProficiency building unit tests / integration tests using JUnit or similar.\nSQL/NoSQL development experience\nExposure building RESTful web services\n\n\n\nPreferred\n\nCI/CD Integration (Gitlab / Docker)\nPipeline Process (Kubernetes)\nArchitecture and Design Principles for new Development\nSecurity frameworks\nCache technologies\nKubernetes/Docker\nMicro Service Architecture\nCI/CD\nEnterprise Architecture\nBuild tools such as Maven, Gradle\nRestful Web Services\nServer-side JS implementation\nUnderstand and Utilize Javascript Frameworks\nModern JavaScript frameworks/libraries, preferably React.js\nStrong understanding of HTTP requests and REST APIs\nMulti threading, Concurrent programming\nPeer programming/ Code review skills\n\n\n\nEducation\n\n4-year college degree in Computer Science, Engineering, or related field OR equivalent training & work experience.\n\n\n\ntZERO is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin or ancestry, age, disability or veteran status, or other protected status.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","executive","blockchain","react","solidity"]},{"job":"Senior Software Engineer Rust TypeScript","company":"Moon Now","location":"United States","post_date":"5d","link":"https://web3.career/senior-software-engineer-rust-typescript-moonnow/39921","key":"39921","details":"We are actively searching for a Senior Software Engineer (Rust) to join our remote team on a permanent basis. We are looking for a passionate builder to join us in developing new solutions that will power our developer user base. Experience deploying solutions for Solana and Ethereum blockchains is highly desired.\n\n\n\n\nYour Vibe:\n\nSoftware development experience and a desire to share your knowledge with others\nA demonstrated history of contributing code to open source projects\nAptitude to quickly learn and experiment with new technologies\nAbility to effectively articulate technical challenges and come up with solutions\n\n\n\nYour Rhythm:\n\n5+ years of professional software engineering experience\nProficiency with Node, TypeScript or JavaScript, or algorithmic C++\nPreferably 2+ years experience working in Rust, Solidity, Blockchain, Smart Contract Development\nExperience contributing to open source software and working with respective communities\nExperience with full-stack web development\nBachelor’s degree in Computer Science or Software Engineering\nYou thrive in a fast-paced start-up environment\n\n\n\nOur Vibe:\n\n100% paid Medical, dental, and vision benefits\nUnlimited PTO policy\n401K with match\n100% remote work option\nCompany equity\nPlenty of opportunity for growth\n\n\n\n****No Sponsorship Available, No 3rd parties*****\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","rust","senior","solidity","solana"]},{"job":"Senior Backend Engineer","company":"Alongside","location":"New York","post_date":"5d","link":"https://web3.career/senior-backend-engineer-alongside/39920","key":"39920","details":"Alongside is bringing passive, long term investing to crypto assets. We believe index funds are the greatest equalizer of a financial product ever. Anyone that averaged into an S&P 500 index beat 90% of hedge fund managers over a 20-year time horizon. We think the same dynamic will play out in crypto assets.\n\nIn a past life, we worked on Ethereum at ConsenSys, partnerships at Google, and biotech ventures at Longevity Fund.\n\nWe're proudly backed by investors including Coinbase, Village Global, Not Boring Capital, and FJ Labs.\n\nWhat You'll Do\n\n\nWork with the team to collaborate and execute on our product goals and technical roadmap\nDesign and build industrial-grade backend system with an eye for reliability & security\nLead development of our infrastructure, databases and API's\nOwn the systems end to end from test suites to deployments and maintenance.\nContribute to protocol design and implementation\n\n\nRequirements\n\n4+ years of experience building and releasing secure and production grade software\nExperience leading development of a backend system with real usage.\nStrong understanding of software and system design best practices\n\n\nTechnologies We Love\n\nAWS (Step Functions, Lambda, API Gateway, IAM, ...)\nTerraform\nTypescript\nNodeJS\nPostgreSQL\nVercel\nSolidity\nFoundry\nRust\n\n\nBenefits\n\nUnlimited Time Off\n100% company paid medical/dental\n401k retirement savings plan for US employees\nIn person office in the heart of Soho in NYC\nRemote office setup\n12 weeks paid parental leave\n\n\nSome more fun stuff:\n\nWe're globally remote, but intend to take the team to beautiful international destinations for productive off-sites.\nWe encourage you to build open-source projects on the side and contribute to the community.\nWe know any engineer worth their salt has a wide range of awesome opportunities- we compensate well in both cash and equity because we understand the opportunity costs of taking on a dedicated role in a world where it seems like everyone in web3 is making seven figures flipping jpegs.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","senior","solidity","ethereum"]},{"job":"Software Engineer SGX Privacy","company":"Flashbots","location":"New York","post_date":"5d","link":"https://web3.career/software-engineer-sgx-privacy-flashbots/39919","key":"39919","details":"Our Organization\n\nFlashbots started in 2020 as a research and development organization formed to mitigate the negative externalities and existential risks posed by Maximal Extractable Value (MEV) to smart-contract blockchains, starting with Ethereum.\n\nWe build decentralized products to maximally decentralize public blockchains and empower users.\n\nWhat we're looking for\n\nFlashbots is seeking a senior engineer to lead the development of our SGX related products.\n\nWorking closely with Robert Miller, your work will bring to life one of our original approaches to democratize MEV as outlined In this Eth Resreach post by Robert in the early days of Flashbots:\n\nMEV-SGX: A sealed bid MEV auction design\n\nYou will have the opportunity to work on both implementing products and contributing to research efforts with a high degree of autonomy.\n\nResponsibilities\n\n\nDeveloping a fast EVM environment that can be used within an SGX\nBuild and maintain brand new products for Flashbots searchers, miners, and retail users\nContribute to the roadmap of Flashbots\nWriting examples and documentation for public consumption\n\n\nQualifications\n\n5+ years experience working on production systems\nExperience in C and/or C++ programming languages\nExperience with cryptography\n\n\nNice-to-haves\n\nExperience with devops\nExperience with Solidity\nExperience with at least one of Go or Rust\nExperience with Ethereum or EVM-based chains\nExperience with geth or other Ethereum clients\nExperience with strategies currently used for MEV\nAble to show available open source work\n\n\nJoin us to help solve hard problems that have asymmetric impact and strike at the core of crypto.\n\nBenefits\n\n🌍Fully remote\n\n💸Competitive salary with significantly above market rate equity package\n\n🧠 Work alongside the brightest minds in the crypto space\n\n📚Yearly budget for your learning and development goals\n\n✈️ +2 paid trips per year to team on-sites (2022 was Amsterdam/Morocco and then Columbia/Costa Rica)\n\n🍏Attractive health cover package for US employee\n\nOption to get paid in crypto\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","ethereum","rust"]},{"job":"Software Engineer Product","company":"TBD Advertising","location":"San Francisco","post_date":"5d","link":"https://web3.career/software-engineer-product-tbdadvertising/39918","key":"39918","details":"Company Description\nTBD is Block's newest, emerging business unit- focused on building a future where every individual can access and participate in the global economy. The TBD team is on a mission to lead by example, inspiring the world to invest in & collaborate on open source standards and permissionless technologies for the public good. Join us as we build a financial system accessible for anyone who wants to participate. Job Description\nTBD’s Product Engineering team is on the mission to build value-added decentralized financial services and applications that can drive monetization for TBD. With the focus of real world problems for retail customers and financial institutions, you will play a key role to further our mission of economic empowerment globally.\nAs a Software Engineer, Product you will be a part of the TBD Software Engineering Team and report to the team lead.\nYou Will\n\n\nBe one of the founding members of the team\nBuild and launch decentralized cross-border money moving services globally.\nContributing to the specifications and strategies of TBD’s product and monetization initiatives.\nMarket research, prototype, and evaluate various blockchain based solutions available on the market.\nDesign and lead development process to ensure quality, including code reviews as well as testing and verification.\nBe involved in the current blockchain community, stay close with relevant updates in the industry and foster a growing internal knowledge base.\n\nQualifications\nYou Have\n\n5+ years of experience in designing and shipping scalable systems and products\nStrong CS fundamentals with experience across a range of disciplines\nHave driven the designs of complex products and architectures\nEntrepreneurial and have demonstrated ability to handle ambiguity\nProduct focused mindset and genuine interest in user experience\nAbility to set technical and cultural standards for engineers\nExperience working with open source projects\nAbility to mentor and grow the team\nInterest and ability to pick up new technologies quickly\n\nEven Better:\n\nFamiliar with fiat payment systems\nFamiliar with Solidity and Rust programming languages\nExperience or interest in building smart contracts and protocols, and developing Dapps or Web3 applications\nPassionate about DeFi protocols\n\nAdditional Information\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\nZone A: USD $202,500 - USD $247,500\nZone B: USD $192,400 - USD $235,200\nZone C: USD $182,300 - USD $222,800\nZone D: USD $172,200 - USD $210,400\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\nBenefits include the following:\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","rust"]},{"job":"Senior Rust Engineer","company":"Parallel Consulting","location":"San Francisco","post_date":"5d","link":"https://web3.career/senior-rust-engineer-parallelconsulting/39917","key":"39917","details":"Our Client is a Series A Startup with $30M in funding to this point. Aiming to launch midway through 2023. The firm is working on Layer 1 blockchain looking for individuals to come in and write protocol level code that’s clean and well tested.\n\n\n\n\nSenior Software Engineer:\n\n\n\nProgramming in Rust/ TypeScript\nSenior – Staff level role (titling negotiable)\nTech lead 90% hands on\n\n\n\nPreferred Skills:\n\n5+ years experienced programming with Node, TypeScript or JavaScript, or algorithmic C++\n3+ years working in Rust, Solidity, Blockchain, Smart Contract Development\nBackground in any of the following: Cyber Security, Crypto Architecture, Application Development in Web 2/3 or Electrons or P2P, other related fintech industry\nDesire to be a part of a high growth oriented team!\n\n\n\nInterview Process:\n\nTechnical coding interview with a hiring manager\nVirtual meet with CEO architectural interview\nMeeting for project deep dive (most proud of how idea came across)\nPosition specific Interview (anywhere from a backend API focus to a technical)\n\n\n\nThe role is 100% remote.\n\nThe compensation range is $475 - 725k in base + token equity & equity.\n\n\n\n\nWould this interest you? If so, please apply and follow it up with an email to alec.ross@parallelconsulting.com\n\n\n\n\nAlec Ross @ Parallel Consulting\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","rust","senior","solidity","javascript"]},{"job":"Engineering Manager","company":"Coinhako","location":"Singapore","post_date":"5d","link":"https://web3.career/engineering-manager-coinhako/39916","key":"39916","details":"Coinhako is a leading digital assets platform headquartered in Singapore.\n\nFounded in 2014, Coinhako has established a reputation as being one of the most secure and trusted digital asset wallet service providers and trading platforms in the APAC market. Our team is deeply passionate about building the crypto economy in the APAC region. Through the launch of our innovative suite of products and services, Coinhako aims to empower individuals and businesses by allowing them to take ownership and control of the way they build and manage their assets in the new digital finance world.\n\nYour role:\n\nLead and develop a fast-pace team of frontend and backend engineers\nWork closely with multiple stakeholders to create a scalable and extendable team to support multiple/new projects depending on business needs\nContribute to the building of frontend structures, component libraries and technical deliverables\nPrioritize and manage product delivery timelines and clearly communicate goals and progress within the team as well as to stakeholders.\n\nAbout you:\n\nAt least 3-5 years of relevant technical experience\nSound understanding of development lifecycle and proven track record of cross-functional collaboration\nProven team leadership of managing a relatively large team (onsite as well as remotely)\nInterpersonal skills, and ability to get things done\nExperience with Javascript, Angular, Golang, Python, and/or Ruby would be a plus\nPassion for coding and crypto\nAdvanced understanding and/or experience working in a Cryptocurrency/Blockchain/Fintech/Finance Trading domain preferred\n\nWhat’s in for you:\n\nFriendly and fun start-up work culture\nConvenient work location located in the heart of CBD area\nGenerous annual leaves on top of national holidays\nMedical coverage including GP, Specialist, TCM and more\nSelf-care benefits and exciting fitness workshops/webinars\nVibrant office with well-stocked pantry\nAnimal friendly environment with a fluff ball in the office\n\nFind out more about Coinhako here and don't forget to visit our Careers Page!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","javascript","ruby","golang"]},{"job":"Customer Service Representative Vietnam","company":"Binance","location":"Vietnam","post_date":"5d","link":"https://web3.career/customer-service-representative-vietnam-binance/39915","key":"39915","details":"Customer Service Representative - Vietnam\nRemote – Vietnam, Ho Chi Minh /\nCustomer Support – Customer Support /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nBinance is a client-facing business, and Customer Service is extremely important for us. We hope to create a platform where our users are well supported with excellent quality, fast response time, and accurate information.\n\n\nSupport is conducted via the ticketing system and a live chat and will include but not limited to customer queries, complaints, and identification approval processes for our world-class cryptocurrency exchange platform.\n\n\nSupport will be in Vietnamese and English, that's why we are looking for candidates with proficiency in both languages.\nResponsibilities:\nHandle back office tickets, and provide 7*24h online enquiries and email replies services to customers.\nHandle customer enquiries, advices and suggestions via email or online tools.\nSupport other business units with customer liaison, accurately document customer requests and advices, and provide feedback in the form of documentation.\nHandle customer complaints, any special cases or ad hoc tasks. \nRequirements:\nCollege degree or above.\nProficient in English and Vietnamese. Other languages would be of a great advantage, for efficient collaboration with various stakeholders in the company\nMinimum 1 year experience in customer service, preferably in finance or E-commerce industry. Outstanding recent graduates are also welcome to apply.\nHigh level of honesty and integrity. Proactive and meticulous. A sense of responsibility and team work spirit.\nAbility to work under pressure, strong communication skills and exceed beyond expectation.\nPassionate for customer service industry and can accept to work under different work shifts, including night shift.\nPositive about the crypto industry.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["customer","support"]},{"job":"Senior Data Engineer","company":"Coinhako","location":"Singapore","post_date":"5d","link":"https://web3.career/senior-data-engineer-coinhako/39912","key":"39912","details":"Senior Data Engineer\n\nCoinhako is a market-leading platform for access to digital assets like Bitcoin from Singapore.\n\nFounded in 2014, Coinhako has established a reputation as being one of the most secure and trusted digital asset wallet service providers and trading platforms in the APAC market. Our team is deeply passionate about building the crypto economy in the APAC region. Through the launch of our innovative suite of products and services, Coinhako aims to empower individuals and businesses by allowing them to take ownership and control of how they build and manage their assets in the new digital finance world.\n\nIn line with our expansion, we are looking for motivated individuals who are passionate about the crypto space.\n\nWe’re looking for a Senior Data Engineer for our Data Platform Team.\n\nYour role:\n\nBuild scalable, highly performant infrastructure for delivering clear business insights from a variety of raw data sources.\nDevelop and maintain batch & real-time data pipelines/ analytical solutions, prototypes, and proofs of concept for selected solutions\nDevelop, improve and simplify frameworks and tools to empower our data analysts and internal teams to make data-driven decisions.\nImplement analytical projects with a focus on collecting, managing, analyzing, and visualizing data.\nDeploy and use various big data technologies and run pilots to design and improve low latency data architectures at scale\nImplement best practices for managing versions and source control for data product development\nBe a technical leader and strategic thinker to decide the technology stacks used in the process\nWork well independently but also in teams, with technical software engineers who can help with infrastructure set up, but be the expert on data related matters\nHave a strong drive to develop oneself and take on bigger projects, with the ultimate aim of being a leader in the organization\n\nAbout you:\n\nBachelor’s degree in Computer Science or related field\n5 years' relevant experience\nDeep understanding of Big Data technologies such as Kafka, Airflow, Apache Superset, etc.\nExperience with complex data modelling, ETL design, and using large databases in a business environment\nProficient in Python and SQL. Working knowledge or experiences with Java / Scala is a plus.\nExperience with Big Data transformation technologies, especially Spark\nHave built data pipelines end-to-end\nExposure to Cloud technologies on AWS or Azure\nAdvanced understanding and/or experience working in a Cryptocurrency/Blockchain/Fintech/Finance Trading domain preferred\nExperience with data devops technology for deployment such as IoC (Terraform), Kubernetes, etc. is a plus\n\nWhat’s in for you:\n\nFriendly and fun start-up work culture\nConvenient work location located in the heart of CBD area\nGenerous annual leaves on top of national holidays\nMedical coverage including GP, Specialist, TCM and more\nVibrant office with well-stocked pantry\nAnimal-friendly environment, with a fluff ball in the office\n\nFind out more about Coinhako here https://www.coinhako.com/ and don't forget to visit our Careers Page https://www.coinhako.com/join-us\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["data","science","dev","senior","scala","java"]},{"job":"UI UX Designer Trust Wallet","company":"Binance","location":"Europe","post_date":"5d","link":"https://web3.career/ui-ux-designer-trust-wallet-binance/39911","key":"39911","details":"UI/UX Designer (Trust Wallet)\nRemote – Europe /\nProduct & Design – Design /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nTrust Wallet is a decentralized, multi-chain mobile wallet designed for speed, security, and ease of use. After 5 years of development by the team and community, Trust provides a secure wallet to send, receive, stake and store more than one million cryptocurrencies on 63 blockchains, including Ethereum and EVM chains, Solana, Polkadot, etc - making it the world’s most inclusive, chain-agnostic decentralized wallet.   \n\n\nTrust now serves tens of millions of users globally on a monthly basis. We are looking for someone who will have the vision to design the gateway experience for web3 world and scale it to hundreds of millions of users.  \n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world? We welcome anyone whose goal is to make a global impact, shape the future of web3 and make history together.  \n\n\nRegardless of your role, you'll have massive ownership and have the opportunity to work with a variety of products and technologies across the stack.\nThis role is for you if:\nLike the idea of working in a fast startup environment with the backing of one of the most established crypto companiesYou are excited about the opportunity to grow with the company from an IC to a design leadership role.\nYou want to help define the vision and strategy to onboard the next 100M users onto crypto and Trust WalletYou see the endless potential to differentiate wallets with exciting new features and user experiences that make crypto more accessible to the masses.\nYou’re passionate about crypto and the role wallets play across DeFi, NFTs, DAO, tokenomics, and the overall Web 3.0.\nYou can think big, push the boundaries of what is possible and are able to communicate and influence these ideas effectively. You live and breathe Figma or SketchYou're agile and can thrive in fast moving environments - especially since Web3 is constantly evolving. What you worked on last month may not be what you work on the next day, and that excites you.\nYou’re not looking for a traditional web2 job.\nYou share the mindset that ‘Nothing should be someone else’s problem’. Owning a problem doesn’t scare you, but empowers you to take 100% responsibility for achieving goals and results.\nYou want to be part of a winning and agile team with global and diverse background\nWhat you will do:\nYou will design the short and long term roadmap - impacting the millions of Trust Wallet users.\nDesign across web (chrome extension) and mobile (iOS and Android) experiences that solve the needs for a wide range of users, from the newbie to the crypto expert.\nTake new features from ideation to prototyping, user testing and production.\nCollaborate closely with product managers, engineering, and customer support teams.\nYou will be interacting directly with end-users and Trust Wallet developers to collect feedback and develop user empathy.\nYou'll be a key part of a small agile team.\nWhat skillset you will need to possess:\nExtremely user-focused mindset.\n5+ years full-time UI/UX Designer experience.\n3+ years full-time experience of designing consumer-facing experiences for web and mobile apps.\nKnowledgeable and interested in Web3 spaceCollaborative and open minded.\nAbility to create thoughtful UI and UX and written communication to both  frame and explain concepts.\nDemonstrated interest in open and community-driven platforms.\nBasics of HTML/CSS knowledge.\nThrive in uncertainty and challenges: proactive, hands-on, self-starter and perseverance.\nStrong communication in oral and written English.\nStrong values, ethics and integrity.\nStrong intellectual curiosity and honesty, Bachelor’s or Master's Degree\nWhat we offer:\nBe at the front seat of the fast-growing blockchain and crypto industry.\nAn organization at hockey-stick growth stage with numerous opportunities to stretch out of your comfort zones and explore new roles when you prove to have good track records.\nGlobal role to work with very diverse and talented teams.\nFlexibility to work from anywhere in the world, as long as you deliver results\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["design","non-tech","solana","ethereum"]},{"job":"Dev Rel BNB Chain","company":"Binance","location":"Europe","post_date":"6d","link":"https://web3.career/dev-rel-bnb-chain-binance/39908","key":"39908","details":"Dev Rel - BNB Chain\nRemote – Europe /\nBusiness Development – Business Development /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nDo you have a passion for blockchain technology and a love for advocating for web3 innovation? If so, BNB Chain is looking for Tech Evangelists to work with web3 developers to help build successful web3 projects using the latest blockchain technologies.\nAs a technology evangelist, you’ll be offering technical assistance as well as raising awareness of the opportunity for blockchain innovation. Through advocacy, you will establish BNB Chain as an industry leader, through engagement and delivering advice, guidance, technical content, and building relationships with web3 developers.\nImportantly, you will be the bridge between many teams and communities, connecting the dots between different technologies and utilities to help scale web3. This will include offering technical assistance, writing content, presenting at events, and writing code.\nResponsibilities\nHigh responsibility for continuous improvement in BNB Chain technical documentation, blogs, and in the community forum. \nBuild awareness of BNB Chain features that make the developer's life easierBe hands-on\nCreate and maintain resources for developers such as demos, code samples, documentation, how-to guides, and tutorialsInvent new and novel ways to improve the developer experience across our suite of tools and the rest of the BNB Chain ecosystem\nIdentify high-potential developer communities, refine messaging to attract new developers, and highlight gaps in developer experience for our product teams\nBe familiar with the product and technical details of BNB Chain, directly connected with project personnel, and solved the online consultation and complaint related to certain product/technical knowledge transmitted\nLead BNB Chain involvement in relevant conferences, Hackathons, and Meetups, including oversight of our annual developer conference\nPlay a lead in writing content, recording videos, and speaking at conferences\nYou’ll be the face of BNB Chain at events and in online communities\nHelp launch new products and engage with developers to provide feedback to product teams\nKey Requirements\nPassion for web3 and blockchain technology\nBe Motivated by helping people solve technical problems\nEmbrace complexity, uncertainty, and constant change of web3, seeing ambiguity as an opportunity to lead and set direction\nAn established technical profile (social networks, blogging, GitHub contribution, published author, conference speaker, community organizer)\nAble to creatively communicate complex technical information clearly, concisely, and in public whether that is online or in person at events\nExperience in community building and management including Discord, Twitter, and Reddit\nTechnical Requirements\nDegree in Computer Science, Technology, Engineering, and Math\n3+ years of experience in similar roles to provide technical support and promotion to the community with multiple channels like (Github, Discord, and TG) \nTech Stack: JavaScript/TypeScript, React, Solidity, Node, Blockchain, Consensus Algorithms understanding, Wallets Development, Web3, understanding fundamentals of blockchain infrastructure\nHave domain level understanding of Cloud Infrastructures including Compute, Network and storage as well as cloud Management areas such as automation, orchestration, and DevOps\nStrong tech presentation skills and able to speak confidently with external stakeholders\nGood verbal and written communication skills in English to engage with team and stakeholders effectively\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","react","solidity","javascript","node"]},{"job":"Senior Frontend Engineer","company":"Violet","location":"Remote","post_date":"6d","link":"https://web3.career/senior-frontend-engineer-violet/39907","key":"39907","details":"What we do\n\n\nViolet is building on-chain compliance and identity infrastructure. Our mission is to evolve trust in Web3.\n\n\nViolet is a primitive applicable to many use cases, however we are most excited about catalyzing institutional participation across DeFi in the near term. We believe this is key for the industry to expand and become more robust.\n\n\nSpecifically we are initially building an on-chain infrastructure product that solves institutional compliance requirements - while maximizing privacy for individual participants. We intend this infrastructure to be utilized by DeFi builders as they start engaging institutional liquidity and wish to grow regulatory trust in their platforms. Our early work includes www.humanbound.xyz.\n\n\nViolet sits at the intersection of web2 and web3, which translates to engineering across old and new UX patterns, requiring deep holistic thinking in producing delightful software - which is why we are looking for a senior frontend engineer to join our team.\n\n\nViolet is backed by top crypto investors and traditional investors alike, including BlueYard and founders / senior leadership at Ethereum, Filecoin, Anchorage, Coinbase, Wise, Uniswap, Argent, and many more.\n\n\nResponsibilities\n\n\nHelp design and build the UX/UI of all user centered flows across all our web properties -- while remaining focused on delighting our users\nBuild across our entire application stack, interfacing both web2 and web3. This includes (but is not limited to): The Violet website, Violet integrations with DeFi applications, Humanbound\nWork with the entire team to bootstrap and foster a thriving open source community around Violet, utilizing this interface to continuously improve our work and processes\nQualifications\n\n\n5+ years of experience designing and implementing delightful web applications\nStrong software fundamentals (Typescript, Node.js, GraphQL, frontend JS frameworks such as React, Vue, Angular etc)\nPrior experience working across the broader web3 stack, i.e. you know your way around libraries and tooling in the space\nPrior experience working closely with a designer to iterate on a product\nPrior experience writing concise and beautiful developer documentation\nBonus points for:\nAny experience working across the identity web universe (OAuth, OpenID, DIDs, etc) * Knowledge and/or passion for blockchain fundamentals, smart contracts, DeFi protocols, etc. - however there is no explicit requirement and we are more than happy to show you the ropes\n*If you have published about your work before (Blog, code, twitter, conferences, etc)\n*If you know your way around Figma and can whip up early design work and wireframes yourself\nWhat is it like to work at Violet\nViolet is a remote first / distributed organization, with a small hub in Berlin. Today all of our team is in EU time zones and we get together in person every second month for a few days. Recent trips have been to Denver, Amsterdam, and Berlin. We value both the flexibility of remote work, as well as the ability for deep and conceptual work, that is at its best while being around your teammates.\n\n\nBenefits\n\n\nCompetitive compensation package, including generous equity / token grants\nCo-working or home office stipend\nWhatever work gear you may need to feel productive\nParticipation across major industry conferences and hackathons, as well as travel to team on-sites and our hub in Berlin\nHow to apply and process\nDoes this role sound like a good fit? Please email us at join [at] violet.co. Send along links that best showcase the relevant things you've built and done or anything else we should know about you! This is a full time role. Note: We welcome all qualified persons to apply regardless of race, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","senior","remote"]},{"job":"Senior Solidity Engineer","company":"Safe","location":"Berlin","post_date":"6d","link":"https://web3.career/senior-solidity-engineer-safe/39906","key":"39906","details":"👨‍💻 About the Role:\n\n\nAs a Solidity Engineer, you will help us design and deploy our next generation of smart contracts. You will work closely with engineering leads, and partners to prototype smart contracts that extend our core architecture as well as lead efforts to upgrade and optimize our contracts running on EVM based networks. The goal is to create a suite of smart contracts that make up the Safe protocol, bringing the best UX and maximum flexibility to our users. Security is critical, so a strong attention to detail is a must.\n\n\nLocation: Berlin, Germany\n\n\nOur Tech Stack: Solidity, Hardhat, Typescript\n\n\nCheck our github:\n\n\nSafe Contracts: https://github.com/safe-global/safe-contracts\n\n🗂 What you will be doing:\n\n\nDevelop smart contracts for the Safe protocol\nIterate on existing smart contracts (e.g. core contracts)\nEvaluate and idea value capture opportunities on contract level\nSupport external developers on contract usage (e.g. StackExchange)\nDocument the Safe protocol approaches/ solution\nCollaborate with product team (Engineers, designers, stakeholders) on protocol/contract related features\n\n🎒 What you will bring:\n\n\nExperience with modern Solidity stack (hardhat, truffle, various plugins, package managers, linters, code cov etc.)\nExperience debugging and simulation of contract interaction with local nodes (e.g. hardhat and ganache,\nProven experience with different Ethereum development platforms (e.g. Remix, Tenderly, OpenZepplin)\nExperience with Solidity libraries (e.g. Remix, Tenderly, OpenZepplin)\nYou have worked on the projects that have been audited\nTesting knowledge (coverage, automation, integration)\nNice to have skills:\n\n\nExpert in EVM details/design\nDeep knowledge in Ethereum RPC usage\nFamiliarity with tokenomics\nTypescript for testing\n\n🎁 Team and Benefits:\n\n\nLearn more about us and what benefits we offer here: https://gnosis-safe.io/careers\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","solidity","hardhat","remix"]},{"job":"Social Media Manager","company":"Tafi","location":"UT Salt Lake City US","post_date":"6d","link":"https://web3.career/social-media-manager-tafi/39905","key":"39905","details":"At Tafi and DAZ 3D, we build tools and help humans and brands express themselves through stylized and uber creative assets for the digital world.\n\nAbout Tafi and Daz 3D\n\nDaz 3D empowers 3D artists and designers with a free, comprehensive software suite and a massive 3D marketplace with over 5 million inter-compatible assets for Daz Studio and other 3D applications. Daz 3D and Tafi have entered the NFT space with many collections releasing throughout the year.\n\nLeveraging Daz technology, Tafi’s mission is to make personalized avatars, NFTs and branded\n\ndigital content available to everyone who wants to level-up their digital personality. Partnering\n\nwith mobile phone platforms and software applications, Tafi puts its world-class avatar content\n\nengine at our customers’ fingertips.\n\n\n\n\nSocial Media Manager\n\nLocation: Salt Lake City, Utah\n\nPosition Type: Full-time\n\nReports to: Director of Marketing\n\nAs a Social Media Manager, your role will include working with the Director of Marketing to lead and translate key initiatives, launches, content, and partnerships in creative and engaging social media plans that drive traffic, brand awareness, and sales\n\n\n\n\nYour Impact as a Social Media Associate\n\nDevelop a channel-specific social strategy for current and opportunistic channels, with a test-and-learn mentality to drive awareness, engagement, and revenue\nDevelop and implement social campaigns and tactics to drive short-term and long-term revenue\nEnsure we maximize our dedicated following and develop creative ways to focus on engaging and expanding our audience\nPartner with the creative team to develop and bring to life an ownable ,and on-brand, social visual identity\nUpdate social media content across all channels\n\n\n\nYou Bring to Daz 3D and Tafi:\n\n3+ years of social media management including strategy, creative, management, and performance evaluation\nExperience developing and executing a cohesive social content strategy across platforms.\nSolid understanding of the social marketing/media landscape\nAbility to work successfully with multiple business functions and influence stakeholders at all levels of an organization.\nStrong organization skills, attention to detail, and ability to handle multiple tasks and meet deadlines.\nExperience building a constructive working partnership with creative partners to develop ideas and bring them to life\nAbility to multi-task and prioritize projects in a dynamic, fast-paced environment\n\n\n\n\nBonus Skills and Abilities\n\nCreative and out-of-the-box thinking with social media plans\nSales background\nPrior experience as a content manager\nB2B public relations and social media experience related to technology products, IT, software or related industry strongly preferred.\n\n\n\n\nWhat do Daz and Tafi Have to Offer?\n\n\n\nCompetitive salary\nQuarterly bonus potential\nHealth, dental, vision insurance with most or all of premiums paid by the company\n401k matching plan\nCasual dress and winning attitudes - we care most about what you can do with us\nUnlimited paid vacation potential\nPaid monthly gym membership at VASA or reimbursement to a gym of your choice\nRewarding work, you’re proud to be a part of.\nIn-Office Benefits:\nIdeal downtown location - tons of nearby options for walking to lunch\nOpen loft->\nMonthly parking/transit allowance\nFull kitchen with all the caffeine and healthy(-ish) snacks you can consume\n\n\n\nOur Commitment to Diversity, Equity, and Inclusion\n\nWe strive to create and maintain an environment where all our employees feel included and empowered to work from a safe environment. We celebrate and value each employee’s unique experiences and perspectives across our company and recognize that fostering a diverse, equitable and inclusive place to work ensures a vibrant and joyful place for artists to explore their creativity.\n\nDo I need ALL Criteria to Apply To Daz 3D and Tafi?\n\nHeck no! We value artistic passion and curiosity. If you think you have something we should be looking for, please apply and let’s see where the conversation goes!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["social","media","non-tech","nft"]},{"job":"Product Manager","company":"nWay Inc.","location":"San Francisco","post_date":"6d","link":"https://web3.career/product-manager-nwayinc/39904","key":"39904","details":"Job Description\n\n\n\n\nnWay is currently looking for a Product Manager to support the Product Owner in launching and scaling a brand new Web 3.0 game with an innovative blockchain integration. The ideal candidate has worked with cross-functional teams to define business goals and translate those goals into product requirements and design specifications. The individual must be data-driven and result-focused and must competently render user data into actionable insights to be applied back in the game development to ensure product optimization and ultimately commercial success of the game.\n\n\n\n\nResponsibilities\n\n\n\nSupport the Product Owner in managing the product roadmap, defining and prioritizing features in alignment with business goals\nLead cross-functional teams to define product specifications, establish milestones, and direct the development, implementation, and evolution of new features and optimizations\nIdentify key opportunities for growth through a combination of qualitative and quantitative analysis\nPartner with the analytics team to run experiments and perform assessments as part of optimization strategy\nMonitor competitive landscape to stay on top of market trends and industry best practices\n\n\n\n\nRequirements\n\n\n\n3+ years of product management experience in consumer mobile or game development\n1+ years of web3 experience\nPassion for emerging blockchain gaming and NFT trends\nStrong problem solving, analytical, and decision-making skills. Able to interpret data and trends, diagnose problems, and formulate effective action plans to resolve issues.\nStakeholder management skills to work successfully with engineering and design to ensure that functionality is delivered on time and with best quality in the market\nComfortable with and adaptable to change. We work in an innovative fast-growth environment where products and processes evolve rapidly.\nExperience with data visualization tools such as Tableau and Amplitude\nExperience running live-ops and engagement events in games\n\nPluses\n\n\n\nStrong understanding of mobile F2P games\nExperience working with a remote development team\nPrevious startup experience\n\nWhy you want to work here\n\nAt nWay, we’re passionate about creating meaningful entertainment through real games with digital ownership and we’re always looking for talented individuals who share that same drive. We’re a small startup defined by a very collaborative, lean and laid back culture where everyone just wants to get things done. Our office is located in the heart of San Francisco and we’re conveniently located near BART, Muni, SF Ferry and Caltrain. We also offer medical, dental, vision insurances, FSA and commuter options. Most importantly, we do our best to keep everyone’s belly full with a fully stocked snack room plus office lunches.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","nft"]},{"job":"Developer Relations Lead","company":"Safe","location":"Berlin","post_date":"6d","link":"https://web3.career/developer-relations-lead-safe/39903","key":"39903","details":"👨‍💻 About the Role:\n\n\nAs a Developer Relations Lead at Safe, you will be responsible for improving Safe’s public good and open-source commitment to the Web3 community. You will lead this new function, building code examples and documentation for the community to use and contribute to, you will also facilitate technical workshops and talks at conferences/hackathons.\n\n\nWe want you to bring your technical expertise, enthusiasm and creativity to the table and represent Safe to our fast growing developer community. You will also influence our product strategy, so developers get what they need!\n\n\nOur Tech Stack: Solidity, EVM knowledge, React.js, Typescript, Python\n\n\nCheck our github:\n\n\nSafe Contracts - https://github.com/safe-global/safe-contracts\nTransaction service - https://github.com/safe-global/safe-transaction-service\nSafe Apps SDK - https://github.com/safe-global/safe-apps-sdk\nSafe Core SDK - https://github.com/safe-global/safe-core-sdk\n\n🗂 What you will be doing:\n\n\nEducation - Own and contribute to the developer Gitbook. Liaise with Safe stakeholders to transition documentation into a golden standard. Write blogs and (video) tutorials.\nLead - Own the end-to-end developer strategy for Safe and create structures / processes that will scale developer growth.\nHack - Represent Safe at in-person/remote hackathons, create bounties, facilitate workshops and support hackers.\nCollaborate - Establish sustainable working relationships with community projects. Help them solve integration problems and issues. Contribute thought leadership and inspire others to educate / build, using channels such as Twitter, Forums, conferences / hackathons etc.\nSupport - Answer queries on Stack Exchange, triage issues/bugs from developers. Push and support on technically aligned EIPs.\nContribute - Synthesise and communicate feedback, issues and requirements to the SDKs, Web, and Mobile teams.\n\n🎒 What you will bring:\n\n\nStrong public speaking capability, with proven experience\nThought leadership experience in Web3\nProven experience with Typescript/React\nBasic knowledge of Solidity\nPractical experience with Ethereum and EVM\nBasic knowledge in Python\nNice to have skills:\n\n\nYou have written smart contracts using Solidity\nKnowledge of recent Ethereum core developments (EIPs, beacon chain, account abstraction)\n\n\n🎁 Team and Benefits:\n\n\nLearn more about us and what benefits we offer here: https://gnosis-safe.io/careers\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["developer","relations","dev","lead"]},{"job":"Blockchain Developer","company":"ARTA TechFin","location":"Hong Kong","post_date":"6d","link":"https://web3.career/blockchain-developer-arta-techfin/39902","key":"39902","details":"Exciting things that you will be involved in…\n\nTo join our newly formed development team to build and grow our in-house blockchain solutions\nWorking with external partners using common blockchain frameworks like EVM, Hyperledger Fabric and R3 Corda\nCreate and integrate new financial products and services into our user platforms, including web and mobile apps\nTaking the best learnings and features from Web3 and Defi and applying these to TradFi in robust and scalable ways\nEnjoy coding individually to the highest standards\nWork together as a strong team to solve new problems\n\nHow will you be qualified?\n\nCandidates from Southeast Asia are welcome to apply for this remote-friendly opportunity\nMinimum 2 years of coding experience with 1-3 years of hands-on experience in designing, developing, testing, and shipping blockchain and backend projects\nPossess extensive coding experience\nHands-on experience with EVM stack: Solidity, Web3.js, JS, Truffle/Hardhat, IPFS, etc.\nAdvanced proficiency in blockchain-related programming languages, such as Solidity or Vyper, Go and Javascript or Python.\nGood understanding of common Blockchain frameworks such as Hyperledger Fabric, R3 Corda, etc.\nWorked with CLI, Linux, Git and setting up your own environment\nUnderstanding of the crypto industry and other blockchain projects (NFTs, DApps, DeFi Protocols, etc.)\nHigh-quality and secure software development cycle experience including code reviews, automating, test-driven development, security tests, etc.\nHave the skills needed to prototype fast and iterate quickly\nTireless problem-solver, acting autonomously whilst being a good team player, taking ownership, actively proposing solutions, good communicator\nHave a tech startup mindset\nWilling to adapt to new languages and platforms quickly\nCandidate with more experience will be considered as Senior Developer\n\nNice to have\n\nDesigned protocols or worked with token issuance, DeFi or NFT smart contracts\nHands-on experience with Hyperledger Fabric\nHave worked in a Web3 startup\nExperience with Clouds such as AWS or GCP\n\nARTA TechFin focuses on Financial Services, Financial Technology, and Blockchain / Cryptocurrency. Their company has offices in Hong Kong. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://www.artatechfin.com\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain","web3js","solidity","nft"]},{"job":"Senior Application Support Engineer","company":"Crypto.com","location":"Miami","post_date":"6d","link":"https://web3.career/senior-application-support-engineer-crypto-com/39897","key":"39897","details":"Ensure maximum uptime for multiple production systems\nProvide L1 and L2 application production support to internal users for the trading, data processing, and IT operations\nPerform system operation and administration tasks, including checking and monitor multiple systems performance on a daily basis\nWork closely with internal users to investigate and resolve production system issues, and communicate system enhancement /bug fix requirements to multiple engineering team\nCoding for manual tasks automation and system automation\nExperience to define SLA and OLA with different stakeholders and documentation\nHand-on for incident management, change management and response management and write RCA reports.\n\nCrypto.com focuses on Information Services, Internet Infrastructure, Cryptocurrency, and Blockchains. Their company has offices in Hong Kong, Singapore, and United States. They have a very large team that's between 1001-5000 employees.\n\nYou can view their website at https://www.crypto.com/en/index.html or find them on Twitter, Facebook, and LinkedIn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","senior","customer","support"]},{"job":"Product Director Institutional Trading","company":"Wintermute","location":"London","post_date":"6d","link":"https://web3.career/product-director-institutional-trading-wintermute-trading/39895","key":"39895","details":"Product Director, Institutional Trading\nHybrid – London /\nProduct /\nFull-time\n\nApply for this job\nAbout Wintermute \n\n\nAt Wintermute, our mission is to enable, empower and advance the truly decentralized world for more transparent and efficient markets and products. We do this by providing liquidity algorithmically across most trading venues in crypto, supporting all major centralized and decentralized trading venues, AMMs, RFQs, aggregators and chains.  Wintermute’s customer-facing business includes various OTC products such as electronic trading API and single-dealer platforms for a wide range of counterparties from crypto native whales to large traditional finance institutions. Wintermute is also providing market-making services for blockchain projects where we support most of the world’s largest and most prominent launches. In addition to providing the best in class liquidity products, Wintermute is actively participating in the building and development of the blockchain ecosystem through investments from Wintermute Ventures, partnerships and co-development with upcoming protocols and incubation of its own projects.  Wintermute is a hyper-growth highly profitable business with a very ambitious vision and roadmap. We manage billions of dollars in assets and trade more than $5B/day. We are backed by Lightspeed, Pantera Capital, Sino Global Capital, Blockchain.com Ventures, Avon Ventures by Fidelity Investments, DeFi Alliance and other top-tier investors. We are run as a technology company, not a financial service provider, and we build our culture around core values of ambition, collaboration, entrepreneurship, transparency and meritocracy. \n\n\nProduct Management at Wintermute \n\n\nWe are looking for a Product Director to drive our financial OTC products offering and trading capabilities for crypto native and traditional institutional counterparties. You will be responsible for managing and driving growth for  Wintermute OTC offering across various electronic and voice trading products.  You will be responsible for all commercial aspects of the business from roadmap definition to roadmap execution, to PnL responsibility. You will work cross-functionally and cooperate closely with trading, operations, business development, and marketing. \n\nResponsibilities\nProduct Strategy & Delivery \nDevelop the roadmap for electronic trading products (single-dealer platform, institutional API solutions) as well as for voice trading (derivatives, tailored products, etc) \nManage the execution of the product roadmap which involves managing cross-functional teams, external service providers, as well as being very hands on \nManage the implementation of new products, functionality and features within strict and short timelines\nWork closely with software developers teams and traders and be able to understand and drive both technical and financial product requirements\nGo To Market \nDrive the definition of Go-to-Market strategy in cooperation with the COO and other relevant teams based on a deep understanding of the market, competitive landscape, counterparty needs, product and implementation feasibility\nDevelop new product launch plans including market research, go-to-market, regulatory and technology aspects\nDetail product benefits and features and brief marketing on the correct positioning of the products \nDevelop strategic partnerships and maintain relationships with key counterparties and partners \nCommercial ownership \nBe ultimately responsible for the PnL of the business \nDrive both short-term operational and longer-term strategic initiatives to drive growth and profitability across various products and trading counterparties\nRequirements\nExperience in and deep knowledge of electronic trading products in financial services or crypto\nSpecific experience in electronic trading platforms (e.g. eFX), OTC trading and derivative instruments is a significant advantage\nProduct management or business management experience in the financial services industry or relevant advisory firms\nSolid understanding of transactions lifecycle, incl position management, clearing, margin/collateral management, P&L accounting, etc.\nGood understanding of financial market ecosystem players, their product needs, incentives and constraints\nDegree in Economics, Finance, Mathematics, Business or equivalent experience\nStrong existing network in institutional finance; personal or professional interest in crypto is an advantage\nExperience starting new initiatives from scratch and seeing them through to delivery\nLoves working both with data and with people\nFast learner who takes initiative; ownership mentality / no job is too small attitude\nStructured approach, good judgment of priorities, focus on getting things done  and continuous incremental delivery\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Open roles to rebuild the crypto industry","company":"Wintermute","location":"Remote","post_date":"6d","link":"https://web3.career/open-roles-to-rebuild-the-crypto-industry-wintermute-trading/39894","key":"39894","details":"Open roles to rebuild the crypto industry\nHybrid – London / Singapore / Remote /\nAll teams /\nFull-time\n\nApply for this job\nOpen call for crypto industry talent\n\n\nLast few months have been tough for our industry. We’ve seen some events and personas damaging the reputation of crypto and we’ve seen innocent people, companies and protocols adversely affected by it. In the end, as tough as it is today, the industry is better off without bad actors. \n\n\nAt Wintermute, we remain true to our mission of empowering the truly decentralized world. We work hard to shape an industry to avoid  monopolies, choking points or otherwise recreating the old order under new guise. We strive to empower competition across trading venues, blockchains, protocols and business models. \n\n\nWe are determined to rebuild the industry based on its original ethos.  We see  innovation, transparency, decentralization, and self-custody as core values that need to be preserved and re-emphasized.\n\n\nWintermute was founded in 2017. We have lived through multiple cycles. We weathered the crypto winter of 2018-2019 and spent those years building for the long-term. That set us up perfectly for the exponential growth in 2020 and 2021. We were able to grow by being hard working, smart, innovative and efficient, not by making leveraged bets or playing with other people’s money. And today we are not only the largest crypto native trading firm, but also one of the key and most trusted players in the entire industry. \n\n\nLast two years we have also seen the Wintermute business expand. Leveraging our core strength in proprietary trading and algorithmic liquidity provision, we were able to provide market making to projects and OTC services to a large number of crypto-native and traditional finance players. We have worked alongside the DeFi eco-systems building on all main chains and investing into 75 early DeFi projects. We remained a long-term investor and have not “dumped” any of our strategic investments.  \n\n\nWe have also expanded the Wintermute family and incubated Bebop, a DeFi native trading platform where users can trade one-to-many and many-to-one tokens, with no slippage, and without trusting their funds to a centralized party. We have more exciting new decentralized and centralized projects we are working on! \n\n\nWe are seeing a high level of capitulation in the industry. Some people left because they got disillusioned, some gave up trying, some for purely mercenary reasons. However, for us, the conviction has never been stronger. We want to see people who are, like us, committed and determined to double down on taking the industry forward, to the next level. Ultimately, we want to offer the best people in crypto, the true believers and builders,  an opportunity to join us and build the future together! \n\n\nThese opportunities are for people who:\n\n\n- Want crypto industry to succeed and work hard to make it happen\n- Want to be part of rebuilding the industry based on true innovation that is offered by blockchain\n- Value integrity, transparency and ethical business practices\n- Optimize for personal and professional growth and learning by doing\n- Are ready for an adventurous journey\n- Are more interested in longer-term upside, rather than in short-term guaranteed compensation \n\n\nWe would like to use the application form below to gauge your interest and potentially find a match at: \n\n\n- Wintermute published jobs in software development (C++, Python), algorithmic trading and business operations, https://jobs.lever.co/wintermute-trading\n- Bebop published jobs in software development and business operations\nhttps://jobs.lever.co/Bebop\n- Other opportunities for exceptional candidates (some of these would be published shortly) across our businesses and protocols (see below)\n\nPotential opportunities\nWintermute published jobs in software development (C++, Python), algorithmic trading and business operations, https://jobs.lever.co/wintermute-trading\nBebop published jobs in software development and business operations\nhttps://jobs.lever.co/Bebop\nOther opportunities for exceptional candidates (some of these would be published shortly) across our businesses and protocols (see below):\nProduct and business management roles of different experience levels for institutional trading space and new protocols\nFront-end developers\nHR manager / HR operations\nMarketing, incl. direct marketing, social media and copywriting\nDesigners\nLegal with focus on managing DeFi project topics\nOTC/sales trader\nJunior business development / relationship manager \nRegulatory\nJobs not mentioned here - submit in a relevant functional group\nIf you are interested to apply, please give concise and thoughtful answers to the questions below and indicate your interest. Please bear with us as we are going through applications, as we expect a very high number of responses and are mobilizing internal resources to review and interview candidates. We know that there are a lot of very strong and talented people in the industry and we are looking forward to talking to you!\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["crypto","remote"]},{"job":"Brand Designer","company":"Drift Protocol","location":"Remote","post_date":"6d","link":"https://web3.career/brand-designer-drift-protocol/39893","key":"39893","details":"About Drift Labs Drift is a leading derivatives exchange on Solana. Our mission is to bring state-of-the-art trader-centric experience from centralized exchanges on-chain. We're a team of experienced traders and builders from DeFi and traditional finance working together to make this a reality. Within five months of launching, we have:\n\nHit $10B in cumulative volume traded; Achieved over $50M in trader open interest with $13M in collateral vault balance; Launched 21 trading markets\n\nThe Opportunity Drift is looking for a brand designer to take charge of our branding across all communication channels — from social campaigns to launching new products. Key Responsibilities\n\nDevelop, elevate, and evolve Drift’s brand identity and expression Work closely with Product and Marketing Teams to establish how Drift’s visual identity is strategically expressed across all experiences Lead branding projects across all communication channels from concept to production Develop flexible design systems, guidelines, and templates that scale Collaborate with teams across the company to bring initiatives and new products to market Help lead and creatively direct external collaborators to ensure consistency across all experiences\n\nQualifications\n\nOutstanding portfolio of relevant work Excellent visual design and typography skills Curiosity and willingness to understand the core mechanics of our product and DeFi Proven ability to collaboratively iterate on design concepts and deliver designs in a fast-paced environment Strong presentation, storytelling, and communication skills Good knowledge of Figma and Adobe Creative Suite\n\nNice to Have\n\nUnderstanding of perpetual futures, options, margin trading and derivatives products. Demonstrated experience designing for DeFi, trading or financial related products Experience in animation/motion graphics, illustration, photography, coding, writing, or other specialist skillset\n\nPerks\n\nRemote first - work from anywhere International team meets Stipend for laptop\n\nDrift is an equal opportunity employer and we value diversity at our company. All aspects of employment are based on merit, performance, and business needs. We do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. To apply, fill out this application form.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","design","remote","solana"]},{"job":"Product Manager","company":"Fortress Web3 Technologies","location":"Austin","post_date":"6d","link":"https://web3.career/product-manager-fortressweb3technologies/39891","key":"39891","details":"Who is Fortress?\nFortress Blockchain Technologies is purpose-built to deliver financial, regulatory, and technology infrastructure to the rapidly emerging Web3 space. The company provides financial services, including compliance, payments, custody, trustee-of-assets, escrow, crypto liquidity, and other services. A minting engine for fungible and non-fungible tokens as well as tools for the distribution and management of tokens. A secure, user-friendly NFT and crypto wallet that can be integrated into third-party mobile and web applications.\nJob Summary:\nWe are looking for a skilled product manager driven by first principles to build our evolving world-class products. The product manager will execute strategic initiatives and maximize ROI through the research and development of our product suite.\nThe ideal candidate will be joining us to focus on one of our three key product areas. You will have key early impact in our products and have true ownership over their outcomes.\nThis is an opportunity to be early in our product-market fit and to help establish the go-to-market with a well funded and positioned company. We already have the first version of our products live with early customers onboarded and using our product.\nIf you are seeking an opportunity to have impact and grow as a product manager, let’s chat!\nResponsibilities:\n\n\nHelp define the product roadmap across MVP definition & design, MVP alpha/beta versions, and go-to-market phases of software development.\nPartner with the research and development team building products by defining the strategic product direction, including the product vision, strategy, and prioritized use cases.\nDrive the return on investment (ROI) in the research and development of your products with the product triad (product, design & engineering).\nChampion the voice of the customer and users, with a deep understanding of target market segments, UX personas, pain points, and customer journeys.\nDeliver measurable business impact by aligning team efforts on the highest value opportunities.\n\nThe Right Person(ality):\n\nSeeking growth, impact, and autonomy.\nDriven to work with teams of highly conscientious, diverse, high performing, and talented experts.\nDriven to take action and execute an accountable for decisions.\nPossess a beginner’s mindset and long-term orientation.\nAct with strong interpersonal, analytical, and communication skills combined with intellectual curiosity.\nEnthusiastic about crypto, web3, and blockchain technology.\n\nQualifications:\n\nExperienced in a startup and high-growth environments.\nExperienced in scaling products, from MVP to scaling for mass commercialization.\nExperienced in building and growing an efficient and effective product team.\nExperienced in managing or collaborating with teams of engineers and designers.\nFamiliar with standard product management tools, roadmaps, and analytics (JIRA, Confluence, etc.).\nHighly skilled at analysis with the ability to use data and metrics to confirm assumptions and make decisions.\nHoned with strong product intuition and judgment when information and time are constrained.\n\nWe offer:\n\nHighly competitive compensation packages.\nComprehensive benefits, including 100% paid medical insurance coverage for you and your dependents.\nUnlimited PTO.\nPaid Holidays.\nProfessional growth and development.\n\nPhysical Requirements:\n\nProlonged periods of sitting at a desk and working on a computer.\nMust be able to lift up to 15 pounds at times.\n\nFortress Blockchain Technologies is an equal opportunity employer, meaning that we do not discriminate based upon race, religion, national origin, gender identity, age, sexual orientation, or any other protected class. We believe that diversity is more than just good intentions, and we are committed to creating an inclusive environment for all employees.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","nft"]},{"job":"Business Development Merchant Acquisition","company":"Binance","location":"Europe","post_date":"6d","link":"https://web3.career/business-development-merchant-acquisition-binance/39889","key":"39889","details":"Business Development - Merchant Acquisition\nRemote – Europe /\nBusiness Development – Business Development /\nFull-time: Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWill be leading the merchant acquiring for crypto based payment solutions and be responsible for portfolio growth via aggressive merchant acquisition and relationship management activities including reviewing and analysing merchants’ performance and profitability.\nResponsibilities:\nPromote and present crypto based payment solutions and other banking products to merchants as per their business needs.\nLeverage prospect and contract new merchants and partners by presenting the appropriate solutions for the business.\nWork in close collaboration with the global key accounts for referrals and securing appointments.\nGenerate, maintain and increase business opportunities with existing merchants.\nPrepare reports as required regarding business development including market comparison analysis, business opportunities, recommendations, etc.\nLiaise with other departments such as compliance, regulatory, legal etc. to facilitate smooth operations and ensure prompt and accurate delivery of service.\nRepresent the company in various events, socializing events and other activities and facilitate the promotion and branding of the company, its products/ services.\nTechnical & Behavioural Skills:\nBe assertive and have the ability to lead a long-run project.\nExcellent interpersonal and communication skills for presentation and negotiation.\nSelf-driven and proactive.\nBasic understanding of the cross border money flow.\nMust be able to demonstrate they can close deals and create leads and maintain a merchant pipeline.\nA good network of global merchants.\nQualifications & Experience:\nMin Degree in Banking / Finance / Marketing or any related field.\nAt least 5 years of working experience in Merchant Acquiring BD experience in the Banking Sector/Fintech/Telecom companies would be an advantage.\nProven track record on startup or build business from 0 to 1.\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech"]},{"job":"Head of Surveillance and Monitoring Binance Futures","company":"Binance","location":"Paris","post_date":"6d","link":"https://web3.career/head-of-surveillance-and-monitoring-binance-futures-binance/39888","key":"39888","details":"Head of Surveillance and Monitoring - Binance Futures\nRemote – France, Paris /\nLegal & Compliance – Compliance /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nWe have an exciting opportunity to be part of the evolution of financial services by leading the Surveillance and Monitoring of a Multilateral Trading Facility (MTF), reporting to the Chief Compliance Officer and the Board. You will establish the market surveillance and monitoring oversight function in a new legal entity. Principally the business of this entity is trading futures contracts. \nResponsibilities:\nSupport the board with their accountability for compliance with MiFID and MAR with market surveillance/monitoring and oversight of outsourced functions\nOversee the outsourced providers' adherence to the written agreement of the MTF rights and the provider's obligations under the service level agreements\nManual monitoring and investigation, including testing the effectiveness of the automated systems and assurance reporting to the board\nProvide advice on applying MiFID and MAR as it relates to the MTF \nSuspicious Transaction Order Reporting assessment and reporting \nLiaising with authorities\nReview and approve investment recommendations and statistics recommendations\nRegular board reporting\nRequirements:\n10 years minimum operational experience in market surveillance and monitoring in an EU or UK MiFID Investment firm or a Regulator\nOperational knowledge of relevant legislation and regulation, including; MiFID2/R, MAR, and BMR\nExperience ensuring compliance that required regulatory reports get submitted on time\nThe ability to work independently in a fast-paced, global organisation and maintain close contact with relevant teams across multiple locations\nFluency in French\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Executive Assistant","company":"Binance","location":"Europe","post_date":"6d","link":"https://web3.career/executive-assistant-binance/39887","key":"39887","details":"Executive Assistant\nHybrid – Europe /\nFinance & Administration – Finance & Administration /\nFull-time Onsite or Remote\n\nApply for this job\nBinance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\n\nYou will help drive strategic projects and meetings, facilitating the team’s efficiency and ensuring the vision and strategy is clearly communicated and executed. This is a role for someone who is very well organised, structured and used to fast-paced environments.\n\n\nResponsibilities\nEnsure the vision and business priorities are well communicated to the team, facilitate business decision making, strategic planning, leadership meetings and broader communications\nMonitor key projects and initiatives\nManage executives’ calendars and set up meetings\nHost internal meetings and take notes of discussion\nFollow up on strategic team meetings and projects progress for the team, drive stakeholder reporting\nPrepare memos and communications content for internal / external audiences  \nSupport on other ad hoc and administrative tasks\nRequirements\nMinimum 5 years of executive assistant, project management, consultancy and/or similar relevant work experience\nBachelor degree or higher would be preferred\nComfortable working in an extremely fast paced and international environment\nExperience supporting c-suite/senior stakeholders \nStrong project / program management and organisational skills \nAbility to communicate and influence stakeholders and team members who are based in different parts of the world \nKnowledge of Google Calendar, Meet, Doc, Slides, and Sheets\nOpen to extensive travel\n\n\n\n\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\n\n\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive"]},{"job":"Smart Contract Engineer","company":"Empiric Labs","location":"New York","post_date":"6d","link":"https://web3.career/smart-contract-engineer-empiriclabs/39885","key":"39885","details":"About Empiric Labs\nEmpiric Labs is building essential zk-rollup infrastructure for Ethereum. Our work is at the cutting edge of cryptography and blockchain technology.\n\nWe are building Empiric Network, the first live oracle on StarkNet and the leading provider of robust data feeds to the ecosystem today. The network is powered by data partners that include Alameda Research, Jane Street, Gemini, CMT Digital, Flow Traders and more. Because Empiric Network is entirely on-chain, protocols using Empiric finally have access to data that is as verifiable, transparent and secure as the smart contracts themselves. Empiric is also pioneering computational feeds that combine its high-quality, real-time market data in novel ways — entirely on-chain and verifiable by leveraging zero-knowledge computation. These advanced computational feeds will enable the next generation of DeFi protocols to go beyond what is possible today.\n\nWe recently raised a $7M seed round led by Variant and joined by ecosystem partners such as StarkWare and Sandeep Nailwal (Polygon), as well as a stellar group of investors such as Thomas Bailey (Road Capital), Marc Bhagarva (Tagomi), Luke Pearson (Polychain), Max Kleiman-Weiner (Sequoia), Tekin Salimi (DAO5), Tarun Chitra (Gauntlet) and Robert Leshner (Compound).\n\nYou can read more at our docs and take a look at our open source code.\n\nWhat You’ll Do\nDevelop secure contracts that make up our entirely on-chain architecture (Cairo & Solidity)\nCreate both internal and public tooling that will help us and the ecosystem move faster\nCreate smart contracts on the Ethereum L1 that bridge over critical data, such as Uniswap TWAP rates or Aave overnight rates (Solidity)\nThink from first principles to tackle challenges at the cutting edge of cryptography, smart contracts and data - prioritizing safety and robustness\n\nRequirements\nYou're living in NYC and willing to come to the office\nYou have deployed smart contracts to mainnet before that have traction (in terms of usage and / or TVL and / or transaction volume)\n>2y of professional experience, bonus if you've worked in smart contract auditing (e.g. OpenZeppelin, Nethermind, Consensys, Trails Of Bits, Zelic...)\nPlease share your GitHub account, and if possible link to some of the smart contracts you've worked on\nBig bonus if you've experience with the Starknet ecosystem (specifically the Cairo programming language)\n\nOur Offer\nBe at the cutting edge of web3 and help build critical infrastructure for the future of Ethereum\nLearn together with a world-class team, and our friends at StarkWare and within the StarkNet ecosystem\nA fast-paced, no bullshit work environment that has high expectations and helps you achieve them\nWork on a project that is growing extremely quickly and has clear product-market fit in an existing market — while also pursuing moonshot opportunities to re-define trustless data fetching\nAbove-market compensation and meaningful equity\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","solidity","ethereum"]},{"job":"Lead Blockchain Developer","company":"In Technology Group Inc (US)","location":"United States","post_date":"6d","link":"https://web3.career/lead-blockchain-developer-intechnologygroupinc-us/39884","key":"39884","details":"Lead Smart Contract Engineer - Solidity\n\n$250K + tokens/equity\n\nFully Remote, North America\n\n\n\n\nThis is a very exciting role. I’ll try and keep this description brief and to the point, so if you want more info then just apply or email me directly on owenw@intechnologygroup.com.\n\n\n\n\nThis is what is on offer:\n\n\n\n$250K salary\nToken rights and equity\nFull benefits (medical, vision, and dental)\nFlexible PTO\nSmall remote-first team across many countries\nExceptionally talented colleagues from firms such as Goldman Sachs, Digital Assets, DeFi protocols, Facebook, SpaceX, Microsoft & much more\nIncredibly well-funded backing – I can provide a full list upon request\n\n\n\nWhat is the company is doing:\n\n\n\nExpanding the number of opportunities in DeFi for financial services such as derivatives, lending & trading.\n\n\n\nWhat will you be doing:\n\n\n\nBuilding crypto-native projects deployed on an EVM mainnet.\nDeveloping innovative decentralized finance primitives, supporting complex financial products.\n\n\n\nWhat experience do you need to be considered for this vacancy?\n\n\n\nSolidity – 3+ years\nEthereum\nFoundry\nHardhat\nOpenZeppelin\n\n\n\nBonus experience includes:\n\n\n\nDeFi industry\nTesting\nSecurity\nAuditing\n\n\n\nThis is a brief overview – for more details, get in touch by applying for this vacancy or emailing me directly with your resume to ownw@intechnologygroup.com.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","lead","blockchain","solidity","ethereum"]},{"job":"Manager of Customer Experience","company":"Mastercard","location":"United States","post_date":"6d","link":"https://web3.career/manager-of-customer-experience-mastercard/39883","key":"39883","details":"Our Purpose\n\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\n\nJob Title\n\nManager of Customer Experience\n\nWho is Mastercard?\n\nAt Mastercard, our industry expertise is enhanced by our commitment to being a force for good in the world and to doing well by doing good. Mastercard relies on our global workforce to help us achieve our goal of building a sustainable, inclusive global economy. The Mastercard Way encourages us, connects us with the behaviors that represent the essence of not only what we do but who we are as an organization. Cultivating an environment for all employees that respects their individual strengths, views and experiences drives a global and collaborative culture of inclusion and sense of belonging.\n\nOverview\n\nThe Manager is expected to deliver high quality, comprehensive support to CipherTrace customers by contribute to a technical team chartered to provide support services to the CipherTrace customer base. Oversee and participate to provide subject matter expertise for the product suite in a fast paced, dynamic environment; managing daily operations by adjusting projects and initiatives, and keeping the global support queue priorities in focus, and training to ensure satisfaction with internal stakeholders, partners and end customers.\n\nRole\n\nManage and facilitate satisfactory resolutions to service issues by identifying call escalations, reacting with a sense of urgency, formulating appropriate action plans, and utilizing resources effectively. Offer and implement creative solutions within technical support. Interface effectively with other CipherTrace departments in order to provide overall workstream effectiveness.\n\nManage daily operations to include metrics to develop action plans and manage to key technical support metric targets, identify trends, and forecast needs.\n\nPrepare and present performance reviews.\n\nPrepare and implement enhancements within the technical support function.\n\nAll About You\n\nExcellent customer skills and dedication to customer service.\n\nPeople management experience.\n\nExcellent interpersonal, motivational, and managerial skills with a staff of at least 5+ employees. Ability to manage conflict situations constructively.\n\nProfessional communication skills, both written and verbal.\n\nAbility to multi task and prioritize projects, time manage, and practice detail oriented organizational skills.\n\nFamiliarity with Linux based OS distributions, SQL syntax, Cloud based deployments, REST based APIs.\n\nNice To Have\n\nTechnical Knowledge of gRPC, Cloud (AWS and/or GCP) technologies (e.g. Kubernetes, Terraform), scripting languages (e.g Python, Go)\n\nNon-Technical knowledge of the Cryptocurrency space, DeFi, Blockchains/DLTs, Financial Regulation, CRM software (e.g. Hubspot, Service Desk), Agile methods (e.g. Kanban),In the US, Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\n\nCorporate Security Responsibility\n\nResponsibilities\n\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must\n\n\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["customer","support"]},{"job":"UI UX Lead Blockchain","company":"Belmont Lavan Ltd","location":"London","post_date":"6d","link":"https://web3.career/ui-ux-lead-blockchain-belmontlavanltd/39880","key":"39880","details":"We are currently looking for a UI/UX Lead to work with User Experience Designers, Visual Designers, User Researchers, Front End Engineers, Business Analysts, Copywriters, and other Marketers on a regular basis across several market leading Web3 projects focused on both Gaming and NFT’s.\n\nResponsibilities:\n\nCollaborate with leadership and team members across design, engineering, product management, and marketing\n\nDefine, craft, and evolve designs that fit within visual systems and/or standards\n\nProactively solicit feedback from stakeholders and provide feedback to the broader product team to strive for better quality\n\nReview existing products and do product testings and improvement reports\n\nWork with outsourcing companies to review their UI/UX, research deliveries\n\nLead and mentor the design team to streamline work flows and improve UX strategy across multiple projects\n\nBecome familiar with crypto-user thinking and stay on top of upcoming trends and figure out the user behavior and user journey for our target user.\n\nOnly candidates with an online (or PDF) portfolio will be considered\n\nDemonstrable UI/UX design experience within a lead capacity\n\nProficiency in design software including Figma and Photoshop\n\nExperience with websites\n\nStrong sense of responsive design, UX and technology trends\n\nAbility to conduct user research, A/B testing and iteration usability testing\n\nComfort with an iterative design process that includes accepting and acting on feedback\n\nStrong understanding of blockchain, cryptocurrency or e-commerce is preferable\n\nSelf-driven, a growth mindset\n\nA player/coach mentality.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["lead","design","non-tech","blockchain","nft"]},{"job":"Product Manager Crypto Infrastructure","company":"Crypto Finance AG","location":"Zurich","post_date":"6d","link":"https://web3.career/product-manager-crypto-infrastructure-cryptofinanceag/39879","key":"39879","details":"Come join us at Crypto Finance Group. We are a fast-growing company, where everyone plays an important role. We welcome you to join us and help shape our future.\n\nAbout Crypto Finance\n\nCrypto Finance - a FINMA regulated financial institution and a member of Deutsche Börse Group, offers professional digital asset solutions. This includes one of the first FINMA-approved investment firms with 24/7 brokerage services, custody, infrastructure, and tokenisation solutions for financial institutions, as well as the first FINMA-approved manager of collective assets for crypto assets, with an active, rules-based and index-based alternative investment fund offering, including the first Swiss crypto fund. With a team of over 90 employees, Crypto Finance is headquartered in Switzerland, and has a regional presence in Singapore. Since its founding in 2017, company has received numerous awards, including Crypto Valley Top 50 Blockchain Company, Top 100 Swiss Start-up, and winner of the Swiss FinTech Award 2019. The Crypto Finance Group is a fast-growing, exciting place to work with tremendous opportunities for personal development and professional advancement.\n\nWe are looking for a Product Manager- Crypto Infrastructure, with a “security-first” mindset, who is passionate about building products that customers love. You will join a dynamic and fast-paced environment, and work with cross-functional teams to design, build, and roll out products that deliver the company’s vision and strategy.\n\nAs a Product Manager at Crypto Finance (Brokerage) AG, you will work in close cooperation with other Product Managers as well as with Engineering, Business Development, and Marketing throughout the product lifecycle. Join us and become the go-to expert in the product’s business, market, and competition. You will help tell the success story of the product: from developing the vision and creating the roadmap to conducting market research and applying industry insights based on the inputs from internal stakeholders and customers.\n\nThe starting date is as soon as possible in our new office in the Prime Tower in Zurich.\n\nKey responsibilities:\n\nActively shape product roadmaps, pipelines, and deadlines while managing and coordinating projects across different teams and disciplines, e.g. engineering, operations, legal, marketing, and finance\nCollect, manage, and maintain traceability of requirements from all stakeholders, especially clients and users, across product releases as well as monitor, report, and improve product performance based on collected data, trials, MVPs, and customer feedback\nAssess pricing and revenue potential in addition to developing and delivering go-to-market launch plans\nWrite and maintain easy-to-understand technical (and client-facing) documentation as well as prepare and oversee demos, workshops, and training sessions with clients and colleagues\n\nWhat we are looking for:\n\nExcellent blockchain and crypto-related knowledge with a broad understanding of both the industry and landscape\nA “security-first” mindset and expert knowledge in private key management\nProven track record of building products or managing technical projects in crypto assets, cryptography, IT security, or similar fields - ideally with experience in managing agile software development processes\nAbility to understand and break down processes of complex technical and economic structures\nCollaborative self-starter who thrives in a fast-paced, highly dynamic environment\nAbility to lead, inspire, and motivate teams\nExcellent interpersonal and communication skills in English\nAbility to work well under tight deadlines, which may include working outside of business hours\n\nWhat we offer:\n\nBecome part of a leading company in the crypto asset space\nBe at the forefront of developments around blockchain-based assets\nLearn and grow in an inspiring, dynamic, and developing industry\nTake on and be responsible for individual projects\nJoin a friendly team with weekly knowledge-sharing sessions\nWe have an entrepreneurial, fast-paced culture, flat hierarchies, and we foster talent\n\nIf you have a Swiss work permit or you are an EU/EFTA citizen, please send us your full application in German or English, incl. a cover letter, CV, and references.\n\n\nPlease note:\n\nWe do not accept CVs from recruiting or staffing agencies.\nDue to the Swiss labour legislation, we can only accept applicants who have the right to work in Switzerland (are in possession of a Swiss work permit or are EU/EFTA citizens). All other applications will not be considered.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["product","manager","non-tech","crypto"]},{"job":"Smart Contract Engineer Solidity Engineer","company":"Austin Werner Ltd 🚀🚀","location":"San Francisco","post_date":"6d","link":"https://web3.career/smart-contract-engineer-solidity-engineer-austinwernerltd/39878","key":"39878","details":"Senior Smart Contract Engineer\n\n\n\n\nSeeking a Web3 Developer with the experience to contribute to new and existing products immediately. The role requires knowledge of Javascript, Node.js, and React. The role requires expert level experience in Smart Contract Development and a deep understanding of the Ethereum Virtual Machine. This person should have experience building and shipping production-level web applications from inception and be able to write and maintain documentation.\n\n\n\n\nThe ideal candidate is organized and productive in a fast-paced environment. They should have experience with Web3.js, Ganache, Truffle, Ethers, OpenZeppelin, Hardhat, Solidity, APIs, and Serverless Execution Environments. They should have a strong portfolio of Web3 projects built on Ethereum, Solana, or Polygon. This candidate should be able to work autonomously and is comfortable in a startup-like environment.\n\n\n\n\nWhat You’ll Be Doing\n\nBuilding new Web3 product from their inception\nContribute directly to decentralized technologies on the Platform\nArchitect and build new web3 technologies technologies on the Platform\nHelp FE Teams build reusable components and front-end libraries for future use\nBuild and manage NPM packages\nLead sprint planning and standups to discuss priorities and manage issues\nMaintain documentation and write automated tests to ensure a quality product\nRegularly monitor and improve app performance, diagnose and fix bugs\nIllustrate architectural ideas using storyboards, process flows, and sitemaps\nIdentify and troubleshoot API problems (e.g. performance, rate limiting, etc)\nConduct adjustments based on user and stakeholder feedback\n\n\n\nRequirements\n\n1-3 years of experience developing original smart contracts with Solidity\n1-3 years of experience with Hardhat, Truffle, Brownie or a comparable framework\n5+ years of general software development experience (knows and can apply agile, knows TDD)\nA deep understanding of the Ethereum Virtual Machine\nPrior experience deploying original smart contract systems to some EVM mainnet\nAbility to prioritize and organize operationally complex work, with great attention to detail; are accountable by default\nSkill in at least one of the following: mainnet deployment, blockchain tooling, dapp development\nStrong written and verbal communication skills and can collaborate effectively on a breadth of technical topics\nSelf-driven, autonomous, personality with a desire to develop protocols that will have an impact\nA proactive self-starter who wants to take as much ownership as possible for their work, and is highly proactive about expanding the scope of their work\nYou are active in crypto and have previously built Web3.js enabled applications\nYou are comfortable with API integrations\nYou have contributed to open source projects\nYou can demonstrate the ability to ship beautiful products and meet deadlines\nAbility to write well-documented, clean code, and have excellent attention to detail\nYou use automated testing tools, browser-based debugging, and performance testing tools daily, and can implement CI/CD\nYou prefer to code but can understand business requirements and translate them into technical requirements\nYou have a desire to move into a engineering leadership role in the future\nYou are obsessed with performance and have a desire to build fast, functional, and innovative web applications\nYou are highly capable of time management, project management, and working autonomously\nTeam spirit, strong communication skills to collaborate with various stakeholders\n\nPlease feel free to contact andres.altuve@austinwerner.tech for more information.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","solidity","web3js","react"]},{"job":"Customer Success Manager","company":"Magic","location":"San Francisco","post_date":"6d","link":"https://web3.career/customer-success-manager-magic/39877","key":"39877","details":"About\n\nFounded by the creators of Fortmatic, Magic is a Web3 infrastructure company that empowers developers to create seamless and secure user onboarding experiences, abstracting away the complexities of blockchain technology. We are backed by top investors such as Tiger Global, Lightspeed Ventures, SV Angel, Social Capital, Northzone, Placeholder, Naval Ravikant, Alexis Ohanian, and Balaji Srinivasan.\n\nTo date, Magic has enabled more than 91,000 developers and enterprises to onboard over 10 million users to the Web3 ecosystem — and we continue to grow rapidly. We are trusted by leading NFT marketplaces such as Immutable, Niftys, OpenSea, Decentraland and major enterprise Web2 companies alike.\n\nIf you are excited to make Web3 accessible and help onboard the next billion users, let’s chat!\n\nThe Role\n\nMagic is hiring its first Customer Success Manager. This is a unique opportunity to build a best in class post-sale function for a startup experiencing sudden, rapid growth in enterprise sales. You will act as a trusted advisor to our customers, fostering a deep understanding of their business and their needs, while maximizing the value they get from Magic. You will be the customer’s internal advocate, helping ensure an excellent Magic experience, ensuring successful launches while gathering feedback on ways that Magic can build the next generation of user-focused solutions. You will love this job if you are a natural relationship and business builder.\n\nResponsibilities\n\n\nLead customer onboarding, launches, retention, and growth, partnering closely with the Sales, Customer Success Engineering, and Product teams.\nStay up-to-date on the latest successes and failures of large companies executing Web3 strategies so you can guide customers to success.\nSupport expansion of your accounts - identify opportunities, drive business outcomes, ensure customers are successful in partnership with the account team.\nWork with Product Marketing to evangelize customer success stories.\nArticulate and drive customer use cases, customer value and expansion while maintaining trusted customer advisor status\nDrive overall account health including payments performance, cost optimization, product adoption, usage velocity, account renewals and growth, referrals, and customer satisfaction\n\n\nWho You Are\n\nYou’re excited about how Web3 can change the Web and world at large and want to see how the world’s biggest brands will pioneer paths forward.\nYou’re excited to be the first in the CSM function and lay the foundation for all who follow.\n2+ years of experience in a client-facing roles, such as customer success, sales, and/or partnership management.\nExperience at a software company with a technical product and customers.\nExperience planning customer roadmaps, QBRs and account plans\nProven track record of achieving targets and goals, preferably in a sales setting\nTrack record of managing large, complex projects and/or programs\nExperience handling difficult customers or situations and can demonstrate resolutions\nWillingness to tackle things on your own\nAbility to gain a strong understanding of our business and products, and an ability to research/self-start\nThe motivation and flexibility to work well in a high-growth environment where things change quickly\n\n\nBenefits\n\nFully remote team and flexible working hours\nCompetitive salary and stock options\nUnlimited paid time off\nPlatinum-level Health, Vision, and Dental insurance – Magic covers 99%\n401(k) program\nTop of the line equipment\n$300 monthly budget for home office needs and professional development\nAnnual team meetups\n\n\nAt Magic, we believe building a team full of diverse perspectives and experiences is vital to success. We strongly encourage anyone who has been historically under-represented in tech to apply for this role. Magic does not discriminate on the basis of gender, sexual orientation, race, religion, citizenship status, age or physical ability. Empathy, authenticity, and inclusivity are at the core of all we do.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","customer","support","nft"]}]}