{"jobs":[{"job":"Front End Web Developer Marketing","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/front-end-web-developer-marketing-certik/40124","key":"40124","details":"Front End Web Developer - Marketing\nUS / Remote /\nMarketing /\nFull-time\n/ Remote\n\nApply for this job\nFounded in 2018 by professors of Yale University and Columbia University, CertiK is a pioneer in blockchain security, utilizing best-in-class AI technology to secure and monitor blockchain protocols and smart contracts. CertiK’s mission is to secure the cyber world. Starting with blockchain, CertiK applies cutting-edge innovations from academia into enterprise, enabling mission-critical applications to be built with security and correctness. \n\n\nCertiK is one of the fastest growing and most trusted companies in blockchain security and has become a true market leader. To date, we have collectively worked with over 3200 enterprise clients, helped secure over $310 billion worth of digital assets, and detected over 31,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz. Our Q1 2021 revenues have more than quadrupled the revenue of the full 2020 year. Since Q1 2020, our team size has more than doubled, and this rate of growth will continue in 2021, creating a highly effective, remote-friendly culture with talents located worldwide. \n\n\nCertiK just raised over $290 million in Series B, B+, B2 and B3 funding rounds over four months in 2021, putting the company over  $2 Billion in valuation. Our investors include top VCs like Insight Partners, Sequoia, Tiger Global, Advent International, SoftBank, Goldman Sachs, Coatue Management, Lightspeed, Shunwei Capital and Hillhouse Capital as well as industry leaders like Coinbase Ventures and Binance. \n\n\nAbout the Role\nWe’re looking for an energetic, creative minded, well organized, and self-motivated Front End Web Developer to support our corporate website. If you are comfortable in a new emerging space like Blockchain/Crypto/NFT, and have the attitude of figuring things out, driven by results, and adapt to additional responsibilities, then keep reading. \n\nResponsibilities\nOwn web development for marketing related web pages. \nCreate a beautiful UI and a functional UX.\nUnderstand complex business domains.\nProduce high-quality, well-architected code.\nSuccessfully deliver complex projects with convoluted interdependencies.\nWrite and review high-quality, well-architected code (Javascript, Typescript and React).\nRequirements\n3-5 years of frontend development architecture experience.\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.\nThorough understanding of React.js code and its core principles is a MUST.\nExperience with popular React.js workflows (such as Flux or Redux).\nKnowledge of isomorphic React is a plus.\nFamiliarity with RESTful APIs.\nKnowledge of modern authorization mechanisms, such as JSON Web Token.\nFamiliarity with modern front-end build pipelines and tools.\nFamiliarity with JIRA.\nAbility to understand business requirements and translate them into technical requirements.\nFamiliarity with Blockchain, Crypto, NFT is nice to have.\nCompensation\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","front","end","marketing","non-tech","remote"]},{"job":"Business Development Manager","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/business-development-manager-certik/40123","key":"40123","details":"Business Development Manager\nUS / Remote /\nMarketing /\nFull-time\n/ Remote\n\nApply for this job\nAbout the Company\nFounded in 2018 by professors of Yale University and Columbia University, CertiK is a pioneer in blockchain security, utilizing best-in-class AI technology to secure and monitor blockchain protocols and smart contracts. CertiK’s mission is to secure the cyber world. Starting with blockchain, CertiK applies cutting-edge innovations from academia into enterprise, enabling mission-critical applications to be built with security and correctness.\n\n\nCertiK is one of the fastest growing and most trusted companies in blockchain security and has become a true market leader. To date, we have collectively worked with over 1800 enterprise clients, helped secure over $310 billion worth of digital assets, and detected over 31,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nCertiK just raised over $140 million and backed by Coatue, Tiger Global, Sequoia, and Hillhouse Capital.\n\n\nAbout the Role\nWe’re looking for an experienced, results-driven Director of Brand Marketing to help us establish a strong brand strategy and collaborate with the executive team to set the long-term company vision for our emerging technologies. As a seasoned marketing professional, you will have major impact and responsibilities in growing the success of the company.\nApplicants must have extensive experience in not only setting strategic vision, but also creating and executing on a thorough action plan to achieve that vision. This is a unique opportunity for someone to join the team and integrate marketing best practices into a heavily technical organization at the forefront of blockchain, cybersecurity, quantum research, and more.\n \nBlockchain experience isn’t required, but the right individual will have prior experience in the emerging technologies space, including but not limited to AI, autonomous driving, and other deep tech. CertiK is a global organization, so experience in brand marketing on an international level is also a plus.\nResponsibilities\nAchieve assigned sales goals\nResearch market and perform analyses to define offerings and identify potential new and target clients\nDevelop and maintain key customer relationships\nDevelop sales and marketing strategies to reach target markets\nAnalyze competitors and their service offerings and identify opportunities to raise the profile of the practices and partners\nIdentify and evaluate sponsorship and speaking opportunities at conferences and seminars, and ensure effective participation and ROI; support preparation and follow-up for these initiatives\nWork with the Product Management team to contribute to sales and marketing plans and product development\nRequirements\nBachelor’s degree in Marketing, Business, or equivalent experience\nAt least three years of experience in information technology related area\nAt least three years of experience with scaling and managing marketing teams\nAbility to prioritize based on urgency, impact, and effort\nExceptional communication skills\nBonuses\nMBA or Master’s degree\nExperience in crypto or blockchain industry\nMultilingual\nExperience in global marketing\nTarget annual salary for this role performed in the US is $60,000 - $80,000.\n\n\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","remote"]},{"job":"Internship Spring Summer 2023 Software Engineer Tools","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/internship-spring-summer-2023-software-engineer-tools-certik/40122","key":"40122","details":"Internship Spring/Summer 2023 - Software Engineer, Tools\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nInternship /\n/ Remote\n\nApply for this job\nWhy us? \nBlockchain technology is enabling a rapidly-growing era of innovation for the digital world. It is crucial that blockchain code such as protocols and smart contracts be correct. Once deployed, such code is public and difficult or not possible to change. Vulnerabilities and bugs in such programs regularly put millions of dollars at stake. \nThis is where CertiK comes in. We are the leading blockchain security company. Our goal is to secure the cyber world by applying cutting edge techniques from academia to secure blockchain code. Come and join us to help work on tools for securing blockchain programs! \n\n\nWhat you will do\nYou will design and develop tools that automatically identify security issues or assist security auditors to locate security issues. You will collaborate with security auditors to understand blockchain security issues. You will have the opportunity to work on all stages of tool development from idea generation to implementation and iterative improvements. We develop and apply technologies such as static analysis, model checking, fuzz testing, language-based security (such as type systems), automated program verification, and theorem-prover based program verification. Our team is highly supportive and collaborative with great opportunities to learn and grow.\n\n\nAbout you\nYou are a self-starter and excellent at programming. You love to solve problems and get results, where results are people using your tool to do their jobs. You believe in solving the most important problems, even if they are the most difficult ones. You are collaborative: you share ideas, love to brainstorm with peers, and give and receive feedback. You are comfortable with the unknown and understand that #startuplife means that you need to be creative, flexible, and focused on results.\n\nResponsibilities\nDesign and develop software tools that help identify blockchain security issues.\nWork on all aspects of delivering working software that meets customer needs, including analysis, design, automated testing, operations, CI/CD, measuring results, incorporating customer feedback, and support.\nCollaborate with other software engineers on developing tools.\nLearn new verification and security analysis technologies.\nRequired Qualifications\nPursuing Bachelor's Degree or higher in Computer Science or s related field.\nDemonstrated knowledge of fundamental computer science concepts such as data structures, algorithms, testing, and source code control.\nAt least 1 year of experience programming in an object-oriented language or functional programming language.\nPreferred Qualifications\nExperience with one of the following: static analysis, program verification, model checking, fuzz testing, compilers, or related technologies. At least one course or equivalent experience.\nPursuing a Masters or PhD in Computer Science or related field.\nStrong and creative problem-solving skills; always willing to embrace new technologies and collaborate.\nAbout the Company\nFounded in 2018 by professors of Yale University and Columbia University, CertiK is a pioneer in blockchain security, utilizing best-in-class technology to secure and monitor blockchain protocols and smart contracts. CertiK’s mission is to secure the cyber world. Starting with blockchain, CertiK applies cutting-edge innovations from academia into enterprise, enabling mission-critical applications to be built with security and correctness.\n\n\nCompensation\n$5000 - $8000/month (full-time). The compensation will be determined by the skills and experience of qualified candidates.\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","intern","entry","level","remote"]},{"job":"Software Engineer Engineer III to Principal Formal Methods","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/software-engineer-engineer-iii-to-principal-formal-methods-certik/40121","key":"40121","details":"Software Engineer (Engineer III to Principal) - Formal Methods\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nEngineering – Engineering - Tools /\n/ Remote\n\nApply for this job\nWhy us? \nBlockchain technology is enabling a rapidly-growing era of innovation for the digital world. It is crucial that blockchain code such as protocols and smart contracts are provably secure and correct. Once deployed, they are public and cannot be changed. Vulnerabilities and bugs in such programs regularly put millions of dollars at stake. This is where CertiK comes in. We are the leading blockchain security company. Our goal is to secure the cyber world by applying cutting edge techniques from academia to secure blockchain code. Come and join this ambitious mission as a research software engineer to work on automated analyses for provably secure and correct blockchain applications! \n\n\nWhat you will do\nYou will design and develop tools that automatically ensure the correctness of smart contracts or identify security issues and bugs in smart contracts. We have software engineer positions available at all levels of seniority. Title and responsibilities will be commensurate with experience and background.\nAs part of our multinational team of programming language experts, you will participate in the development of tools that rest upon techniques such as symbolic model checking, SAT/SMT solving, abstract interpretation, data flow analysis, and deductive verification. You will have the opportunity to work on all stages of tool development from idea generation to implementation and iterative improvements. Our team is highly supportive and collaborative with great opportunities to learn and grow.\n\n\nAbout you\nYou have a background in programming language theory and automated reasoning and love to work on the forefront of applying results from theoretical computer science. You love to tackle computationally hard problems and have a proven track record of achieving results, where results are people using your tool to do their jobs. You are collaborative: you share ideas, love to brainstorm with peers, and give and receive feedback. You are comfortable with the unknown and understand that #startuplife means that you will be wearing multiple hats.\nResponsibilities\nExtend the scope and depth of our automated program verification tools and brainstorm, design, and implement new tools.\nAdapt and improve algorithms for symbolic software model checking. Examples include bounded model checking (BMC), counterexample-guided abstraction refinement (CEGAR), and property directed reachability (IC3/PDR).\nBuild and extend translators from different input languages into intermediate representations, optimizing the generated models for automated analysis.\nIdentify new classes of security properties of smart contracts and formalize properties for use in our automated verification tools.\nClosely collaborate with other software engineers in developing tools and set technical direction for solving problems in consultation with your team and management.\nWork on all aspects of delivering working software that meets customer needs, including analysis, design, automated testing, operations, CI/CD, measuring results, incorporating customer feedback, and support.\nRequired Qualifications\nMaster's Degree in Computer Science or a related field or 5 years of equivalent experience.\nMinimum of 4 years of software development experience (includes internships, software developed during research, and open-source development).\nMinimum of 2 years of experience with one or more of the following: model checking, formal verification, SAT/SMT solving (Z3, CVC4, Yices, MathSAT, SMTInterpol), abstract interpretation, or closely related disciplines. \nDemonstrated knowledge of fundamental computer science concepts such as data structures, algorithms, mathematical logic, and automata theory.\nPreferred Qualifications\nPhD in the broader field of automated reasoning.\nPublication record in conferences like POPL, CAV, TACAS, FMCAD, FM, etc.\nExperience in functional programming (OCaml or Haskell).\nStrong and creative problem-solving skills; always willing to learn and embrace new technologies and to collaborate.\nPrior experience in a professional software development environment.\nAbout the Company\nFounded in 2018 by professors of Yale University and Columbia University, CertiK is a pioneer in blockchain security, utilizing best-in-class technology to secure and monitor blockchain protocols and smart contracts. CertiK’s mission is to secure the cyber world. Starting with blockchain, CertiK applies cutting-edge innovations from academia into enterprise, enabling mission-critical applications to be built with security and correctness. \n\n\nCompensation\nTarget annual base salary for this role performed in the US is $115,000 - $230,000.\n\n\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","executive","remote"]},{"job":"FullStack Software Engineer all levels Waterdrop","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/full-stack-software-engineer-all-levels-waterdrop-certik/40118","key":"40118","details":"Full-Stack Software Engineer (all levels) - Waterdrop\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nEngineering – Engineering - Fullstack /\nFull-time\n/ Remote\n\nApply for this job\nAbout the Company\nFounded in 2018 by professors of Yale University and Columbia University, CertiK is a pioneer in blockchain security, utilizing best-in-class AI technology to secure and monitor blockchain protocols and smart contracts. CertiK’s mission is to secure the cyber world. Starting with blockchain, CertiK applies cutting-edge innovations from academia into enterprise, enabling mission-critical applications to be built with security and correctness.\n\n\nCertiK is one of the fastest growing and most trusted companies in blockchain security and has become a true market leader. To date, we have collectively worked with over 1800 enterprise clients, helped secure over $310 billion worth of digital assets, and detected over 31,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nCertiK just raised over $140 million and backed by Coatue, Tiger Global, Sequoia, and Hillhouse Capital.\n \nAbout You\nYou’re a self-starter. You believe in tackling the most important problems, even if they are the most difficult problems. You’re comfortable with the unknown and understand that #startuplife means that you’re going to be wearing multiple hats. And that’s what motivates you. You’re accountable and obsessed with improvement, both in yourself and in others. You’re up to the challenge of building a world-class company that aims to be the infrastructure for more secure software for all.\n\n\nAbout the Role\nAs a full-stack engineer, you will work with a team that focuses on delivering and presenting actionable insights extracted from the blockchain platforms. Your outputs will make a huge influence via platforms like the public-facing Security Leaderboard at https://certik.com where users worldwide would benefit from.\nResponsibilities\nDevelop End-to-End customer-facing features from web/mobile portal to back-end service.\nTake ownership of all aspects of the software -- front end, backend, design, architecture, and operations\nBe flexible to work on all aspects of delivering working software, including analysis, design, automated testing, operations, CI/CD, cross-team collaboration, and support\nLearning new technologies to keep your skills current.\nGrow and scale your abilities as the company grows\nRequirements\nProficient in one of the front-end tech stacks like Javascript/HTML/CSS and frameworks like reactjs/vuejs/jquery\nProficient in back-end languages like Python/Ruby/Golang and able to implement web servers & API services\nSolid fundamental computer science knowledge like data structure, algorithms, databases/SQL, testing, CI/CD, GIT, and shell scripts\nExperience with server-side concepts (microservices, caching, performance, monitoring, and scalability) a plus\n Familiar with AWS cloud technologies (e.g. S3, EC2, Lamba, etc)\nFast-paced programming mentality with the ability to turn things around quickly\nStrong and creative problem-solving skills; always willing to embrace new technologies and collaborate\nBonus Points\n(Preferred) Prior experience with blockchain systems.\n(Preferred) Prior experience in a fast-paced, growing start-up environment.\nTarget annual salary for this role performed in the US is $102,000 - $190,000.\n\n\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","full","stack","remote","javascript","ruby"]},{"job":"Platm Engineer Matrix","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/platform-engineer-matrix-certik/40116","key":"40116","details":"Platform Engineer - Matrix\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nEngineering – Engineering /\nFull-time\n/ Remote\n\nApply for this job\nWhy Us?\nCertiK is a pioneer in blockchain security, leveraging best-in-class AI technology to protect and monitor blockchain protocols and smart contracts. Founded in 2018 by professors from Yale University and Columbia University, CertiK’s mission is to secure the web3 world. CertiK applies cutting-edge innovations from academia to enterprise, enabling mission-critical applications to scale with safety and correctness.\nResponsibilities\nSupport the release of new services, data pipelines, and machine learning models through capacity planning, rollout planning, and release management.\nIn collaboration with engineers and data scientists, define and implement monitoring strategies, and define SLAs and error budgets.\nBuild and deploy automation tooling for supported services, data pipelines, and machine learning models.\nTroubleshoot and remediate issues with the services, data pipelines, and machine learning models you manage.\nManage and run critical infrastructure and platform services.\nTrack and execute continuous improvements.\n\n\nRequired Qualifications\nStrong understanding of Linux.\nStrong proclivity for automation and DevOps practices and tools such as Git, Ansible, and Terraform.\nStrong experience working with monitoring and logging tools: Prometheus/DataDog, ELK, Grafana.\nGood programming experience in either: Bash, Python, C++, or Java.\nUnderstanding of general networking protocols such as TCP/IP, DNS, and TLS.\nFamiliarity with container orchestration platforms such as Nomad, ECS, or Kubernetes.\nExperience with database technologies such as Redis, Kafka, Snowflake, MongoDB, PostgresSQL, and MySQL.\nExperience with data engineering tools such as airflow, dbt, etc.\nExperience with machine learning tools (MLFlow/KubeFlow/BentoML) or platforms (SageMaker/Databricks). \nBroad exposure to at least one cloud platform: AWS, Google, Azure\nFamiliarity working with open source software community\nStrong communication and writing skills.\nMinimum of BS degree in CS or related field. Preference is MS or PhD\n\n\nAbout the Company\nOne of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nInvestors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.\n\n\nCompensation\nTarget annual salary for this role performed in the US is $102,000 - $190,000. The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","remote","java"]},{"job":"AWS Cloud Engineer","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/aws-cloud-engineer-certik/40115","key":"40115","details":"AWS Cloud Engineer\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nEngineering – Engineering /\nFull-time\n/ Remote\n\nApply for this job\nWhy us? \nBlockchain technology is enabling a rapidly-growing era of innovation for the digital world. It is crucial that blockchain programs such as smart contracts be secure and correct. Smart contracts cannot be changed after they are deployed and incorrect programs can be hacked. This is where CertiK comes in. We are the leading blockchain security company. Our goal is to secure the cyber world. Come join this ambitious mission as a software engineer to work on cloud services that enable secure and correct blockchain applications! \n\n\nWhat you will do\nWe are building a cloud-based service for program analysis and verification of smart contracts. As a software engineer, you will work with tool developers and product engineers to build a highly-scalable and reliable service.  The service will leverage data collected across code and the compute capacity provided by the cloud.  You will work on the design of microservices exposed by the service in collaboration with tools engineers.  You will choose the architecture and technology platforms. You will also own core fundamentals such as infrastructure orchestration, reliability engineering, devops and monitoring. You will keep up with the latest development in cloud infrastructure, reevaluate architectural choices and coordinate migration if needed. We are growing fast and our infrastructure is expected to expand rapidly. As an early member of the team, you will be able to shape the service design and play a significant role in this journey.\n\n\nAbout you\nYou love technologies and are excited to see the systems you built run and evolve. You get things done fast and enjoy exploring the solution space to keep improving your creations. You value well-designed systems built for the long term and embrace design principles such as AWS's well-architected framework. You are conscientious on making architectural choices and can articulate the rationale behind such choices. When needed, you can dive deep to identify the root cause and set up preventive measures to guard against repeated problems. You take the soundness and reliability of the system to heart and take great pride in building a rock-solid platform.\nYou are a self-starter. You love to solve problems and get results, where results are people using your cloud service to do their jobs. You believe in solving the most important problems, even if they are the most difficult ones. You are collaborative: you share ideas, brainstorm, and give and receive feedback. You are comfortable with the unknown and understand that #startuplife means that you will be wearing multiple hats. \nJob Responsibilities\nYou'll be required to apply your depth of knowledge and expertise to all aspects of the AWS, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals\nYou'll design, implement, test, deploy, and validate the end-to-end security, reliability, and scalability of applications in the cloud\nYou'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally\nYou'll manage cloud service access control and security incident responses\nRequired Qualifications\n3+ years of experience in a large-scale environment on AWS cloud\nIn-depth knowledge of threat modeling experience, secure coding, identity management and authentication, software development, cryptography, system administration, and network security\nExperience with multiple programming languages such as Java, C++, Ruby, Python, Perl, etc.\nAutomation experience with Infrastructure as Code, using CloudFormation and Terraform\nStrong experience in using monitoring tools e.g. Splunk, FluentD, Prometheus, Elasticsearch, Grafana, Datadog, and CloudWatch\nExperience in Agile/Scrum development practices, automated testing, and CI/CD pipelines\nStrong communication and collaboration skills to work across teams and drive integrations in a cloud environment\nBachelor's degree or equivalent experience in a computer science or engineering discipline\nPreferred Qualifications\nStrong experience in orchestrating application deployments in Kubernetes platforms\nPassionate about site reliability engineering (SRE) practices, new technologies and drive for continuous improvement\nExperience in startups, blockchains, smart contracts, DeFi, etc\nStrong contributor to open source community \nAbout the Company\nOne of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nInvestors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.\n\n\nCompensation\nTarget annual salary for this role performed in the US is $102,000 - $200,000. The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["cloud","dev","remote","ruby","java"]},{"job":"Sales Operations","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/sales-operations-certik/40114","key":"40114","details":"Sales Operations\nSouth Korea / Remote /\nBusiness Development – Business Development (International Team) /\nFull-time\n/ Remote\n\nApply for this job\nAbout The Company\nOne of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nInvestors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.\n\n\nAbout You\nYou’re a self-starter. You believe in tackling the most important problems, even if they are the most difficult problems. You’re comfortable with the unknown and understand that startup life means that you’re going to be wearing multiple hats. And that’s what motivates you. You’re accountable and obsessed with improvement, both in yourself and in others. You’re up to the challenge of building a world-class company that aims to be the infrastructure for more secure software for all.\nResponsibilities\nDevelop and execute content strategy for company brand, project promotion, media delivery, advertising and other related contents.\nStay up-to-date with the latest industry trends to plan the content of special columns.\nConduct research for data collection on industry and monitor competitors to adjust content strategy and tactics in a timely manner.\nManage content creation and community operation across all Korean social media.\nRequirements\n1+ years experience in content editing in the media industry.\nNative in Korean, and fluent in Chinese/English to read and communicate.\nStrong copy writing skills and a command of the Korean language.\nStrategic, independent thinking and operational drive.\nThe initiative to seek out new ways of finding opportunities i.e. discord, telegram\nAbility to easily understand and pitch new products and technology, focusing on value proposition\nNaturally curious and an eagerness to learn\nTake ownership of executing strategic and value-added relationships and partnership aligned with our product roadmap\nAbility to quickly adapt to change in a fast-paced environment\nUnafraid to fail and quickly owns up to it\nBonus Points\nFinancial, blockchain, cybersecurity or crypto industry experience.\nPassionate about Cryptocurrency/Defi/Blockchain is a plus\nCompensation & Benefits:\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\n\n\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["operations","sales","non-tech","remote"]},{"job":"Security Engineer Penetration Testing","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/security-engineer-penetration-testing-certik/40113","key":"40113","details":"Security Engineer (Penetration Testing)\nUS / Remote /\nBlockchain Security Engineering – Blockchain Security Engineering /\nFull-time\n/ Remote\n\nApply for this job\nWhy Us?\nCertiK is a pioneer in blockchain security, leveraging best-in-class AI technology to protect and monitor blockchain protocols and smart contracts. Founded in 2018 by professors from Yale University and Columbia University, CertiK’s mission is to secure the web3 world. CertiK applies cutting-edge innovations from academia to enterprise, enabling mission-critical applications to scale with safety and correctness.\n\n\nAbout the Role\nThe primary responsibility of this role is for CertiK’s security-related services. Intersecting cybersecurity and blockchain, CertiK’s security offerings include security consulting, security reviews, security auditing of smart contracts and blockchains, verification of smart contracts, penetration testing, and more. We are looking to hire someone with a passion for application security and penetration testing. This is a fun and challenging full-time position. If you are excited about hacking, threat modeling, scanning, auditing, designing, and enhancing the security of applications across the board then you will thrive in this role. While you work with clients, we will also provide you with plenty of opportunities to get involved with research and development efforts to help us raise the standards of blockchain security.\nResponsibilities\nPerform security assessment on web, mobile, thick client application, and browser extension.\nPerform external, internal network penetration tests\nWork directly with the external blockchain developers to audit their code and secure their products including smart contracts, and dapp.\nDevelop comprehensive pentest reports for technical and non-technical audiences\nResearch and develop innovative techniques, tools, and methodologies for pentesting applications in the Blockchain space\nContribute to the community through the development of tools, presentations, and blog posts\nRequirements\nPassionate about Cryptocurrency/DeFi/Blockchain\nFamiliar with the solidity programming language and smart contract \nMinimum of 3 years experience with application security and penetration testing\nMinimum of BS degree in CS/Security Information or related field. Preference is MS or PhD\nExperience in programming with scripting languages such as Python, Perl, Ruby and Bash\nSolid understanding of cryptography\nStrong spoken and written communication skills\nBonus Points\nOSCP, OSWE, OSCE, GWAPT or comparable certification\nFamiliar with cloud platforms such as AWS, Azure and GCP\nExperienced with smart contract security audit\nParticipated in the bug bounty programs\nPublished security related blog post\nSpoke at security conferences and/or local meetups\nAbout the Company\nOne of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nInvestors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.\n\n\nCompensation\nTarget annual salary for this role performed in the US is $100,000 - $140,000. The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","quality","assurance","remote","solidity"]},{"job":"Security Engineer Waterdrop","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/security-engineer-waterdrop-certik/40112","key":"40112","details":"Security Engineer - Waterdrop\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nBlockchain Security Engineering – Blockchain Security Engineering /\n\nApply for this job\nWhy Us?\nCertiK is a pioneer in blockchain security, leveraging best-in-class AI technology to protect and monitor blockchain protocols and smart contracts. Founded in 2018 by professors from Yale University and Columbia University, CertiK’s mission is to secure the web3 world. CertiK applies cutting-edge innovations from academia to enterprise, enabling mission-critical applications to scale with safety and correctness.\n\n\nAbout You\nYou’re a self-starter. You believe in tackling the most important problems, even if they are the most difficult problems. You are comfortable with the unknown and understand that startup life means that you’re going to be wearing multiple hats. And that’s what motivates you. You’re accountable and obsessed with improvement, both in yourself and in others. You’re up to the challenge of building a world-class company that aims to be the infrastructure for more secure software for all.\n\n\nAbout the Role\nThe primary responsibility of this role is for CertiK’s security-related services. Intersecting cybersecurity and blockchain, CertiK’s security offerings include security consulting, security reviews, security auditing of smart contracts and blockchains, verification of smart contracts, penetration testing, and more. We are looking to hire someone with a passion for Solidity, a deep understanding of the Ethereum Virtual Machine (EVM), distributed computing, and security. Candidates should have an eye for detail and have a passion for combining their skills with a flair for creativity and insight to hack smart contracts. This is a fun and challenging full-time position. If you are excited about hacking, threat modeling, scanning, auditing, designing, and enhancing the security of smart contracts across the board then you will thrive in this role. While you work with clients, we will also provide you with plenty of opportunities to get involved with research and development efforts to help us raise the standards of blockchain security.\nRequirements\nPassionate about Cryptocurrency/Defi/Blockchain\n2+ years of experience in solidity, the EVM and blockchain technology\nMinimum of BS degree in CS/Security Information or related field. Preference is MS or PhD\nSolid experience in threat analysis, APT or response\nExperienced in threat and vulnerability management, penetration testing and SecOps (intrusion detection, security logging, malware analysis, and forensics)\nExperience developing tooling in Solidity, Vyper, Javascript and Python\nStrong Math background is a plus\nProfessional experience as SWE, or Security Engineer is a plus\nAbout the Company\nOne of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.\n\n\nInvestors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.\n\n\nCompensation\nTarget annual salary for this role performed in the US is $102,000 - $180,000. The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","remote","solidity","ethereum"]},{"job":"Principal Blockchain Security Engineer Rust Golang","company":"CertiK","location":"Remote","post_date":"1d","link":"https://web3.career/principal-blockchain-security-engineer-rust-golang-certik/40111","key":"40111","details":"Principal Blockchain Security Engineer, Rust/Golang\nNew York, NY / Seattle, WA / San Francisco Bay Area, CA / Remote /\nBlockchain Security Engineering – Blockchain Security Engineering /\nFull-time\n\nApply for this job\nWhy Us?\nCertiK is a pioneer in blockchain security, leveraging best-in-class AI technology to protect and monitor blockchain protocols and smart contracts. Founded in 2018 by professors from Yale University and Columbia University, CertiK’s mission is to secure the web3 world. CertiK applies cutting-edge innovations from academia to enterprise, enabling mission-critical applications to scale with safety and correctness.\n\n\nAbout the Role\nThe primary responsibility of this role is for CertiK’s security-related services. Intersecting cybersecurity and blockchain, CertiK’s security offerings include security consulting, security reviews, security auditing of smart contracts and blockchains, verification of smart contracts, penetration testing, and more. We are looking to hire someone with a passion for Rust, and a deep understanding of the blockchain protocol, distributed computing, and security. Candidates should have an eye for detail and have a passion for combining their skills with a flair for creativity and insight to hack smart contracts. This is a fun and challenging full-time position. If you are excited about hacking, threat modeling, scanning, auditing, designing, and enhancing the security of smart contracts across the board then you will thrive in this role. While you work with clients, we will also provide you with plenty of opportunities to get involved with research and development efforts to help us raise the standards of blockchain security.\n\n\nResponsibilities\nOwn threat modeling and security assessments of new assets/tokens, blockchains, DeFi protocols, and smart contracts\nLead code reviews of systems that interact with the blockchain, smart contract\nRecommend code changes to eliminate vulnerabilities\nImprove our processes and offering and strive for the satisfaction of our clients\nProficiency in system-level programming in Golang/Rust/C++.\nRequirements\n3 or more years of software development experience using any systems programming language (e.g. C, Rust, Golang and/or wasm)\nMinimum of BS degree in CS or related field. Preference is MS or PhD\nExperience developing software in or an interest in learning the Rust programming language.\nExperience with reverse engineering of source code analysis\nExperience researching or developing or debugging exploits\nStrong interest in Web3/Blockchain/DeFi\nThe exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.\n\n\n#blockchain\n#startups\n#hiring\n\n\nCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays.\n\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n\n\nCertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.\n\n\nCertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.\nhttps://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\n\n\nAll CertiK employees are expected to actively support diversity on their teams, and in the Company.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","golang","executive","rust","security"]},{"job":"Growth Marketing Lead Creative Insights Strategy","company":"Cash App","location":"San Francisco","post_date":"1d","link":"https://web3.career/growth-marketing-lead-creative-insights-strategy-cashapp/40109","key":"40109","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app, bringing a better way to send, spend, invest, borrow and save to our millions of monthly active users. With a mission to redefine the world's relationship with money by making it more relatable, instantly available and universally accessible, at Cash App you'll have the opportunity to make a real-world impact with your career.\n\nToday, Cash App has thousands of employees around the world with a culture geared toward creativity, collaboration and impact. We’ve been a distributed team since day one, and continue to value working across time zones and continents both remotely and in our Cash App offices.\n\nOur offices are great, but many of our roles can be done remotely from the countries where Block operates. We tailor our experience to champion our employees’ creativity and productivity wherever they are.\n\nCheck out our locations, benefits and more at cash.app/careers.\n\nJob Description\n\nAs part of our Growth Marketing Team’s rapid expansion, we’re looking for an outstanding Growth Marketing Lead to own our creative insights and iteration process to drive best in class creative production for our paid acquisition channels. You will work with the Head of Growth Marketing and channel leads to drive performance via creative at scale across 10 channels and a sizable acquisition budget.\n\nYou Will\n\n\nOwn our acquisition creative roadmap and process. Partnering with Production and Creative, you’ll synthesize channel needs, industry trends, and creative insights to drive continuous production of innovative performance assets.\nCreate playbooks for best practices via insights from top performers and industry trends. You will collaborate with Product Marketing and Customer Insights to test and validate new products, value propositions, and messaging.\nPartner with our Strategy and Insights team to build data pipelines that deliver creative insights. This will inform channel optimizations and thoughtful creative testing.\nBuild our creative testing process to measure relative performance of new assets, and the feedback loops with cross functional partners to improve future creative.\nCreate collaborative feedback loops to consolidate needs from channel managers, in house creative, and external agencies.\n\nYou Have\n\nQualifications\n\n5+ years of work experience with growth marketing and/or creative insights at a high-growth tech company.\nExperience working with creative teams, a talent for communicating data and insights to creatives, and a passion for ads and creative.\nExperience working within a growth marketing team, and an ability to impact performance metrics with creative insights and development.\nYou are driven by metrics, even when faced with a challenge that isn’t perfectly measurable. You seek to balance strategy and data to drive insights and results.\nFamiliarity with mobile advertising and marketing channels (i.e. paid ads, SEO, ASO, in-product, push, email) and concepts (attribution, LTV, CAC, return on investment, payback periods).\nExperience with SQL or Tableau preferred, or willingness to learn.\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $152,100 - USD $185,900\n\nZone B: USD $141,500 - USD $172,900\n\nZone C: USD $133,800 - USD $163,600\n\nZone D: USD $121,700 - USD $148,700\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","lead"]},{"job":"Head of Talent Cash App","company":"Cash App","location":"San Francisco","post_date":"1d","link":"https://web3.career/head-of-talent-cash-app-cashapp/40108","key":"40108","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nTalent Acquisition is a strategic function that enables Cash App’s growth, shapes the company culture, and identifies the talent we need to be successful.\n\nAs the Head of Talent for our Cash App business unit, you will be responsible for setting the vision and strategy for the global recruiting team. You will partner closely with senior executives to design and execute recruiting strategies and programs that support the entire global business as it scales. You will also work closely with leaders throughout the People organization, influencing key partners and driving new and ongoing initiatives from ideation to completion.\n\nYou Will\n\n\nDevelop and lead a global talent acquisition organization that includes recruiting, sourcing, operations and talent enablement\nBuild a progressive talent strategy and roadmap, partnering closely across the Cash App executive staff and cross-functional partners\nDesign the operational infrastructure needed for efficient and effective talent programs and systems at scale\nPartner with Cash App Executives, HR and Finance to effectively plan and monitor headcount, attrition and hiring goals\nCreate a thoughtful, clear metrics-driven approach that tracks, monitors, and evaluates the impact and effectiveness of all programs and hiring activity\nEnsure that our talent acquisition strategy, resourcing models and approaches are poised to pivot and rapidly scale\nDrive overall success of team including managing prioritization, delegation, and overall accountability of team\nThink creatively and bring an innovation framework to talent acquisition\n\nYou Have\n\nQualifications\n\nExperience leading and empowering large scale talent organizations (100+) with an emphasis on building high performing teams and inclusive cultures\nA passion for people development and a track record of coaching and motivating high performing teams\nDemonstrated success partnering with senior leaders across multiple disciplines to meet aggressive hiring goals\nA perspective on and deep belief of the importance of diversity, equity and inclusion across all facets of the hiring and recruitment process\nExperience building a global recruiting infrastructure, including processes and tools\nExperience with leading and implementation of large transformational initiatives\nA value of metrics and storytelling and can marry the two to create compelling narratives\nA data-driven approach to decision-making that leads to increased operational efficiency and effectiveness\nA growth mindset and proven ability to think of creative solutions\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $269,600 - USD $329,500\n\nZone B: USD $269,600 - USD $329,500\n\nZone C: USD $269,600 - USD $329,500\n\nZone D: USD $269,600 - USD $329,500\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","recruiter","non-tech"]},{"job":"Gaming Director","company":"The Drone Racing League","location":"New York","post_date":"1d","link":"https://web3.career/gaming-director-thedroneracingleague/40107","key":"40107","details":"The Drone Racing League (DRL) is the global, professional drone racing property. Merging the digital with the real, DRL combines innovative technology, custom content and thrilling live sporting and esports events that broadcast and live stream on premier international sports networks including NBC and Twitter, TikTok, YouTube, Twitch, Facebook and Instagram.\n\n\n\n\nWe are seeking a gaming leader to grow DRL’s global fanbase and build connections with all levels of gamers and the league. The Gaming Director will constantly seek out new ways to improve the current fan experience for DRL’s gaming portfolio and optimize the games we offer. This candidate will have experience applying insights to drive decision making and inform the product roadmap. The Gaming Director will partner with business development to bring forward fresh ideas for partners that will delight fans and achieve our partners business objectives.\n\n\n\n\nWhat you’ll do:\n\nGrow and Enhance DRL’s Gaming Portfolio\n\nOptimize current and create new marketing programs and strategies to grow the total number of players measured by DAU/MAU for DRL’s current and future games and gaming experiences:\nDRL SIM on Steam, Epic Games, PlayStation, and Xbox\nDrone Racing Arcade on ios and android in partnership with Skillz\nDRL’s Fly to Own blockchain game built on Algorand in partnership with Playground Labs\nDRL’s Metaverse Strategy\nEnhance the pl ayer experiences with our games working with the product/dev teams for each title by bringing forward the “voice of the player” and analytics to inform the product roadmap, measured by improvement of retention metrics per title.\nManage budgets related to demand generation and seasonal marketing programs.\nPartner internally with key stakeholders in PR, production, operations and creative services to achieve growth objectives.\nOversee a dedicated community moderator\n\nPartnership Ideation and Support\n\nDeliver innovative marketing programs to the business development team that will both resonate with fans and achieve revenue goals.\n\nInsights\n\nPrepare reports for internal and external stakeholders that share progress on the growth and retention of our player ecosystem\nIdentify opportunities and share POVs on relevant new entrants into the gaming verticals (SIMs, casual mobile games, blockchain games, etc)\n\nWho You Are:\n\nGaming expert with 8+ years experience preferably in game marketing\nYou have demonstrated success growing gaming communities and understand what is required to keep players engaged in titles.\nDeep experience and interest playing PC and/or console games\nExperience with Web3 technology and blockchain gaming\nExperience with metaverse platforms\nExperience engaging communities and bringing the voice of fans/customers into every conversation\nYou build strong relationships internally and externally, and value teamwork\nYou thrive in a fast-paced, agile environment with exceptional organizational skills and the ability to re-prioritize on a consistent basis\nYou are a self-starter and resourceful\n\n\n\nWhy You’ll Love DRL:\n\nWe team up. We can promise you’ll work with some of the smartest and most interesting people in the industry. We work hard and we play hard too. We care deeply about our work and each other.\nEverybody sweeps. No task is ever too small for our team. We sweat the details and are not afraid to get our hands dirty.\nWe embrace debate. There are no seats at the table at DRL because there is no table. Everyone is encouraged to share their thoughts and ideas. We embrace the idea that debate is healthy and knowing that an impassioned discourse leads to our best results.\nWe stay hungry. We look for the hardest challenges and tasks and once we master them, we look for the next one. We celebrate our victories and are always excited for tomorrow knowing “good enough” is never really “good enough.”\n\n\n\n\nThe salary range for this role is $150,000-$175,000. Actual total compensation packages offered to candidates within that range are based on a wide array of factors unique to each candidate, including skill set, years and depth of experience, certifications, and the candidate's specific location.\n\n\n\n\nDrone Racing League is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come fly with us!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","game","dev"]},{"job":"Chief of Staff Wonderful group of companies","company":"RampRate - Impact-Focused Organizations, Blockchain Solutions &amp; Decentralized Governance","location":"Santa Monica","post_date":"1d","link":"https://web3.career/chief-of-staff-wonderful-group-of-companies-ramprate-impact-focusedorganizations-blockchainsolutions-amp-decentralizedgovernance/40106","key":"40106","details":"NOT BEING RUDE, YET IMPORTANT TO STREAMLINE THIS PROCESS AND NOT WASTE YOUR TIME: WE RESPECTFULLY REQUEST YOU PLEASE DO NOT APPLY IF YOU DON'T HAVE STARTUP EXPERIENCE, IF YOU ARE ONLY INTERESTED IN BASE PAY AND NOT INCENTIVES, STOCK AND TOKENS. PLEASE DO NOT APPLY IF YOU HAVE NOT REVIEWED OUR PORTFOLIO AND HAVE AN UNDERSTANDING OF WHAT WE DO. DO NOT APPLY IF YOU HAVE NOT READ THIS AD ENTIRELY AND FEEL YOU ARE A REALLY CLOSE FIT TO THIS GLORIOUS HARD WORKING RESPONSIBILITY. PLEASE INCLUDE YOUR CURRENT/RECENT AND TARGET COMPENSATION IN YOUR COVER LETTER AND INQUIRY.\n\nCANDIDATES WITH THIS INFO WILL BE RESPONDED TO, IF NOT, YOUR RESUME WILL BE DELETED.\n\nTitle: Chief of Staff\n\nType: Full Time\n\nLocation: Remote\n\n\nBefore applying…\n\nPlease watch this video about the role AND have an understanding of CEO Tony Greenberg’s background and current work. Also, please be prepared to discuss your recent and target compensation. www.youtube.com/watch?v=EMlyVjgXyH4 (In case link does not work)\n\nAbout RampRate / Syzygy Impact\n\n(Impact Initiatives & Tech)\n\nWe create alignment of purpose, people & profit in tomorrow’s leaders - both the names you know and the ones just getting started.\n\nProfit: We nurture and connect companies that will lead the most interesting markets in the world: the metaverse, Decentralized Autonomous Organizations, Web3, health tech, and psychedelics.\n\nPeople: We look out for real people in the real world. We reward our employees, connect our partners, and make friends. We’ve spent 20+ years building trust and aligning incentives to make sure everyone in every deal feels whole.\n\nPurpose: We care about the environment, human rights, and equity. We measure carbon, protect natural resources, nurture startups that are founded on the right ideals, and nudge big companies toward cleaning up their acts.\n\nWe want you to become a connector in our ecosystem - working with interesting companies to find the right relationship between them and us and them and the rest of our ecosystem - and then solidify that relationship with the necessary agreements.\n\nAlignment\n\nWe have two divisions: RampRate and Syzygy Impact, as well as a 50% share in Menagerie.\n\nRampRate is nuts and bolts - a global business planning & tech sourcing advisory that identifies inefficiencies and extracts value from fixing them. We’ve helped powerful brands like Microsoft, eBay, and Intel drive strategy, create impact, and optimize their tech contracts since 2000.\n\nSyzygy Impact is altruistic. A startup consultancy, investment fund, and foundation funded in equal parts by cash & equity, it aligns teams, strategies, and ecosystems in aspiring unicorns. It scales bold ideas into market-leading companies. We're working with firms like Syntropy, Vatom, Redivider Blockchain and Social Stack, and helping them partner with the likes of XPRIZE, Verizon, AT&T, Microsoft, and 100+ others from the RampRate side.\n\nMenagerie is a startup we’ve co-launched with one of the foremost authorities on decentralized autonomous organizations dedicated to building true grassroots communities for everyone from large content brands to blockchain projects to fitness programs to non-profits.\n\nWe prioritize relationships, responsibility, ingenuity, reciprocity, and integrity. Read our values at ramprate.com/values/. Visit our websites at ramprate.com and www.syzygyimpact.com. Our investment portfolio is ramprate.com/tonyg.\n\nDescription Of Role\n\nRampRate/Syzygy Impact Chief of Staff is the right-hand person and force-multiplier to the CEO and Head of Operations. This role encompasses organizing and managing the CEO’s daily priorities while overseeing staff and internal operations, including accounting and human resources teams. This person will also initiate and maintain special projects.\n\nThe Chief of staff will be required to enable effective communication between the RampRate team and project stakeholders, including equity partnerships, investors, developers, enterprises, and the tech policy community in order to create and sustain value, visibility and transparency. The integration and dissemination of information pertaining to a range of areas including strategy, finance, operations, development, and more is expected.\n\nInternally, the Chief of Staff will support the leadership team in setting strategic objectives and developing implementation plans, and will work closely with the leadership team and various functional teams to coordinate efforts in order to achieve these goals.\n\nWork Environment\n\nThis position is fully remote, but the ability to travel is required. This position is a needed and valued component of a super interesting 15 person company which aims to create impact and “Elevate the Way Business Does Business.\"\n\nCore Responsibilities\n\nSupport the CEO in identifying time-sensitive priorities, strategically aligning his/her schedule accordingly, and regularly monitoring their progress.\nAct as a thought partner, brainstorming & identifying solutions to challenges, and developing frameworks to help guide decision-making.\nManage a variety of long-term, cross-organizational projects.\nSupport the internal events calendar including, but not limited to, all-hands meetings, company events, and investor events.\nApply innovative approaches in managing organizational challenges in a manner that reflects the culture and values of the projects.\nSpearhead special projects as directed by the CEO and the Board.\n\nDaily Activities\n\nOversee meeting preparation and planning for the Board of Directors, and support the CEO in managing interactions with the board and investors.\nProvide communications support, including drafting emails, reports, memos, presentations, internal and external communications, and social media posts.\nPrepare agendas, take notes, and assign action items at strategy meetings and help the CEO to propel and monitor progress on these.\nCreate/enhance/maintain “About Syzygy/RampRate” presentations and materials that are compelling and accurately reflect the project’s vision, mission, and strategic roadmap.\n\nExperience\n\nRequirements\n\n5+ years of experience working in a full-time role, preferably in wide-ranging or cross-functional areas, and an eagerness to learn new skills.\nHave supported a successful executive or have been one yourself.\nAt least one year of experience working with cryptocurrency and blockchain. Experience internet routing protocols would be an advantage, but is not required. However, interest in this area is a must.\n\nSkills\n\nAn uncompromising ability to maintain strict confidentiality, exercise sound judgment and the highest level of discretion in handling sensitive material.\nAbility to manage multiple projects and deadlines effectively.\nStrong written and verbal communication; excellent listening skills and the ability to learn to communicate in someone else’s “written voice” to help prepare comments, presentations, and memos.\n\nApply if you are…\n\nPassionate about making an impact\nCommitted to lifelong learning\nConfident about contributing to work with intention and joy\nDedicated to the principles of trust, transparency, and openness\nA systems and process-thinker; you love creating order out of chaos\n\nWhat You’ll Gain\n\nUnique perspective across projects and associated entities: you’ll have a view across some of the most innovative technologies and projects on the cutting edge. You’ll participate in them at the exec level and support the vision and strategy-setting for clients.\n\nWork with an exceptional team who have incredible experience, insight, and a visionary perspective on the future of technology, social impact, health care and more.\n\nCredibility and opportunity: We are collaborating with some of the largest companies in the world. Their trust and backing is underpinning the success of the startups we nurture. You get to be the matchmaker at many marriages between innovation and scale.\n\nFlexibility and growth potential: We build roles around the talents of our people - and seek for each person to be operating in their zone of genius. There is an open path to executive team partnership - we’re perfectly happy if you spend 12 to 24 months in this role, hire your replacement, and then take on a larger leadership role within our organization or one of our portfolio companies.\n\nTarget Compensation\n\nCompensation model of base plus a quarterly bonus composed of company and individual performance metrics. Pay range is open, commensurate with experience and qualifications as well as participation in employee stock plan. Target base $80-150k, may include equity and tokens for total compensation package up to $225k+ annually. Flexible schedule, and potential for growth into full COO and potential partner in the company.\n\nBenefits\n\nPLEASE SUPPLY CURRENT AND TARGET COMPENSATION IN RESPONSE\n\nBenefits package includes health insurance, eye/dental, disability, access to a 401K program, and a way to balance work and life.\n\nEqual Opportunity Employment\n\nRampRate is an equal opportunity employer and will not discriminate against any applicant or employee based on actual or perceived race, color, national origin, alienage, citizenship, sex, pregnancy, sexual orientation, gender identity, transgender status, marital, familial, caregiver or partnership status, religion, age, disability, genetic information, status as a veteran or active military personnel in the uniformed services, arrest or conviction record, credit history, unemployment status, status as a victim of domestic violence, stalking or a sex offense, or any other classification protected by federal, state or local law.\n\nAbout Ramprate\n\nRampRate is a global advisory firm serving impact-focused organizations.\n\nFounded in 2000, we have been private, self-funded and profitable since birth.\n\nWe cut our teeth by radically changing how IT services are bought and sold for the likes of Microsoft, eBay, Nike Merrill Lynch and CBS.\n\nToday, our scope has widened. Now, we solve a wide range of problems for high-tech companies.\n\nWe Are Experts In\n\nBlockchain solutions.\nWeb3, Metaverse, DAOs, and decentralized governance.\nTech infrastructure\nDigital media and entertainment\nWellness and health\n\nWe Solve Problems By\n\nConnecting companies with advisors and partners.\nLocating funding.\nFinding and making deals.\n\nOver the last couple of years, we’ve realized it’s time to dedicate ourselves not to just doing well, but to doing something great, and the current crisis has made this mission more urgent than ever. Our company has social impact and shared values as our number one priority. Our social impact initiative, Syzygy, helps enterprises align their operations and supply chains with the impact priorities of all stakeholders.\n\nOur team works remotely around the world.\n\nCREATING ALIGNMENT OF VISION\n\nWhether it’s between profit and purpose, cost and value of tech investments, service quality and RFP win rate, or strategy and execution. RampRate combines rational, data-driven frameworks with guaranteed commitments to real-world outcomes to help both existing market leaders and emerging players make the best decisions and reach their potential for changing the world.\n\nBIG INITIATIVES FOR BIG BUSINESS\n\nFor Large Enterprises, Including Microsoft, ViacomCBS, Nike, EBay, And More Than 100 Others, RampRate Has Enjoyed a 20 Year Track Record Of\n\nReducing cost, risk, time, and the carbon footprint of IT supply chains;\n\nBuilding trajectory-altering strategic plans, and\n\nReplacing greenwashing with authentic social impact.\n\nSUPERCHARGING STARTUPS\n\nFor emerging leaders in tech, media, blockchain, and health, RampRate’s Advance practice helps innovative & impact-focused CEOs kick down the obstacles to their world-changing trajectory.\n\nWe help streamline operations, provide technical roadmaps, and go-to-market plans.\n\nWe facilitate transformational relationships with Fortune 1000 partners, influential advisors, and foundational clients.\n\nRampRate’s commitment to impact is woven throughout our organization, from the clients we take on, to the strategies we build for them. From our foundation, which funds self-sustaining impact initiatives and superstars in tech and healthcare, through to our tightly integrated ecosystem of clients and partners.\n\nOur goal is a new type of wealth - measured in millions of lives changed for the better rather than just millions of dollars earned.\n\nPowered by JazzHR\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","recruiter","non-tech"]},{"job":"Research Lead Financial Services","company":"Cash App","location":"San Francisco","post_date":"1d","link":"https://web3.career/research-lead-financial-services-cashapp/40105","key":"40105","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nAt Cash App, UX Researchers work closely with cross-functional partners to build world-class, end-to-end features that solve many of the world’s most important and interesting financial problems for millions of customers. We employ a variety of qualitative and quantitative methods to accomplish our goals, including surveys, focus groups, field studies, usability tests, and 1:1 interviews. The UX Research team is at the frontier of shaping new and innovative solutions across categories like personal finance, commerce, crypto, community and culture.\n\nWe are seeking an experienced leader to oversee and scale our UX Research team and help Cash App redefine the world’s relationship with money. The UX Research Lead will play a critical role within a growing Customer Insights organization to deepen customer empathy, shape and influence roadmaps and scale and invest in the growth of our team.\n\nThis role reports to the Head of Customer Insights.\n\nQualifications\n\n\nExperience working in highly collaborative multidisciplinary teams across time zones\n12+ years of experience in a professional environment\nHas led teams made up of researchers covering a breadth methodologies (qualitative, quantitative, usability, secondary research, etc.) including leads\nExperience directly conducting primary research (either qualitative or quantitative) end-to-end (i.e., designing, fielding, analyzing and reporting out data)\nExperience building teams over time through hiring, growing, and retaining high-performing researchers\nExperience building and setting research strategy that connects with business strategy\nExperience working with a variety of cross functional peers and stakeholders (e.g., product managers, data scientists, designers, engineers, policy, communications, marketing)\nTrack record of translating research into business impact\n\nAdditional Information\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["research","finance","lead"]},{"job":"Software Engineer Crypto Security","company":"Reddit, Inc.","location":"San Francisco","post_date":"1d","link":"https://web3.career/software-engineer-crypto-security-reddit-inc/40104","key":"40104","details":"Our mission is to bring community and belonging to everyone in the world. Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. With more than 50 million people visiting 100,000+ communities daily, it is home to the most open and authentic conversations on the internet. From pets to parenting, skincare to stocks, there’s a community for everybody on Reddit. For more information, visit redditinc.com.\nPlease note: Reddit is continuing to grow our teams with the best talent. This role is completely remote and hybrid friendly.\nThe RedditX team is among the most innovative, forward-looking teams at Reddit. We are a fast-moving and entrepreneurial organization within Reddit, dedicated to building new monetizable experiences that users and communities love. With our track record of rapid execution and experimentation, we have been doubling revenue steadily year-over-year. Today, the X org is responsible for established products like Avatar, Premium, Awards, Talk, Powerups, and more.\nWe are looking for someone with 2+ years working experience in a security role on Ethereum projects as well as some experience developing scalable backends (e.g. Python/Go/Java) that integrate with them.\nQualifications\n\n\nFluency in Solidity.\nExperience with Solidity & Ethereum security and smart contract auditing.\nExperience with smart contract development tools, patterns, and practices.\n5+ years of experience building clean, maintainable, and well-tested code.\nGreat engineering skills and strong CS fundamentals.\nExcellent collaborative and communication skills.\nAble to work effectively under schedule pressure to fix defects, review code, design, write, test new code, and diagnose production issues.\n\nBenefits\n\nRemote and Hybrid friendly\nAnnual Personal & Professional development funds\nComprehensive Health benefits\nWorkspace benefits for your home office\n401k Matching\nFamily Planning Support\nFlexible Vacation (please use them!) & Monthly Global Wellness Days\n4+ months paid Parental Leave\nPaid Volunteer time off\n\nReddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at ApplicationAssistance@Reddit.com.\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","security","crypto","solidity","ethereum"]},{"job":"Web3 Ui Smart contract developer","company":"Money Team Antwerp","location":"Antwerp","post_date":"2d","link":"https://web3.career/web3-ui-smart-contract-developer-money-team-antwerp/40103","key":"40103","details":"Big Job for Web3 Play to earn game!\n\nOnly people from Antwerp!!!!\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","design","non-tech","smart","contract","web3js"]},{"job":"Head of Marketing","company":"Dialect","location":"Remote","post_date":"2d","link":"https://web3.career/head-of-marketing-dialect/40101","key":"40101","details":"About Dialect\n\nAt Dialect we're on a mission to build more delightful, open messaging on the internet. We believe that web3 can deliver on this promise, and give users exciting new ways to communicate with each other.\n\nWe build open-source developer tooling and are obsessed with shipping pixel-perfect user experiences. We are powering messaging and notifications for many of the most-loved dapps on the Solana blockchain and adding support for Aptos and other chains rapidly. If you’re excited about the possibilities that wallet authentication opens up and are able to juggle multiple projects and competing deadlines, we'd love to hear from you.\n\nAbout the team\n\nWe're a team of cloud and hard-tech veterans, hailing from the web2 messaging giants Sendgrid & Twilio, global internet-scale brands like Siemens, and moonshots like Arrival and Rigetti Quantum Computing.\n\nWe blend this mix of domain expertise, scale, and first-principles hard-tech into our work every day. This range of perspectives is our competitive edge, and we are constantly in search of more. Tell us what yours is and apply.\n\nAbout the role\n\nWe're looking for a highly creative individual who takes initiative, is confident in their public voice, is constantly searching for new ways to engage our community in what we’re doing, and loves working alongside teammates from all kinds of different backgrounds. Passion for web3 and how it will change the internet is a must. Extensive experience in web2 marketing not required.\n\nIn this role you will:\n\nBe our first Marketing hire. You will have the opportunity to shape marketing at Dialect from the ground up, and eventually build a team.\nLead all marketing efforts for Dialect, across Twitter, blogs and other written content, and help steer our brand and community content strategy across community media like Discord.\nWork with the Dialect team and the broader Dialect community to turn our mission, values & track record into a defining brand and voice.\nProduce creative, opportunistic, high quality content on a weekly basis, engaging with the team, our dev partners, and our community.\nBuild a long-term narrative for Dialect based on our mission and roadmap, both to help create a brand off of that vision.\nWork internally with the Dialect team to get into the details of what we’re building and why we’re building it. We ship fast. What are we shipping? How can we produce engaging, creative content off of our product releases?\nCoordinate efforts with our designers and animators to produce high quality marketing content.\nBe constantly pushing us forward and challenging the status quo on how we communicate.\nExpand our brand beyond core web3, and help create a distinct, authentic voice and brand for Dialect.\n\nYou might be a great fit for this role if:\n\nYou have 4+ years of experience in brand and content marketing.\nYou have excellent written and verbal communication skills.\nYou know how to tell stories and build narrative.\nYou have experience with content marketing tools.\nYou know how to drive attention and build audiences.\nYou’re scrappy. You know how to use a budget but you don’t think in terms of them.\n\nBonus points if:\n\nYou have extensive experience managing web3 brands.\nYou are already deep in some web3 communities and know how to speak the language.\nYou are a Twitter pro.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","marketing","non-tech","solana","ycombinator"]},{"job":"Senior Backend Engineer","company":"Dialect","location":"Remote","post_date":"2d","link":"https://web3.career/senior-backend-engineer-dialect/40100","key":"40100","details":"About Dialect\n\nAt Dialect we're on a mission to build more delightful, open messaging on the internet. We believe that web3 can deliver on this promise and give users exciting new ways to communicate with each other.\n\nWe build open-source developer tooling and are obsessed with shipping pixel-perfect user experiences. We are powering messaging and notifications for many of the most-loved dapps on the Solana blockchain. If building in the open and shipping great products on fast timelines is your thing, we'd love to hear from you.\n\n#About the team\n\nWe're a team of cloud and hard-tech veterans, hailing from the web2 messaging giants Sendgrid & Twilio, global internet-scale brands like Siemens, and moonshots like Arrival and Rigetti Quantum Computing.\n\nWe blend this mix of domain expertise, scale, and first-principles hard-tech into our work every day. This range of perspectives is our competitive edge, and we are constantly in search of more. Tell us what yours is and apply.\n\nAbout the role\n\nWe're looking for an experienced individual contributor who enjoys working alongside other experienced engineers and designers to quickly build and iterate on backend/API/platform.\n\nIn this role you will:\nWork with PMs, designers and other engineers on core parts of Dialect cloud backend and SDK to build new features and improve the user experience.\nCreate a robust and scalable backend. Build PostgreSQL database models, performant REST APIs, data streaming ETLs, and 3rd party integrations.\nContribute in infrastructure management, observability improvements to the cloud part of the system and participate in incident management.\nUse modern web tech and influence the stack. The backend is NodeJS/NestJS, PostgreSQL. The frontend is React, and we use TypeScript in many places. As we build out our stack, you get to make critical choices and lay the technical foundation.\nWrite mostly Typescript with an emphasis on good design, tests and performance.\nCollaborate in a respectful team environment that is fully distributed.\nYou might be a great fit for this role if:\nYou are highly productive and produce high quality code. You enjoy pushing out features in a pragmatic and maintainable way. You know when to use duct tape and when to lay good foundation.\nYou are a strong generalist with fundamental computer science knowledge. You use this knowledge to easily adapt to new technologies and scenarios, and to find the right solutions for the problems at hand.\nYou have a strong background in building usable and performant backend systems.\nYou have experience designing efficient data structures, whether it’s in PostgreSQL or other data systems.\nYou have experience writing code in Typescript, and passionate about writing well-designed, testable code.\nBonus points if you:\nHave frontend experience building user interfaces using React.\nHave experience with cloud infrastructure tools, such as AWS, terraform, kubernetes, and related services.\nHave experience with logging & monitoring systems such as Sentry, DataDog, or similar.\nAbove all, you may be a good fit for this role if you are excited about web3 and the future of the internet. No prior web3 experience is required, other than an excitement and willingness to learn.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","senior","react","solana"]},{"job":"Account Executive Sales","company":"Cobo","location":"United States","post_date":"2d","link":"https://web3.career/account-executive-sales-cobo/40099","key":"40099","details":"Cobo is a leading digital asset custodian and blockchain technology provider, based in Singapore. Trusted by over 500 institutions and HNWIs globally to protect and grow their crypto assets, the company focuses on building scalable infrastructure and powering the Web 3.0 revolution around the world. Our product suite comprises of Custody, Wallet-as-a-Service (MPC-TSS/HSM), Argus (smart contract multisig solution for team collaboration), and DeFi-as-a-Service. Cobo is SOC 2 Type I certified, obtained an in-principle approval from VARA in Dubai, and is also licensed in the US, Hong Kong and pending licenses in Singapore.\n\n\n\n\nResponsibilities :\n\n\n\nTo deliver on SaaS sales targets in the regional financial institutions, crypto funds, and blockchain companies. Doing so requires specific regional strategy, active sourcing of top priority opportunities, a healthy pipeline of leads, and ensuring self-discipline on sales methodology, CRM and forecasting\nBecome an expert at presenting how our product suite can bring value\nTo work cross functionally with internal departments, such as product, marketing, legal and compliance to facilitate a smooth sales process\n\n\n\nRequirements :\n\nAt least 2 years or more experience in B2B sales in Blockchain, financial services or fintech SaaS industry\nProven track records in sales / business development / client relationship management\nWell versed in blockchain product and market knowledge, highly passionate about Cryptocurrency and Digital Assets\nProficient verbal and written communication capabilities in English; Additional language proficiency would be a plus.\n\n\n\nLocation: US\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["sales","non-tech","executive"]},{"job":"Permance Engineer Blockchain","company":"Ripple","location":"New York","post_date":"2d","link":"https://web3.career/performance-engineer-blockchain-ripple/40097","key":"40097","details":"Ripple’s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of massive scale spanning $155 trillion in annual cross border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year.\n\nWe are looking for performance engineers to join a growing team that is in charge of performance, scalability and reliability of the XRPL network. You will work closely with developers, scientists, devOps and other members in the performance team to gain deep knowledge on software’s design; use cases and its data flow, model realistic load profiles and conduct comprehensive performance testing and tuning on products and features we deliver as a team to the XRPL community. The ideal candidate should have a strong CS background, be passionate about problem solving, possess strong analytical and logical thinking skills and be very detail oriented.\n\nWHAT YOU’LL DO\n\nWork with teams across the organization in acquiring performance requirements and load forecast metrics\nParticipate in the full software release lifecycle, from software design and development to the deployment of the products\nDesign performance testing load model and the associated test data to realistically simulate the load in the lab environment\nDevelop comprehensive load simulators and all necessary tools required for the setup and testing\nConduct iterative performance testing; bottleneck detecting/removing; code profiling and comprehensive tunings at all levels (OS, network, software and database)\nDevelop performance monitoring dashboard or tools for effective monitoring during testing\nCollect test results; conduct detailed analysis and generate test report\nWork with devOps to ensure the product’s readiness for production environment\nContinuously raise our standard of engineering excellence by proactively looking out for problematic signs that may affect product’s performance and/or reliability\n\nWHAT WE’RE LOOKING FOR\n\nBachelor’s degree or higher in Software Engineering, Computer Science, or equivalent industry experience\nFamiliarity with Linux shells; understanding of OS components; networking; web protocols and database operations\n2-4 year(s) of working experience in software engineering (including internship or research programs)\nProficient with one or two programming languages; strong computer science understandings\nIntellectually curious; hyper focused; problem driven and persistent - you are not easily satisfied with hypothetical explanation but driven in digging out the root cause\nExcellent communication skills in both verbal and written\nYou thrive on autonomy, responsibility and owning your work, end to end\nA positive attitude and a passion for sharing knowledge within your team and organization\nAttention to detail and a commitment to excellence\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain"]},{"job":"Software Engineer Product","company":"TBD","location":"San Francisco","post_date":"2d","link":"https://web3.career/software-engineer-product-tbd/40096","key":"40096","details":"Company Description\n\nTBD is Block's newest, emerging business unit- focused on building a future where every individual can access and participate in the global economy. The TBD team is on a mission to lead by example, inspiring the world to invest in & collaborate on open source standards and permissionless technologies for the public good. Join us as we build a financial system accessible for anyone who wants to participate.\n\nJob Description\n\nTBD’s Product Engineering team is on the mission to build value-added decentralized financial services and applications that can drive monetization for TBD. With the focus of real world problems for retail customers and financial institutions, you will play a key role to further our mission of economic empowerment globally.\n\nAs a Software Engineer, Product you will be a part of the TBD Software Engineering Team and report to the team lead.\n\nYou Will\n\n\nBe one of the founding members of the team\nBuild and launch decentralized cross-border money moving services globally.\nContributing to the specifications and strategies of TBD’s product and monetization initiatives.\nMarket research, prototype, and evaluate various blockchain based solutions available on the market.\nDesign and lead development process to ensure quality, including code reviews as well as testing and verification.\nBe involved in the current blockchain community, stay close with relevant updates in the industry and foster a growing internal knowledge base.\n\nQualifications\n\nYou Have\n\n5+ years of experience in designing and shipping scalable systems and products\nStrong CS fundamentals with experience across a range of disciplines\nHave driven the designs of complex products and architectures\nEntrepreneurial and have demonstrated ability to handle ambiguity\nProduct focused mindset and genuine interest in user experience\nAbility to set technical and cultural standards for engineers\nExperience working with open source projects\nAbility to mentor and grow the team\nInterest and ability to pick up new technologies quickly\n\nEven Better\n\nFamiliar with fiat payment systems\nFamiliar with Solidity and Rust programming languages\nExperience or interest in building smart contracts and protocols, and developing Dapps or Web3 applications\nPassionate about DeFi protocols\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $202,500 - USD $247,500\n\nZone B: USD $192,400 - USD $235,200\n\nZone C: USD $182,300 - USD $222,800\n\nZone D: USD $172,200 - USD $210,400\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","solidity","rust"]},{"job":"Sr. Director eCommerce","company":"PLBY Group, Inc.","location":"Los Angeles","post_date":"2d","link":"https://web3.career/sr-director-ecommerce-plbygroup-inc/40095","key":"40095","details":"***This is an LA-based position***\n\n\n\n\nPlayboy is now part of PLBY Group. What was once a legacy brand that catered to the male gaze has transformed into an innovative life>the place to celebrate pleasure for all, creative freedom, artistic expression, and sex positivity.\n\n\n\n\nWe have a strong global brand with the unique ability to play in both the physical and digital worlds across consumer products, experiences, NFT and blockchain, and gaming.\n\n\n\n\nPLBY Group’s team is top-tier talent to continue the company’s dramatic transformation; and with a renewed commitment to women’s empowerment, inclusion, and social advocacy, today’s Playboy is committed to using its platforms to advance social change. From investing in employees through wellness, fertility, health, and parental benefits, to investing in women’s rights and LGBTQIIA+ organizations around the globe, there’s a wealth of impactful work being done.\n\n\n\n\nWho We Seek: We are looking for a Senior Director of eCommerce.The Senior Director of eCommerce is responsible for collaborating cross-functionally to manage and direct all aspects of the business. This includes strategizing, budgeting, planning, and executing content plans, overseeing the generation of promotional materials and campaigns, monitoring performance analytics, website traffic and product performance, among other things.\n\n\n\n\nWhat You’ll Do:\n\nLead and drive digital strategy and execution including driving performance and online sales in a commercial trade environment\nManage the overall user experience, including site navigation, content development in conjunction with the Marketing team, checkout funnel and promotional campaigns\nBe a key component in developing the effective planning and execution of an e-commerce strategy, working cross-functionally with teams to ensure QA and timely publishing of all web content\nReport on business trends and provide insights and recommendations to senior management team on how to further maximize results for our digital business\nGuide International teams on best practices for their digital platforms and online businesses\n\n\n\nWhat You’ll Bring:\n\nBachelor's degree in eCommerce, Digital Technologies or equivalent highly preferred\nStrong experience with SEO/SEM, google analytics, and CRM software\nStrong team management and communication skills\nExcellent analytical and project management skills\nKnowledge of best practices for on-line retail marketing including testing procedures, keyword optimization and product listing optimization\nSuperior project, time, and budget management skills\nStrong leadership skills – includes analytical, strategic, and critical thinking skills\nStrong communication skills, verbal and written coupled with strong leadership experience\n\n\n\nThis job description has been approved by the Company. Please note this job description is intended to convey information essential to understanding the scope of the job and the general nature, level, and expectation of the work to be performed. It is not designed to cover a complete list of qualifications, skills, efforts, duties and responsibilities or activities associated with this position, as they may change at any time, with or without notice.\n\n\n\n\nPLBY Group is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. The right talent for us innately embodies our values. Come as you are.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["executive","ecommerce","senior","nft"]},{"job":"Affiliate Sales Coordinator","company":"Afterpay","location":"San Francisco","post_date":"2d","link":"https://web3.career/affiliate-sales-coordinator-afterpay/40094","key":"40094","details":"Company Description\n\nSince we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn’t work together.\n\nTo solve this problem, we expanded into software and built integrated solutions to help sellers sell online, manage inventory, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we’ve embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.\n\nToday, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We’re building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.\n\nJob Description\n\nAs Afterpay’s Associate Affiliate Partnerships Coordinator, you’ll:\n\n\nEnsure successful execution of advertising campaigns for retail partners at scale\nLiaise with retailers, affiliate networks and internal cross functional teams to support sales functions\nTrack, measure and communicate campaign performance to internal and external stakeholders\nBuild and streamline internal processes to ensure that advertising partners receive the highest level of sales and operational customer service\nMeet individual & team deadlines, KPIs, and drive success toward sales targets\n\nQualifications\n\n1+ years experience in a sales, sales operations or coordinator role\nExcellent organizational & time management skills\nDemonstrated track record of meeting & exceeding KPIs and sales targets\nExcellent communicator with strong interpersonal skills and ability to build relationships within various vertical/industries via email and phone\nThrives in fast-paced organizations while producing quality results\nExcels in cross functional collaboration\nAnalytical mindset, experience with Excel or relevant data analysis programs\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $34.09 - USD $41.68\n\nZone B: USD $31.73 - USD $38.75\n\nZone C: USD $28.99 - USD $35.43\n\nZone D: USD $25.58 - USD $31.25\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","sales"]},{"job":"Senior Software Engineer Backend","company":"Sorare","location":"New York","post_date":"2d","link":"https://web3.career/senior-software-engineer-backend-sorare/40093","key":"40093","details":"Sorare is at the intersection of sports, gaming, and NFT collectibles. Through tradable digital cards, Sorare is designing a collective fantasy sports experience where you can manage your favorite players, hone your passion to earn prizes, and be part of a thriving community. Anyone, anywhere, can connect with the game on Sorare. The company's mission is to build \"the game within the game\" and to give fans, players and clubs the platform to celebrate, share, and own your game.\n\nFounded in 2018, Sorare has seen tremendous growth. The platform has a card sales volume of over $400M since January 2021 (up from $8M in sales in 2020) and now has exclusive partnerships with over 250 football (soccer) clubs, the MLB & MLBPA, and the NBA & NBPA. Sorare is trusted by a world-class team of investors including Softbank, Benchmark, Accel Partners, athletes such as Serena Williams and Kylian Mbappé, and key tech investors such as Alexis Ohania - all who believe in the future of integrating NFTs with Gameplay.\n\nSorare is looking for a Senior Software Engineer to join the team. You should be excited to join a growing start up where you'll work on a cutting edge product. You should have a strong understanding of backend development, with the interest to develop and implement your own features. This role is working on a live, in production game, therefore the work that you do impacts our players directly, so having a sensibility for the user is important. You'll be working closely within a team of developers, reporting into the Head of Engineering. All of our team members have a say in the shape of the product, you will attend weekly meetings to help define the roadmap and priorities and then work towards building our unique and category leading game.\n\nYou don't have to like Football, games or crypto to work here. What we look for is people who like to get things done, work in a growing company, take ownership and autonomy for their work, and want to learn and develop.\n\nResponsibilities\n\nDrive complicated projects from inception to completion\nCare deeply about security, performance, and maintainability\nWork with product and design to implement core features for our players\nBuild new tools and systems to scale our infrastructure\nTechnologies we currently use:\nBlockchain: Ethereum, Solidity, Starkware\nLanguages: Ruby, Go, Typescript\nFrameworks: Rails, React, GraphQL\nServices: Algolia, PostgreSQL\nPlatforms: AWS, Kubernetes, Docker\n\nRequirements\n\n5+ years of experience as a software engineer or developer\nYou have hands-on knowledge of backend development\nIndependent and highly motivated: You are able to conduct by yourself with an eye towards quality\nEager to learn: You are not afraid by new technologies or new paradigms\nAttentive to details: From front to back, you strive for the best quality\nExcited to work on a growing team, solving complex issues\nExcellent spoken and written communication skills in English\n\n\nBenefits\n\nHealth Care: Great medical, dental, and vision insurance coverage\nWellness Benefit: Sorare contributes to employees wellness (gym membership or ClassPass)\nCommuter Benefits: Sorare contributes to the cost of your commute\nLatest Tech: Sorare provides equipment such as monitors, computer, headphones, etc\nAt-Home Work Station: Sorare covers the cost of an at home set up\nLunch: Sorare will contribute to their employees lunch expenses\nTime Off: For US employees, we offer unlimited paid time off in addition to observed company holidays. For French employees, we offer 5 weeks of paid holidays per year in addition to the national holidays\n\n\nSorare is an equal opportunity employer committed to an inclusive and diverse workplace. All applicants will be considered for employment without attention to: race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status or any other basis prohibited by law.\n\nAs we are an international company, please note we speak English in the workplace. Please apply for the role with an English CV so we can process your application.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["backend","dev","senior","react","solidity"]},{"job":"Smart Contracts Developer","company":"Tassat","location":"New York","post_date":"2d","link":"https://web3.career/smart-contracts-developer-tassat/40092","key":"40092","details":"About Tassat\n\nTassat Group Inc. is a NY-based technology company that is the leading provider of private blockchain-based, real-time solutions for commercial banks including TassatPay, which enables banks to provide their customers with instantaneous, secure, real-time payments 24/7/365. TassatPay has become the most trusted blockchain-based platform for the banking industry and its B2B customers with more than $500 billion in secure, real-time transactions to date. Tassat has added Smart Contracts and Fedwire functionality to make TassatPay a one-stop shop for B2B Payments. Tassat was honored with a 2021 Google Cloud Customer Award for innovation in financial services. For more information, visit us at www.tassatpay.com, on Twitter or on LinkedIn.\n\n\n\n\nThe Role\n\nTassat is seeking a Smart Contracts Developer. This role reports to the Director of Software Engineering.\n\nWhat You Own\n\nDevelop technical requirements for on-chain programs based on business requirements\nCreate smart contracts and supporting documentation to expand Tassat's product suite\nWork directly with technology teams to create blockchain application-related deployment, configuration, monitoring, and integration software components\nLiaise with various groups like product and operations to help design and communicate necessary system changes\nLead with a data-driven mentality; create and own metrics, service level agreements and Indicators for your areas\nManage multiple in-flight projects for future state process/procedures/systems\nMaintain technical understanding for changes in blockchain technology and trends\n\n\n\nWhat You Bring\n\nExperience in developing smart contracts and blockchain-based applications on Ethereum Virtual Machine blockchains (experience across additional non-EVM blockchains a plus)\nDeep experience in Solidity, understanding of lower level EVM assembly, and at least one non-smart contract language for testing and integration (e.g., JavaScript, Rust, Java)\nExperience in latest smart contract development tools, patterns, and practices (e.g., current upgradeable patterns, current automated testing tools)\nExperience in building complex on-chain interactions and systems (e.g., multi-contract calls, oracles, DeFi protocol functionality)\nExperience in integrating on-chain systems and data with off-chain back-end systems\nExperience in developing code and documentation to support internal and external reviews and audits\nExperienceof multi-chain environments and bridging data across blockchains a plus (e.g., between layer 1's and/or layer 1 to layer 2)\nExperience working with blockchain on the underlying consensus/execution layer a plus (e.g., running and interacting directly with a blockchain node)\nExperience with Cosmos and Polkadot Smart Contract Development a plus.\nExperience in traditional financial services a plus\nExperience in building financial products/systems on-chain a big plus\nSkillsets that align with money markets, mortgage and lending, interest rates, and other areas of banking are a plus.\n\n\n\nWorking with Us\n\nTassat is proud to offer an incredible Benefits Package for full-time Tassat Employees. This includes:\n\n100% coverage on Health (with a Health Reimbursement Account) Dental, Vision Insurance\nShort Term Disability, Life & ADD, Long Term Disability\nPaid Time Off, Paid Holidays, Parental Leave\n401(k) program, Company Equity\nTransit and Parking Pre-tax savings\nFSA Dependent Care, FSA Health Pre-tax savings\n\nAt Tassat, you will work with incredibly talented engineers, market experts, and thought leaders to shape the future of a financial ecosystem. We offer a uniquely entrepreneurial, supportive culture, where ideas can come from anywhere and execution is everything.\n\nWe understand the importance of autonomy, mastery, and purpose\nWe strive to be extremely transparent, organizationally flat, and open-minded. While you will have clearly delineated responsibilities, you are welcome and encouraged to contribute beyond those areas. We value ideas and results, not ranks and titles\nWe believe great results can only come from great people. If you’re interested in working alongside people wo are bright, creative, and diligent – this is the place.\n\nWe value people who can bring new perspectives to our company. Here are some traits that are important to us:\n\nAbility to solve problems head on (and hands-on) and in simple creative ways\nBring unwavering passion to the team and the work you do\nSavvy researcher, continuous learner, and enthusiastic team player. We need you to feel like an owner, motivated to succeed and enthusiastic about helping others\n\n\n\nTassat’s Core Values\n\nOur 8 core values represent how we function daily – they embody our culture and are the foundation of our character. They help guide us in decision-making, creating processes, hiring, and retaining the right people.\n\nBe an Owner\nAccept Only the Best\nAsk Why, Propose How\nBe Bold, Innovate\nLift as You Climb\nInsatiable Curiosity\nGrow Fearlessly\nBe Human & Respectful\n\n\n\nTassat Group Inc. is committed to building a diverse, equitable and inclusive (DEI) organization. We believe our company and products are strengthened when they are developed and supported by individuals with diverse life experiences, whose understanding of social and cultural issues can help make our work and workforce more inclusive. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\n\n\n\nIMPORTANT NOTICE: All Tassat employees in the New York metropolitan area are required to be in the office in accordance with Tassat’s hybrid “Return-to-Office Policy”, which may be amended from time to time. All Tassat employees are required to show proof of receipt of a COVID-19 vaccination before reporting to the office (unless they can demonstrate they are prohibited from receiving a COVID-19\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","smart","contract","solidity","ethereum","javascript"]},{"job":"Software Engineer Full Stack Web3 Engineering Fulltime Remote","company":"Space and Time","location":"Los Angeles","post_date":"2d","link":"https://web3.career/software-engineer-full-stack-web3-engineering-full-time-remote-spaceandtime/40090","key":"40090","details":"Software Engineer, Full Stack Web3 Engineering\n\nFull-time, Remote (Southern California a strong plus)\n\nAt Space and Time, we are solving Web3’s toughest data analytics challenges at planetary scale with decentralized, peer-to-peer technology. Dapps built on top of Space and Time become blockchain interoperable, crunching SQL + machine learning for Gaming/DeFi data as well as any decentralized applications that need verifiable tamperproofing, blockchain-security, or enterprise scale. We turn any major blockchain into a next-gen database by connecting off-chain storage with on-chain analytic insights. Our team is growing fast, backed by some of the top blockchain orgs and VCs.\n\nA career at Space and Time is lucrative, fast-paced, and very creative. We value you (and all your ideas) like family and we bring an endless supply of perks. This includes flexible workweeks + flexible vacation, add-on bonuses for hard work, we attend exciting events/conferences/parties, we’re headquartered on the beach near LA (but don’t mind you working remote), and most importantly- we provide analytics technology to the largest Dapps, DAOs, DeFi/DEXs, GameFi, NFT platforms, blockchain providers, enterprises, etc. We are committed to growing a diverse and welcoming team in a safe space to be yourself and learn from the most innovative minds in blockchain and data warehousing. Help us invent the first decentralized supercomputer!\n\nAs a Software Engineer for our Web3/Blockchain/Oracles Engineering team, you will join highly skilled full stack engineers responsible for developing a dapp interoperability platform and backend to Web3. You will focus on hosted cloud analytics infrastructure for major blockchains, multichain or cross chain smart contract frameworks, tamperproof blockchain indexing techniques, proprietary zkSNARK-like proofing mechanisms. You will partner with internal and external teams to build and scale dapps on top of our data platform. This team is responsible for building the integrations between our decentralized data warehouse and major blockchains via oracle networks, which will also be used for query validation and network management. In addition, you’ll be defining Web3 analytics challenges that supporting teams will help solve. This role is vital to our organization and will report to exec leadership and senior engineering leadership.\n\nResponsibilities\n\n\nYou will be developing innovative techniques to anchor data to blockchains via smart contracts as well as to index/read from blockchains via tamperproof RPC calls.\nIntegrating our data platform with the web3 stack (MetaMask, Web.js, Hardhat, OpenZeppelin, Filecoin, Oracle Networks, multichain smart contracts, etc)\nBuilding tools, platforms and database integrations to turn a blockchain-secured data/analytics platform into a user-facing hosted cloud solution\nCodifying best practices for future reuse in the form of accessible, reusable patterns, templates, and code bases to facilitate meta data capturing and management\nWorking with engineering leadership to define, prioritize, and ensure smooth deployments with other operational components\nEngaged with blockchain/Web3 trends\nUnderstand how data and analytics use cases across Web3 and major blockchains can be optimized\n\nSkills & Qualifications\n\nBachelor’s degree in computer science or related technical field.\n3+ years experience engineering software with JavaScript or other app dev stack\n1+ years experience engineering software at a leading Web3 org\nRock solid engineering fundamentals; any of the following: Javascript (React + Node), Solidity, Rust,\nSmart Contract dev, L1/L2 blockchain dev, Chainlink Oracles\nKnowledge of blockchain indexing, web3 stack, consensus mechanisms, etc\nExperience with rapid development cycles in a web-based environment\nStrong scripting and test automation knowledge\nPassionate about Web3, blockchain, decentralization, and a base understanding of how data/analytics plays into this\nAbility to engage senior business leaders and translate between the needs of the business and the demands of / capacities of technology\n\nWhat We Offer\n\nVery competitive salaries\nMedical, dental and vision insurance, disability/life insurance 401(k) Plan\nAggressive bonus structure and/or Space and Time token allocations (similar to stock options)\nVery flexible PTO and paid holidays, and flexible workweek\nVery flexible remote work options\nA massive list of perks including discretionary add-on bonuses for hard work, attending exciting events/conferences/parties, we’re headquartered on the beach near LA (but don’t mind you working remote)\nSpace and Time is an EOE and committed to building a diverse team\n\nOur Commitment to Diversity and Inclusion\n\nAt Space and Time, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Space and Time are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["remote","dev","full","stack","full","time","react"]},{"job":"Quantitative Analyst Data Products","company":"Chainlink Labs","location":"United States","post_date":"2d","link":"https://web3.career/quantitative-analyst-data-products-chainlinklabs/40089","key":"40089","details":"All roles with Chainlink Labs are globally remote based. We encourage you to apply regardless of your location.\n\nThis is a newly created position for someone who is passionate about data on Blockchains, DeFi, financial products, and who can contribute quantitatively to new data products to drive adoption. In this role, you'll be the go-to person to evaluate price aggregation methodologies, develop novel data products, analyze large sets of on-chain and off-chain data and backtest different valuation approaches.. You will closely collaborate with leading DeFi projects and across Chainlink to improve quality of pricing data and deliver novel data products. We want you to take a leading role in choosing what data sources are implemented into our systems, effectively making the leading data products used across the DeFi/smart contract industry. As the first financial engineer in the team, your work will have a significant impact across the DeFi space, and you will play a critical role in how we scale the data product function.\n\nYour Impact\n\n\nEvaluate and influence aggregation methodologies to produce reliable prices for digital assets\nResearch, propose and test pricing methodologies for illiquid assets\nActively engage with data product users to collect detailed requirements for indices and indicators to turn into data products for the DeFi / CeFi communities\n\n\nRequirements\n\nDeep knowledge of benchmark and indexing methodologies, and benchmark quality design within capital markets and/or crypto\nEngineer background (Python, R) & understanding financial data\nStrong quantitative (including statistical analysis) background\nExperience with pricing methodologies for liquid and illiquid assets\nPassion for the blockchain space and its power to change the world for the better\n\n\nDesired Qualifications\n\nExcitement for blockchain, Web 3.0, and similar decentralized technologies\nExperience working remotely in a distributed team\nExperience with DeFi protocols\nPortfolio design\nAgent based modelling\n\n\nOur Stack\n\nPython, SQL, R, Solidity\n\nOur Principles\n\nAt Chainlink Labs, we’re committed to the key operating principles of ownership, focus, and open dialogue. We practice complete ownership, where everyone goes the extra mile to own outcomes into success. We understand that unflinching focus is a superpower and is how we channel our activity into technological achievements for the benefit of our entire ecosystem. We embrace open dialogue and critical feedback to arrive at an accurate and truthful picture of reality that promotes both personal and organizational growth.\n\nAbout Chainlink Labs\n\nChainlink is the industry standard oracle network for connecting smart contracts to the real world. With Chainlink, developers can build hybrid smart contracts that combine on-chain code with an extensive collection of secure off-chain services powered by Decentralized Oracle Networks. Managed by a global, decentralized community of hundreds of thousands of people, Chainlink is introducing a fairer model for contracts. Its network currently secures billions of dollars in value for smart contracts across the decentralized finance (DeFi), insurance, and gaming ecosystems, among others. The full vision of the Chainlink Network can be found in the Chainlink 2.0 whitepaper . Chainlink is trusted by hundreds of organizations—from global enterprises to projects at the forefront of the blockchain economy—to deliver definitive truth via secure, reliable data.\n\nThis role is location agnostic anywhere in the world, but we ask that you overlap some working hours with Eastern Standard Time (EST).\n\nWe are a fully distributed team and have the tools and benefits to support you in your remote work environment.\n\nChainlink Labs is an Equal Opportunity Employer.\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["analyst","solidity"]},{"job":"Formal Methods Verification Engineer","company":"Blockswap","location":"London","post_date":"2d","link":"https://web3.career/formal-methods-verification-engineer-blockswap/40087","key":"40087","details":"Formal Methods / Verification - Engineer\nLondon /\nEngineering – Engineering /\nRemote\n/ Remote\n\nApply for this job\nBlockswap is a middle layer for Web3 multichain composability.\n \nWe Blockswap Labs is a major contributor to the Blockswap Network, building a suite of products to support the Multichain composability for staked ETH. Our team is one of the most impactful and knowledgeable in Cross-chain Communication. We are a very diverse, globally distributed team.\n\n\nThe company was founded by leading cross-chain specialists and DeFi engineers. We are a small team crushing the scene with a passion for DAO, DeFi, and NFT and a relentless commitment to extending crypto benefits to mainstream everyday users.\n\n\nOur anchor product is Stakehouse championing Multichain ETH, enabling anyone from anywhere to have a permissionless ETH stake yield on DeFi and a key proponent of the Rollup-centric future of Ethereum. We have a laser focus on last-mile user onboarding, and our ecosystem has been growing from strength to strength. \n\n\n\n\nWe are looking for a Software Engineer - Formal Methods / Verification to join our Engineering team. The candidate shall have previous verification experience, academic, industrial, or both—knowledge of formal semantics and formal verification. \n\n\nYou will be involved in Protocol design reviews by formalizing architecture and their reasoning; you are the interface between development engineers and the Formal Verification and Security team. You will produce formal specifications for Blockswap protocols, iteratively refining specifications, modeling, and proving them using formal frameworks and tools. \nRequirements:\nExperience in formal methods or tools, e.g., proof assistants, interactive/automated theorem provers, model checking, deductive verification, etc.\nExperience with unit testing, documentation, design, and code reviews with strong mathematical and logical thinking skills.\nGood written communication skills and ability to write and understand the mathematical notation\nKnowledge of mathematical proof methods (induction, contradiction, exhaustion, probabilistic proofs)\n Basic secure software pattern and smart contract vulnerability knowledge (Reentries, invariants, etc.)\nIndustrial experience in formally verifying real-world systems.\nStrong reasoning skills and Excellent English communication skills.\nResponsibilities\nYou will design formal methods that define the correctness of smart contracts logic that helps to review and identify security issues and bugs in our protocols. \nWrite (semi-)formal specifications and turn them into high-quality executable, verifiable, and verified code.\nExtend the scope and depth of our protocol specifications using formal proofs and verification tools such as Certora Prover. \nIdentify security properties of smart protocol contracts and formalize properties and invariants for use in our automated verification tools.\n Closely collaborate with our software engineers to solve development/pre-deployment problems and address them.\nYou will have the opportunity to work on all stages of next-generation DeFi, ZK, and Metaverse protocol development, from the initial design reviews to production implementation. \nOur team is highly supportive and collaborative, with great opportunities to learn and grow.\nRequired Qualifications\nMaster’s Degree in Computer Science or a related field.\nMinimum of 2 years of experience with model checking, formal verification, SAT/SMT solving, abstract interpretation, or closely related disciplines. \n Demonstrated knowledge of fundamental computers science concepts such as data structures, algorithms, mathematical logic, and automata theory.\n Ability to deliver high-quality code and ensure it through various testing techniques (e.g., property-based testing);\nNice to have:\nExperience with formal verification tools (K, Certora, etc.)\nKnowledge of basic financial primitives (Stocks, Bonds, Interest rates, etc.)\nPrevious experience in DeFi protocol verification\nExperience in – networking, distributed systems, programming language design, and blockchain applications – would be a bonus.\nDemonstrated ability to work on complex problems in a self-driven way.\nIdeal profile\n\n\nBackground in programming language theory and automated reasoning and love to work with a web3 product development team applying results from theoretical computer science. \n\n\nYou love to solve challenging problems and have a proven track record of achieving results. You are collaborative, love to brainstorm with peers, and give and receive feedback. You are comfortable with the unknown and understand that #startuplife means you will wear multiple hats.\n\n\n\n\nBlockswap is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. We embrace all qualified persons to apply and will receive consideration for employment without regard to race, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.  If you have a disability or special need that requires accommodation, please feel free to let us know.\nApply for this job\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","ethereum","nft"]},{"job":"web developer","company":"consola.finance","location":"Remote","post_date":"1mo","link":"https://web3.career/web-developer-consola-finance/37906","key":"37906","details":"web developer\n\nWe are a young company, backed by top VCs and business angels to build the leading end-to-end finance collaboration platform for web3 organizations. We are two highly motivated founders with a background in leading positions in Bitpanda, BCG, aggle.io and Bearingpoint. Our mission is to enable web3 companies to focus on their core business and not worry about back-end finance processes. We have a strong background in leading web3 companies and are committed to contribute to one of the fastest growing industries. Consola.finance identified and is solving the main problems that Web3 organizations currently face.Now we are waiting for you to join our team and grow alongside the company!\n\n\nWhat are we looking for\n\n\nA junior, mid or senior frontend web developer\nFlexible allrounder with hands-on mentality, ready to learn and adapt\nAbility to work with deadlines and in a fast-paced environment\nNo minimum years of experience required - we have a short task/homework for you to showcase your potential\nFull-time and part-time possible\nOur tech stack\n\n\nTypescript, Next.js, Tailwind\nGitlab, Vercel and AWS Cloud Services for deployment and operations\nWe expect you to bring new ideas and best practices to improve further development of the company. Make an impact!\nYour main responsibilities\n\n\nCreate new flexible and customisable UI components - be creative!\nKeep constantly enhancing the user experience on our platform\nOversee responsiveness and design consistency\nOptimize data flows between different pages and views, apply best practices\nWhy should you join us?    Build consola.finance with close cooperation with our well experienced CTO. Besides being a former founder of a successful web3 company, he has over 10 years of experience in large scale cloud applications. He will guide you through your career path and can potentially mentor/coach you to grow to our Head of Engineering in the future.\n\n\nOur benefits\n\n\nWe are an EU-based Fintech company with the latest tech-stack and a working prototype. You can be a part of the very beginning and be a part of the fast growing crypto space.\nPotential to grow at this position to Lead Developer or Head of Engineering, depending on your seniority.\nJoin a team of amazing people! Both CEO and CTO are professionals with experiences from the top companies in the market. We also have reputable business angels supporting our company!\nFlexible working hours, 100% remote possible\nLatest hardware - Mac or PC\nCutting edge technology, cloud first, cross chain development\nOpen feedback culture and high quality standards\nRegular team events\nInterested? Contact us at hiring@consola.finance\n\n\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","aws","cloud","crypto","front","end"]},{"job":"VP of Marketing","company":"Tafi","location":"UT Salt Lake City US","post_date":"2d","link":"https://web3.career/vp-of-marketing-tafi/40086","key":"40086","details":"At Tafi and DAZ 3D, we build tools and help humans and brands express themselves through stylized and uber creative assets for the digital world.\n\nAbout Tafi and Daz 3D\n\nDaz 3D empowers 3D artists and designers with a free, comprehensive software suite and a massive 3D marketplace with over 5 million inter-compatible assets for Daz Studio and other 3D applications. Daz 3D and Tafi have entered the NFT space with many collections releasing throughout the year.\n\nLeveraging Daz technology, Tafi’s mission is to make personalized avatars, NFTs and branded\n\ndigital content available to everyone who wants to level-up their digital personality. Partnering\n\nwith mobile phone platforms and software applications, Tafi puts its world-class avatar content\n\nengine at our customers’ fingertips.\n\nVP of Marketing\n\nLocation: Salt Lake City, UT or Vancouver, BC\n\nPosition Type: Full-Time Salary\n\nReports to: President\n\nAs the VP of Marketing your role will include building and leading the marketing team for both Daz/Tafi. This will include overseeing brand marketing, building brand awareness, executing effective marketing campaigns, PR/Communications, among other areas.\n\nYour Impact as a VP of Marketing\n\nCreate a marketing strategy and plan to drive user engagement across all platforms\nDesigning, planning, and executing effective marketing campaigns\nDevelop the TAFI brand and presence by developing brand identity, ensuring our brand platform and message is strong and consistent across all channels\nPartner with creative teams to build a robust social and marketing content calendar across all owned and third-party channels\nBuild a high performing marketing team and ensure effective coordination with other teams\nProvide in-depth analysis measuring the success of campaigns/tools developing KPIs, communicating results to relevant stakeholders.\n\nYou Bring to Daz 3D and Tafi:\n\n5+ years’ experience in a marketing leadership role at a tech company\nB2B marketing experience\nPrior experience building comprehensive marketing programs from the ground up\nAn understanding and passion for the web3.0, blockchain, crypto, and NFT spaces\nStrong knowledge of creative and content production workflows for cross-functional projects\nExperience growing product adoption and defining product differentiation in the marketplace\nStrong organizational, and problem-solving skills, with a proven ability to handle multiple priorities, workflow, and people\nStrong business sense and a commitment to excellence/high standards\n\nBonus Skills and Abilities\n\nExperience working in a start-up culture\nA willingness to help out where needed - regardless of the scope of your role\n\nWhat do Daz and Tafi Have to Offer?\n\nCompetitive salary\nQuarterly bonus potential\nHealth, dental, vision insurance with most or all of premiums paid by the company\n401k matching plan\nCasual dress and winning attitudes - we care most about what you can do with us\nUnlimited paid vacation potential\nPaid monthly gym membership at VASA or reimbursement to a gym of your choice\nRewarding work, you’re proud to be a part of.\nIn-Office Benefits:\nIdeal downtown location - tons of nearby options for walking to lunch\nOpen loft->\nMonthly parking/transit allowance\nFull kitchen with all the caffeine and healthy(-ish) snacks you can consume\n\nOur Commitment to Diversity, Equity, and Inclusion\n\nWe strive to create and maintain an environment where all our employees feel included and empowered to work from a safe environment. We celebrate and value each employee’s unique experiences and perspectives across our company and recognize that fostering a diverse, equitable and inclusive place to work ensures a vibrant and joyful place for artists to explore their creativity.\n\nDo I need ALL Criteria to Apply To Daz 3D and Tafi?\n\nHeck no! We value artistic passion and curiosity. If you think you have something we should be looking for, please apply and let’s see where the conversation goes!\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["marketing","non-tech","executive","nft"]},{"job":"Software Engineer Intern","company":"Aptos","location":"Palo Alto","post_date":"3d","link":"https://web3.career/software-engineer-intern-aptoslabs/40081","key":"40081","details":"About The Role\n\nOur team is excited about hosting highly qualified interns in different projects in and around Aptos.\n\nWhat you'll be doing:\n\nBlockchain technology including storage, observability, performance\nAdvancing language tools for Move such as compilers and verifiers\nSmart contract development across frameworks and applications\nApplications and implementation of cryptographic primitives\nData platforms for indexing data, providing observability, and giving access to core blockchain data\nEnhancing developer experience support around APIs, SDKs, and wallets\nDemonstration and proof of concept applications that take advantage of the full stack (DeFi, CeFi, Tokens)\nProduction products like explorers, wallets, name services\n\nWhat we’re looking for:\n\nFluent in English\nPrior experience in the areas of interest listed above\nExperience programming in Rust, TypeScript (JavaScript), or Python\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","intern","entry","level","javascript","rust"]},{"job":"Software Engineer Permance Engineering Blockchain","company":"Ripple","location":"San Francisco","post_date":"3d","link":"https://web3.career/software-engineer-performance-engineering-blockchain-ripple/40080","key":"40080","details":"Ripple’s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of massive scale spanning $155 trillion in annual cross border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year.\n\nWe are looking for performance engineers to join a growing team that is in charge of performance, scalability and reliability of the XRPL network. You will work closely with developers, scientists, devOps and other members in the performance team to gain deep knowledge on software’s design; use cases and its data flow, model realistic load profiles and conduct comprehensive performance testing and tuning on products and features we deliver as a team to the XRPL community. The ideal candidate should have a strong CS background, be passionate about problem solving, possess strong analytical and logical thinking skills and be very detail oriented.\n\nWHAT YOU’LL DO\n\nWork with teams across the organization in acquiring performance requirements and load forecast metrics\nParticipate in the full software release lifecycle, from software design and development to the deployment of the products\nDesign performance testing load model and the associated test data to realistically simulate the load in the lab environment\nDevelop comprehensive load simulators and all necessary tools required for the setup and testing\nConduct iterative performance testing; bottleneck detecting/removing; code profiling and comprehensive tunings at all levels (OS, network, software and database)\nDevelop performance monitoring dashboard or tools for effective monitoring during testing\nCollect test results; conduct detailed analysis and generate test report\nWork with devOps to ensure the product’s readiness for production environment\nContinuously raise our standard of engineering excellence by proactively looking out for problematic signs that may affect product’s performance and/or reliability\n\nWHAT WE’RE LOOKING FOR\n\nBachelor’s degree or higher in Software Engineering, Computer Science, or equivalent industry experience\nFamiliarity with Linux shells; understanding of OS components; networking; web protocols and database operations\n2-4 year(s) of working experience in software engineering (including internship or research programs)\nProficient with one or two programming languages; strong computer science understandings\nIntellectually curious; hyper focused; problem driven and persistent - you are not easily satisfied with hypothetical explanation but driven in digging out the root cause\nExcellent communication skills in both verbal and written\nYou thrive on autonomy, responsibility and owning your work, end to end\nA positive attitude and a passion for sharing knowledge within your team and organization\nAttention to detail and a commitment to excellence\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["dev","blockchain"]},{"job":"Compliance Program Manager [Bitcoin] Cash App","company":"Cash App","location":"United States","post_date":"3d","link":"https://web3.career/compliance-program-manager-bitcoin-cash-app-cashapp/40079","key":"40079","details":"Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible. This is our mission, and it’s why working at Cash App means so much more than a job.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers!\n\nJob Description\n\nWe are looking for a Compliance Program Manager [Bitcoin] to join Block and support the continued build out of our Customer Onboarding and Management (COM) program at Cash App. Our mission is to make banking and financial services accessible to the underserved and unbanked by designing and implementing an outstanding compliance program to help grow the Cash App business while protecting the broader financial ecosystem and the Company.\n\nIn this role, you will support the Compliance team by contributing to the design and effectiveness of preventative and detective measures to enable proper detection and ongoing review as part of the Sanctions and KYC programs. You will collaborate with Compliance Leads and other relevant stakeholders to ensure our program complies with all applicable laws and regulations across jurisdictions. You will demonstrate excellent regulatory, process and systems design, data analytics, and documentation abilities.\n\nYou Will\n\n\nEvaluate current operational processes and procedures to ensure compliance with applicable laws, regulations and industry best practices\nIdentify and evaluate Sanctions and BSA/AML CDD and EDD requirements for new and existing products or features\nBuild tactical and scalable solutions for operational teams to manage compliance tasks and risks as it relates to the crypto program\nMake recommendations for and assist in executing process improvements and procedure updates for the KYC team\nDraft and maintain relevant documentation and content for changes to the program in accordance with regulatory updates, new products, and overall Compliance team policies and procedures\nCommunicate the progress of and oversee the end-to-end implementation of each operational change to leadership and relevant stakeholders\nStay apprised of regulatory developments, industry trends and Square roadmaps to drive decisions\n\nYou Have\n\nQualifications\n\n5+ years as a project or program manager with direct experience in BSA/AML compliance and crypto or 7+ years in relevant crypto role\nA strong analytical and metrics driven approach to create substantiated solutions\nStrong knowledge in Sanctions or BSA/AML regulations, risks and typologies\nStrong knowledge and experience in Cryptocurrency regulations\nSuperb organization skills with the ability to manage competing priorities\nExcellent verbal and written communication skills\nAdaptability in an agile and fast-paced environment\nAbility to execute independently and work with team members of all levels\nA mindset to deliver results proactively, resourcefully, and methodically\n\nEven Better\n\nRelevant industry certifications (CAMS, CFE, CFCS, CRCM)\nExperience with SQL and/or Looker\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A: USD $125,600 - USD $153,600\n\nZone B: USD $116,800 - USD $142,800\n\nZone C: USD $110,500 - USD $135,100\n\nZone D: USD $100,500 - USD $122,900\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nBenefits Include The Following\n\nHealthcare coverage\nRetirement Plans including company match\nEmployee Stock Purchase Program\nWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance\nPaid parental and caregiving leave\nPaid time off\nLearning and Development resources\nPaid Life insurance, AD&D. and disability benefits\nPerks such as WFH reimbursements and free access to caregiving, legal, and discounted resources\n\nThis role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page.\n\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis.\n\nBlock, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\nWhen applying, mention the word CANDYSHOP when applying to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human RMjYwMTo2MDA6OTY4MTo1ZDIwOjljNDoyYmIxOmQ3NzE6NWIyNwM\n\n⬇\nApply Now","tags":["compliance","executive","btc"]}]}